[
{
"Content": "1. Abu Ja'far Muhammad ibn Ali ibn Musa ibn Bawayh al-Qummi, (may Allah be pleased with him) said: Ali ibn al-Husayn, my father (may Allah be pleased with him) said, that Sa'd ibn Abd Allah on the authority of Ahmad ibn Abu Abd Allah al-Barqi said: Abu Imran al-Ijli said: Muhammad ibn Sinan said: Abu al-Ala al-Khaffaf said: Atiyyah alAwfi on the authority of Abu Sa'id al-Khudri, that The Messenger of Allah (SA) said: \"Neither I nor anyone before me has said anything like: There is no god but Allah\" [La ilaha illa Allah].",
"Hadith": 1
},
{
"Content": "2. Muhammad ibn al-Husayn ibn Ahmed ibn al-Walid (may Allah be pleased with him) said: Muhammad ibn al-Husayn al-Saffar said: Ibrahim ibn Hashim said on the authority of al-Husayn ibn Yazid al-Nawfili on the authority of Isma'il ibn Muslim al-Sakuni from Abu Abd Allah Ja'far ibn Muhammad (AS) on the authority of his father (AS) on the authority of his forefathers (AS) that The Messenger of Allah said: \"The best act of service [ibadah] is to say: There is no god but Allah\" [La ilaha illa Allah].",
"Hadith": 2
},
{
"Content": "3. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (may Allah be pleased with him) said: Sa'd ibn Abd Allah, on the authority of Ahmad ibn Hilal on the authority of al-Hasan ibn Ali ibn Fuddal, on the authority of Abu Hamzah that Imam Baqir (AS) said: \"There is nothing greater in reward than testifying that: There is no god but Allah [La ilaha illa Allah], because nothing equals Allah, the Mighty and High, and nobody shares His Power.\"",
"Hadith": 3
},
{
"Content": "4. Muhammad ibn Musa ibn al-Mutawakkil (may Allah be pleased with him) said: Muhammad ibn Ja'far al-Asadi said, that Musa ibn Imran al-NakhaI said, on the authority of his uncle al-Husayn ibn Yazid l-Nawfili, on the authority of Muhammad ibn Sinan, on the authority of al-Mufaddal ibn Umar that Imam Ja'far al-Sadiq (AS) said: \"Verily, Allah, Blessed and Exalted be He, has given the Believers a gurantee.\" I asked, \"What is it?\" He replied, \"If a Believer profess his faith in Allah's Divinity, Muhammad's Prophet hood, and Ali's Imamate, and carriers out his duties, He guarantees him eternal life in His Presence [jiwar].\" I said: \"By Allah! This is a blessing with which none of the blessings bestowed upon the sons of Adam can compare.\" Imam Ja'far al-Sadiq (AS) replied, \"They have done little but they have enjoyed much.\"",
"Hadith": 4
},
{
"Content": "5. Ahmed ibn Ziyad ibn Ja'far al-Hamadani (may Allah be pleased with him) said, that Aliibn Ibrahim ibn Hashim, on the authority of his father, from Muhammad ibn Abu Umayr, on the authority of Ibrahim ibn Ziyad al-Karkhi from Abu Abd Allah al-Sadiq (AS), from his father, from his grandfather, that The Messenger of Allah said: \"Whoever dies without ascribing a partner to Allah, will enter Heaven regardless of whether he has done good or evil.\"",
"Hadith": 5
},
{
"Content": "6. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (may Allah be pleased with him) said, that Muhammad ibn al-Hasan al-Saffar said, that Muhammd ibn al-Husayn ibn Abu alKhattab on the authority of Ali ibn Abu Hamzah, on the authority of Abu Basir that Abu Abd Allah al-Sadiq (AS) explained the Word of Allah, the Mighty and High: \"He is the most entitled to be feared and the most entitled to forgive.\" He said: Allah, Blessed and Exalted be He, said: I was the most entitled to be feared. Hence, My Servant should not associate partners with Me. I am the most entitled to grant Heaven to My Servant, so long as he does not associate partners with Me. And he (AS) said: \"Verily, Allah, Blessed and Exalted be He, has taken an oath by His Dignity and Glory that He will never punish the people who believe in His Unity with Hell-fire.\"",
"Hadith": 6
},
{
"Content": "7. Muhammad ibn Ahmad al-Shaybani (may Allah be pleased with him) said: Muhammad ibn Abu Abd Allah al-Kufi said, that Musa ibn Imran al-Nakha'I on the authority of his uncle alHusayn ibn Yazid al-Nawfili on the authority of Ali ibn Salim, Abu Abd Allah al-Sadiq (AS) said: \"Verily, Allah, Blessed and Exalted be He, has forbidden Hell-fire to the bodies of the Monotheists.\"",
"Hadith": 7
},
{
"Content": "8. My father (may Allah be pleased with him) said, that Sa'd ibn Abd Allah, on the authority of Ahmad ibn Muhammad ibn Isa, on the authority of al-Husayn ibn Sayf, on the authority of his brother Ali, on the authority of Sayf ibn Amirah said, that al-Hajjaj ibn Artat related to me, that Abu al-Zubayr on the authority of Jabir ibn Abd Allah that The Prophet (SA) said: \"Two events are inevitable: 1) The entry into Heaven of the person of the person who died witnessing that there is no god but Allah, and 2)The entry into Hell-fire of the person who died associating partners with Allah.\"",
"Hadith": 8
},
{
"Content": "9. My father, Ali ibn Husayn (may Allah be pleased with him) related to me, that Sa'd ibn Abd Allah on the authority of Ahmad ibn Muhammad ibn Isa on the authority of al-Husayn ibn Sayf, on the authority of his brother, Ali, on the authority of his father, Sayf ibn Amrah, on the authority of al-Hasan ibn al-Sabbah said, that Anas said: The Prophet (SA) said: \"None but the arrogant and the obstinate1 deny that there is no god but Allah.\"",
"Hadith": 9
},
{
"Content": "10. Ja'far ibn Ali ibn al-Hasan ibn Ali ibn Abd Allah ibn al-Mughayrah al-Kufi (may Allah be pleased with him) said: al-Hasan (my grandfather) ibn Ali al-Kufi on the authority of al-Husayn ibn Sayf, on the authority of his brother Ali, on the authority of his father Sayf ibn Mughayrah on the authority of Amar ibn Shimr, on the authority of Jabir bn Yazid al-Jufi said .       1 Abu Ja'far al-Baqir (AS) said: Jibra'il came to the Messenger of Allah (SA) and said: \"O Muhammad! Blessed is any member of your Ummah who professes that There is no god but Allah, Alone, Alone, Alone'.\"",
"Hadith": 10
},
{
"Content": "11. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (may Allah be pleased with him) said: Muhammad ibn al-Hasan al-Saffar on the authority of Ahmad ibn Muhammad ibn Isa, on the authority of al-Hasan ibn Mahbub, on the authority of Abu Jamilah, on the authority of Jabir said from Abu Abd Allah Ja'far (AS) that The Messenger of Allah said: Jibra'il came to me while I was in between al-Safa and al-Marwah and said: O Muhammad! Any member of your Ummah who professes with sincerity that There is not god but Allah Unique' will be blessed.\"",
"Hadith": 11
},
{
"Content": "12. Muhammad ibn Ali (my father) (may Allah be pleased with him) said: Ali ibn al-Hasan alKufi on the authority of his father, on the authority of al-Husayn ibn Sayf, on the authority of his father Sayf ibn Amirah, on the authority of Amar ibn Shimr, on the authority of Abu Tufayl that . Ali (AS) said: A Muslim servant has only to say the words There is no god but Allah,' and they ascend (to Allah), breaking through physical barriers. As they do so, they obliterate his sins as they pass them by, stopping only when they reach his good deeds.",
"Hadith": 12
},
{
"Content": "13. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (may Allah be pleased with him) said: Muhammad ibn al-Hasan al-Saffar reported, on the authority of Ahmad ibn Abu Abd Allah alBarqi on the authority of al-Husayn ibn Sayf, on the authority of his brother Ali, on the authority of al-Mufaddal ibn Salih on the authority of Ubayd ibn Zurarah that Abu Abd Allah al-Sadiq (AS) said: \"The statement There is no god but Allah' is the price of Heaven.\"",
"Hadith": 13
},
{
"Content": "14. Ali ibn al-Husayn al-Qummi (my father) (may Allah be pleased with him) related us that Sad ibn Abd Allah reported, on the authority of Ahmad ibn Muhammad ibn Isa, on the authority of al-Husayn ibn Sayf, on the authority of Sulayman ibn Amr said: Imran ibn Abu Ata' said: Ata' related on the authority of Ibn Abbas that The Prophet (SA) said: There is no statement more loved by Allah, the Mighty and High, than There is no god but Allah.' There is not a single servant (of Allah) who pronounces these words but that his sins are dispersed under his feet like the leaves of a tree are scattered beneath it.",
"Hadith": 14
},
{
"Content": "15. Abu Nasr Muhammad ibn Ahmad ibn Tamim al-Sarkhasi, the jurist of Sarkhas, said: Abu Labib Muhammad ibn Harun ibn Abd Allah al-Jammal on the authority of Abu Ayyub said: Qudamah ibn Muhraz al-Ashja'I related to me that Makhramah ibn Bukayr ibn Abd Allah ibn al-Ashajj, on the authority of his father, on the authority of Abu Harb ibn Zayd ibn Khalid al-Juhani related to me that I bear witness on my father, Zayd ibn Kahlid, that I heard him say The Messenger of Allah (SA) sent me on my way saying, \"Give glad tidings to the people! Whoever says, there is no god but Allah, Alone, who has no partners' will have Heaven as his reward.\"",
"Hadith": 15
},
{
"Content": "16. Muhammad ibn Musa ibn al-Mutawakkil (may Allah be pleased with him) said: Ali ibn alHusayn al-Sadabadi said: Ahmad ibn Abu Abd Allah al-Barqi said on the authority of his father, on the authority of Muhammad ibn Ziyad, on the authority of Aban and others, that Al-Sadiq (AS) reported, \"Whoever breaks his fast with virtuous words or a virtuous deed, Allah will accept his fast. He was asked: \"O son of the Messenger of Allah! What are the virtuous words?\" He replied, \"The virtuous words are bearing witness that there is no god but Allah.' And the virtuous deed is giving the (zakat of) Fitrah.\"",
"Hadith": 16
},
{
"Content": "17. Abu Mansur Ahmed ibn Ibrahim ibn Bakr al-Khuri said in Naysabur, that Abu Ishaq Ibrahim ibn Muhammadibn Harun al-Khuri said: Ja'far ibn Muhammad ibn Ziyad al-Faqih al-Khuri said: Ahmad ibn Abd Allah al-Juyibari known as al-Hirawi, and al-Niharawani and al-Shaybani said on the authority of al-Rida Ali ibn Musa (AS), on the authority of his father on the authority of his forefathers on the authority of Ali (AS) that The Messenger of Allah (SA) said: \"The one whom Allah has blessed with belief in Divine Unity shall have Heaven as his reward.\"",
"Hadith": 17
},
{
"Content": "18. With same chain of narrators as above that The Messenger of Allah said: \"Verily, there is no god but Allah,' is a glorious and noble saying about Allah, the Mighty, the High. Whoever says it sincerely merits Heaven.\"",
"Hadith": 18
},
{
"Content": "19. And as the above chain of narrators that The Messenger of Allah (SA) said: \"Be it day or night, anyone who professes that There is no god but Allah' will have all his evil deeds erased from his book (of reckoning).\"",
"Hadith": 19
},
{
"Content": "20. And the same chain of narrators that The Messenger of Allah (SA) said: Verily, Allah has a pillar of ruby, the top of which is under the Throne, and the bottom of which is on the back of the fish which swims in the Seventh Earth, which is the lowest. When a servant of Allah says: there is no god but Allah.' The Throne trembles, and both the pillar and fish move. So Allah, the Blessed, and the Most High says: O Throne of Mine! Remain calm!' Then it replies, How shall I remain calm, when you have not forgiven the one who uttered those words?' Then Allah, Blessed and Exalted be He, announces: O inhabitants of My Heavens! Bear witness that indeed, I have pardoned the one who has uttered these words.'",
"Hadith": 20
},
{
"Content": "21. Abu al-Husayn Muhammad ibn Ali ibn al-Shah a jurist at Marw al-Rawdh said: Abu Bakr Muhammad ibn Ad Allah al-Naysaburi said: Abu al-Qasim Abd Allah ibn Ahmad ibn Abbas al-Ta'i said in Basra, that: My father related to me in the year 260 (AH) that: Ali ibn Musa al-Rida (AS) related to me in the year 194 (AH) that: My father Musa ibn Ja'far (AS) related to me that: My father Ja'far ibn Muhammad (AS) related to me that: My father Muhammad ibn Ali (AS) related to me that: My father Ali ibn al-Husayn related to me that: My father al-Husayn ibn Ali (AS) related to me that: My father Ali ibn Abu Talib (AS) related to that The Messenger of Allah (SA): \"Allah, Glorified be He, said: There is no god but Allah' is My Fortress. Whoever enter it is save from My Chastisement.\"",
"Hadith": 21
},
{
"Content": "22. Abu Sa'id Muhammad ibn al-Fadl ibn Muhammad ibn Ishaq al-Mudhakkar al-Naysaburi said in Naysabur, that Abu Ali al-Hasan ibn Ali al-Khazraji al-Ansari al-Sadi related tome that Abd al-Salam ibn Salih Abu al-Salt al-Hirawi said I was with Ali ibn Musa al-Rida (AS) when he was setting off for his journey fro Naysabur and was riding a grey coloured mule, while Muhammad ibn Rafi, Ahmad ibn Harb, Yahya ibn Yahya, Ishaq ibn Rahawayh, and a number of other scholars were holding on to the bridle of his mule in Marba'ah. Thus, they all requested: \"With respect to your pure forefathers, relate to us a tradition that you have heard from your father.\" He leaned his head out of the camel-borne sedan, and he was wearing a woven fabric gown with two designs. He said: My father, the Pious Servant (of Allah) [al-Abd al-Saleh], Musa ibn Ja'far, related to me that; My father, Ja'far ibn Muhammad related to me that: My father, Abu Ja'far Muhammad ibn Ali al-Baqir (Opener of the Knowledge of the Prophets) related to me that: My father, Ali ibn al-Husayn the Master of Servants of Allah related to me that: My father, the Master of the youth of Heaven al-Husayn related that : The Prophet said: Allah, Glorified be He, said: \"Verily, I am Allah, and there is no god but Me; therefore, serve Me. Whoever bears true witness that There is no god but Allah' shall enter my Fortress, and whoever enters My Fortress is safe from My Chastisement.\"",
"Hadith": 22
},
{
"Content": "23. Muhammad ibn Musa ibn al-Mutawakkil (RA) said: Abu al-Husayn Muhammad ibn Jafar alAsadi said: Muhammad ibn al-Husayn al-Sufi said: Yusub ibn Aqil on the authority of Ishaq ibn Rahwayh said When Abu al-Hasan al-Risa (AS) reached Naysabur, and intended to go from there to al-Ma'mum, some traditionists met him. They asked him, \"O son of the Messenger of Allah! You are gong from us without relating any Hadith to us so that we can derive benefit from you.\" He was sitting in a camel-borne sedan, so he leaned his head out, and replied: I heard my father, Musa ibn Ja'far say: I heard my father Ja'far ibn Muhammad say: I heard my father Muhammad ibn Ali say: I heard my father Ali ibn Husayn say: I heard my father Husayn ibn Ali ibn Abu Talib say: I heard my father the Commander of the faithful Ali ibn Abu Talib (AS) say: I heard the Messenger of Allah (SA) say: I heard Jibra'il say: I heard Allah, Exalted be His Glory, say, There is no god but Allah' is my Fortress. Whoever enters My Fortress is safe from My Chastisement.\" When the camel passed by, he (AS) called out to us, \"That is subject to conditions. And I am among its conditions.\" The Compiler of this book explains: Among the conditions (of the statement; there is no god but Allah) is the acknowledgment that Al-Rida (AS) is an Imam appointed by Allah, the Mighty and High, over the people [ibad], and the one to whom obedience is due.",
"Hadith": 23
},
{
"Content": "24. Abu Nasr Muhammad ibn Ahmad ibn Tamim al-Sarkhasi said: Hariz on the authority of Abd alAziz, on the authority of Zayd ibn Wahb, on the authority of Abu Dharr (may Allah have mercy upon him) that I went out one night. The Messenger of Allah (SA) was all alone. I thought that he was averse to anyone walking with him. When I started walking in the moon light, he turned around and saw me. He enquired, \"What is that?\" I answered, \"Abu Dharr. May Allah make me your ransom!\" He (SA) said: \"Come here, O Abu Dharr!\" So I walked with him for some time. He said: Verily, the ones with much will be the ones with less. On the Day of Resurrection with the exception of those Allah has favoured. His Favour will spread to them from right to left, and from front to back. It will fill them with good. Abu Dharr says: I continued to walk with him for a while. Then he (SA) said: \"Sit down here. He made me sit down in some low ground around which was stones.\" He said to me, \"Sit down until I return to you.\" He (Abu Dharr) said: He went to a stony area until I could no longer see him. His delay was prolonged. Then I heard him coming, while saying, \"Even if he fornicated and eve if he stole?\" He said: When he came back, I immediately asked him, \"O Prophet of Allah! May Allah make me your ransom! Who are you talking to in the stony area for I did not hear anyone answer you?\" He replied, \"It was Jibra'il who appeared to me in that stony area and said: Glad tidings to your Ummah that anyone who dies without associating anything with Allah, the Mighty and High, will enter Heaven.\" He (SA) added, \"I asked Jibra'il: Even if he fornicated and even if he stole?' He replied: Yes, and even if he drank wine.'\"",
"Hadith": 24
},
{
"Content": "25. Abu al-Hasan Ahmad ibn Muhammad ibn Muhammad ibn Ahmad ibn Ghalib al-Anmati said: Abu Amr Ahmad ibn Al-Hasna ibn Ghazwan said: Ibrahim ibn Ahmad said: Dawud ibn Amr said: Abd Allah ibn Jafar on the authority of Zayd ibn Aslam, on the authority of Ata' ibn Yasar, on the authority of Abu Hurayrah that The Messenger of Allah (SA) said: \"When a man lies on his back, contemplates the sky and the stars, and says: By Allah! Verily, you have a Lord who is your Creator. O Allah! Forgive me!' Then Allah, the Mighty and High, looks down upon him with mercy, and forgives him.\"",
"Hadith": 25
},
{
"Content": "26. My father (RA) said: Sad ibn Abd Allah on the authority of Yaqub ibn Yazid, on the authority of Muhammad ibn Abu Umayr, on the authority of Muhammad ibn Humran that Abu Abd Allah al-Sadiq (AS) said, \"Whoever sincerely says: there is no god but Allah,' will enter Heaven. If the person is sincere, the profession there is no god but Allah' will refrain him from whatever Allah, the Mighty and High, has forbidden.\"",
"Hadith": 26
},
{
"Content": "27. My father related us that Sad ibn Abd Allah on the authority of Ahmad ibn Muhammad ibn Isa and Husayn ibn Ali al-Kufi and Ibrahim ibn Hashim all of which said on the authority of al-Husayn ibn Sayf on the authority of Sulayman ibn Amr on the authority of Muhajjir ibn Husayn ibn Zayd ibn Arqam who said that The Messenger of Allah said: \"Whoever sincerely says: There is no god but Allah' will enter Heaven. If the person is sincere, the profession there is no god but Allah' will refrain him from whatever Allah, the Mighty and High, has forbidden.\"",
"Hadith": 27
},
{
"Content": "28. Abu Ali al-Husayn ibn Ali ibn Muhammad ibn Ali ibn Amr al-Attar said in Balkh, that Muhammad ibn Mahud said: Humran on the authority of Malik ibn Ibrahim ibn Tihman on the authority of [Abu] Hasin on the authority of al-Aswad ibn Hilal on the authority of Muadh ibn Jabl who said I was with the Messenger of Allah and he (SA) said to me, \"O Muadh! Do you know what is the right of Allah, the Mighty and High, upon His Servants?\" He (SA) repeated this three times. I (respectfully) answered,\" Allah and His Messenger know best.\" The Messenger of Allah said: \"The right of Allah, the Mighty and High, upon His Servants is that they should not associate anything with Him.\" After that he asked, \"Do you know what the right of the servants is upon Allah, the Mighty and High, when they respect His Right?\" I answered again, \"Allah and His Messenger know best.\" He (SA) said: \"That He should not chastise them.\" Or he (SA) said: \"That He should not place them in Hell.\"",
"Hadith": 28
},
{
"Content": "29. Abu Ahmad al-Hasan ibn Abd Allah ibn Said al-Askari said: Muhammad ibn Ahmad ibn Humran al-Qishiri said: Abu al-Jarish Ahmad ibn Isa al-Kilabi said: Musa ibn Ismail ibn Musa ibn Jafar ibn Muhammad ibn Ali ibn al-Husayn ibn Ali ibn Abu Talib (AS) said in the year 250 (AH), that: My father related to me on the authority of his father who on the authority of his grandfather Jafar ibn Muhammad (AS) said: Jafar ibn Muhammad (AS) from his forefathers that Ali (AS) reported the following regarding the Word of Allah, the Mighty and High: \"Is the reward of goodness aught but goodness:\" I heard the Messenger of Allah (SA) say, \"Allah, the Mighty and High, has said: The one whom I have blessed with belief in Divine Unity will have nothing but Heaven as his reward.\"",
"Hadith": 29
},
{
"Content": "30. Al-Hakim Abd al-Hamid ibn Abd al-Rahman ibn al-Husayn said: Abu Yazid ibn Mahbub alMuzni said: al-Husayn ibn Isa al-Bastami said: Abd al-Samad ibn Abd al-Warith said: Shubah on the authority of Khalid al-Hadhdha' on the authority of Abu Bushr Anbari on the authority of Humran on the authority of Uthman ib Affan said The Messenger of Allah (SA) said: \"He who dies knowing that Allah is the Truth [Haqq] will enter Heaven.\"",
"Hadith": 30
},
{
"Content": "31. Hamzah ibn Muhammad ibn Ahmad ibn Jafar ibn Zayd ibn Ali ibn al-Husayn ibn Ali ibn Abu Talib (AS) said: Ali ibn Ibrahim Ibn Hashim related to me that Ibrahim Ibn Ishaq alNahawandi on the authority of Abd Allah ibn Hammad al-Ansari on the authority of al-Husayn ibn Yahya ibn al-Husayn on the authority of Amr ibn Talhah on the authority of Asbat ibn Abu Nasr on the authority of Ikrimah on the authority of Ibn Abbas related to me that The Messenger of Allah (SA) said: I swear by Him who has sent me with the Truth as a bearer of glad tidings! Allah will never punish those who believe in His Unity. Verily, those who believe in Divine Unity will be granted the right to intercede (on the Day of Judgement), and their intercession will be accepted. After that he (SA) added, On the Day of Judgement, Allah, Blessed and Exalted be He, will order that a group of evil doers from this world be cast into Hell. They will plead to Him, O our Lord! How can You cast us into Hell when we used to accept Your Unity? How can You burn our tongues in the fire when they used to profess Your Unity? How can You burn our hearts in the fire when they believed that There is no god, but You'? How can You burn our faces when we placed our foreheads on the dust in prostration for You? How can You burn our hands when we lifted them up in prayers to You? Allah, Mighty be His Glory, will say, \"O My Servants! You committed evil deeds in the world. Hence, you have earned the punishment of Hell-fire.\" They will then plead, \"O our Lord! Are our mistakes greater than Your forgiveness? Or is Your forgiveness greater than our mistakes?\" Then Allah, the Mighty and High, will reply, \"My Forgiveness, of course.\" They will ask, \"What is greater? Your Mercy or our sins?\" So He, the Mighty and High, will answer, \"My Mercy, of course.\" They will then ask, \"What is greater? Our belief in Your Unity or our sins?\" He, the Mighty and High, will reply, \"Your acceptance of My Unity is greater, of course.\" Then they will say, \"O Our Lord! Then let You Forgiveness and Mercy encompass us as it encompasses everything.\" Hence, Allah, Mighty be His Glory, will say, O My Angels! I swear by My Dignity and Glory! I have not created anyone more beloved to Me that the ones who embrace My Unity professing that here is no god but Me. Since I refuse to cast those who believe in My Unity into Hell, enter Ye, O My Servants, in Heaven!\",
"Hadith": 31
},
{
"Content": "32. Ahmad ibn al-Hasan al-Qittan said: al-Hasan ibn Ali al-Sakkari said: Muhammad ibn Zakariyya al-Jawhari al-Basri said: Jafar ibn Muhammad ibn Umarah on the authority of his father who on the authority of Jafar ibn Muhammad (AS) on the authority of Muhammad ibn Ali (AS) on the authority of his father Ali ibn al-Husayn (AS) on the authority of his father al-Husayn ibn Ali on the authority of his father Ali ibn Abu Talib (AS) Said The Messenger of Allah (SA) said: \"He who dies without associating anything with Allah will enter Heaven, whether he did good or evil.\"",
"Hadith": 32
},
{
"Content": "33. My father (RA) said: Sad ibn Abd Allah said: Ahmad ibn Abu Abd Allah al-Barqi on the authority of his father Muhammad ibn Abu -Umayr on the authority of Hisham ibn Salim and Aby Ayyub said Imam Jafar al-Sadiq (AS) said: \"He who says, there is no god but Allah' one hundred times will be the best of the people in deeds on that day, unless someone says it more often than he does.\"",
"Hadith": 33
},
{
"Content": "34. My father (RA) said: Sad ibn Abd Allah said: Ahmad ibn Hilal on the authority of Ahmad ibn Salih on the authority of Isa ibn Abd Allah who is from the children of Umar ibn Ali, on the authority of his forefathers on the authority of Abu Said al-Khudri said The Messenger of Allah said: Allah Mighty be His Glory said to Musa (AS), \"O Musa! If everything that exists in all the heavens, their inhabitants, and the seven earths, were places in one side of the scale, and there is no god but Allah' was placed in the other side, then there is not god but Allah' would tip the scale.\"",
"Hadith": 34
},
{
"Content": "35. My father (RA) said: Sad ibn Abd Allah on the authority of Ahmad ibn Muhammad ibn Isa on the authority of Abd al-Rahman ibn Abu Najran on the authority of Abd al -Aziz alAbdi on the authority of Umar ibn Yazid that I heard Imam Jafar al-Sadiq (AS) say, In a day, whoever says \"I bear witness that there is no god but Allah, the One and Only, who has no partners; the God [ilah], the One [wahid], the Unique [ahad], on whom all depend, who has not taken a partner nor son,\" Allah, the Mighty and High, will record 45 million goods deeds fro him; He will forgive him 45 million evil deeds; He will raise his position in Heaven by 45 million places; He will give him the blessings of a person who recited the entire Quran twelve times; and Allah will build a house for him in Heaven.",
"Hadith": 35
},
{
"Content": "1. My father (RA) said: Sad ibn Abd Allah said: Ahmad ibn Abu Abd Allah on the authority of his father Muhammad Khalid Barqi; on the authority of Ahmad ibn Nadr and others; on the authority fo Amr ibn Thabit; on the authority of a man who he named on the authority of Abu Ishaq Safii; on the authority of al-Harith al -Awar who said n        >       One day, the Commander of the Faithful Ali ibn Abu Talib (AS) gave a sermon after Asr (afternoon) prayer. The people were astonished by the beautiful words with which he praised Allah, Exalted be His Majesty. Abu Ishaq said: I asked Harith, \"Did you not memorize it?\" He answered, \"I wrote it down.\" So he dictated it to us from his script: All praise belongs to Allah for Who does not die, and Whose wonders shall never come to an end. He exercises His (Universal) Power everyday, creating things that did not exist before; Who does not beget any who could claim to share in His Glory and Might; and Who is not begotten to die so that He could leave an heir behind. He is beyond all imagination; hence, He cannot be regarded as a visible shape. He is too far beyond the reach of sight to leave any mental impression of Him. His Beginning has no beginning, and His End has no end. Time does not outlast Him. Excess and loss cannot affect Him. He cannot be described in terms of when, what and where. He is Hidden among the hidden. He is Manifest in the mind through His Signs, and through His Wisdom in His Creation. When questioned about Him, the prophets did not describe Him in terms of any limit, scope, extent or in terms of constituents. Rather, they described Him in terms of His Functions, and they led people towards Him through His Signs. The minds of the intellectuals do not dare deny His Existence. There can be no denying the Might of the Creator of the heavens and the Earth, and all that is between them. He is totally distinct from His Creation. Nothing resembles Him. He brought His Creation into existence so that He would be obeyed and worshipped. He gave human beings the strength to serve Him, and he rebutted their excuses through the best of arguments. Thus, whoever meets his doom does so knowingly and justifiably. It is through His Grace that redemption is secured by the redeemed, and it is Allah's Grace that prevails in this life and the life to come. Then, Allah to Whom all praise is due, inaugurated the function of this worldly life with His Own Praise, and wound up the function of this worldly life, and the next life, whit His Own Praise. As He Himself says: And judgment shall be given between them with justice, and it shall be said: All praise is due to Allah, the Lord of the worlds. All praise is due to Allah Who, despite having no body, has adorned Himself with the Robes of Greatness and Grandeur, and has covered Himself with the Mantle of Awe and Reverence, without having any corporal form. He occupies the Celestial Throne unceasingly. He is far above His Creation, without being far, and without being in mutual contact with them. Neither has He any limit which may end in any limit, nor is there anything like Him through which He can be recognized. Whoever claims to be holy, except Him, is bound to be humiliated. Whoever magnifies himself is bound to be humbled. All thins bow before His Greatness and are obedient to His Lordship and Might. The function of the eyes becomes tired in searching for Him. The imagination is unable to reach His Attributes. He existed before any beginning, and nothing preceded Him. He is the Last of All, and there is no last for Him at all. With His Might He holds sway over all things. He observes all places without making any movement. No touch can ever touch Him nor can any sense ever sense Him. And He it is Who is Allah in Heavens and Allah in the Earth; and He is the Wise, the knowing.1 Whatever He intended to create He planned for it soundly and correctly without there being any example of it before, and without being tired thereby (in creating whatever He wanted to create). He started whatever He needed to start, and made whatever He wanted to make. He intended to create two weights, the jinn and humankind, so that they should recognize His Lordship on the basis of all these means (of revealed wisdom in His Creation referred to above), and be able to obey Him (consciously). We glorify Allah with all words of praise for the bounties He has bestowed. And we seek guidance from Him in our righteous affairs. Furthermore, we seek refuge from Him against our misdeeds. We solicit His Forgiveness for our past sins. We bear witness that there is no god but Allah, and that Muhammad (SA) in His Servant and Messenger whom Allah raised with truth, who leads to Allah, and who guides towards Him. Thus, He rescued us from misguidance through him, guiding us to the right path, and through him freed us from ignorance. Hence, whoever obeys Allah and His Messenger, he indeed achieves a mighty success,2 and has secured divine blessings in abundance. And whosoever disobeys Allah and His Messenger surely suffers a manifest loss, and deserves a humbling chastisement. Hence, strive to listen, obey counsel with sincerity, and share the burden with others effectively and gracefully. Help yourself by sticking to the right path, and in avoiding wicked deeds. Give to others what is right, and take from others what is right. Cooperate with me (the Imam) by means of these tasks. Seize the idiotic oppressor, tie him, and bind him. Promote the good, and prohibit the evil. Learn to appreciate the worth of illustrious people. May Allah keep us secure and steady on the right path, and keep us constant in abstaining from evil! I beg Allah for our forgiveness!",
"Hadith": 1
},
{
"Content": "2. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (May Allah be pleased with him) said: Muhammad ibn Amr al-Katib, on the authority of Muhammad ibn Ziyad al-Qalzumi, on the authority of Muhammad ibn Abu Ziyad al-Jiddi, the one who lead the prayers at Jiddah, that Muhammad ibn Yahya ibn Umar ibn Ali ibn Abu Talib (AS) related to me that I heard Abu al-Hasan al-Rida (AS) say this about the Unity (of Allah) in the presence of alMamum, Ibn Abu Ziyad said: their freed slave and maternal uncle to some of them, Ahmad ibn Abd Allah al- Alawi also related it to me, on the authority of al-Qasim ibn Ayyub al- Alawi that  G Z G O  >  o  . When al-Mamum wanted to appoint al-Rida (AS) to the Caliphate, he gathered the Hashimites and said: I want to appoint al-Rida as the Caliph after me.\" The Hashimites envied him because of this and said: \"Are you going to hand over political and religious authority to an ignorant man who has no idea of how to run the Caliphate? Have him summoned before us so that you can see his ignorance, and then you can judge what we affirm.\" Therefore, he sent someone to summon him. The Hashimites said to him (AS): \"O Abu al-Hasan! Go up to the pulpit, and give us an example of how we should serve Allah.\" Hence he (AS) climbed up the pulpit, sat down, and lowered his head for some time without saying anything. He (AS) then rose up, stood up straight, praised Allah and extolled Him, and sent blessings on the Prophet and his Household (AS). He (AS) then said: The best of service is to acknowledge the existence of Allah. The foundation of acknowledgement of Allah is to process His unity. Allah's Unity is established through the denial of descriptions, since all intellects bear witness that descriptions are created, and whatever is created requires a Creator, who is neither identifier or identified. Every identifier and identified is connected, and connection is evidence of occurrence. Whatever occurs cannot be eternal. Hence, anyone who describes Allah in anthropomorphic terms has not described Allah's Essence. Furthermore, anyone who describes Allah by means of reason has not described Him. Anyone who equates Him with anything has not described the Reality. Anyone who limits Allah has not recognized Him. Anyone who seeks to point Him out has not approached Him. Anyone who describes Allah in human terms has not described Him. Anyone who divides Allah into parts has not drawn near Him. And anyone who imagines Allah has intended other than Him. Everything which is known is in itself created. Every existence other than Him is caused. The existence of Allah is inferred through His Creation. The existence of Allah is acknowledged by means of the intellect. The existence of Allah is proven through nature. Allah placed the creation as a veil between the Creator and the created. Allah differs from creation by means of His Distinction. He gave a beginning to everything so that everything would know that He ha no beginning, and so that everything would know that those who have a beginning are incapable of giving a beginning to others. He gave movement to everything so that everything would know that He is devoid of movement, because movement is a manifestation of need. His Names are interpretations. His Actions are instructions. His Essence is a fact. The Core of His Essence is a distinction between Him and His Creation. And His Elapses [ghubur] are limitations for all but Him. Verily, whoever describes Allah is ignorant of Him. Anyone who attempts to encompass Him has totally missed Him. And anyone who thinks that He can be grasped in His Entirety has totally mistaken Him. Anyone who asks, \"How is He?\" has compared Him. Anyone who asks, \"Why does He exist?\" implies that He is caused. Anyone who asks, \"How long has He existed?\" has subjected Him to the limits of time. He who asks, \"In what is He?\" implies that He is contained. He who asks, \"What is His Extent?\" has limited Him. He who asks, \"How far does He reach?\" has raised Him, and whoever raises Him, implies that He has a limit. Whoever gives Allah an extent implies that He has parts. Whoever claims that Allah has parts has described Him. Whoever describes Him has disbelieved in Him. Allah is not subject to change like creation is subject to change. In the same way, He is not limited like the limitations of the limited. He is One, but not in the sense of a number. He is Apparent, but not in the sense of pursuit. He is Evident, but not in the sense of sight. He is Hidden, but not in the sense of pursuit. He is Far, but not in the sense of distance. He is Near, but not in the sense of closeness. He is Subtle, but not in the sense that He has a body. He is Existent, but not in the sense that He comes from non-existence. He is a Doer, but not by means of compulsion. He is the Appraiser, but not by means of thought. He is the Controller (of the Universe), buy not by means of movement. He is the One who Wills, but not by means of soliciting. He is the One who Wills, but not in the sense that He is eager. He is the Perceiver, but not by means of touch. He is All-Hearing, but not by means of any instrument. He is All-Seeing, but not by means of any tool. Time cannot be associated with Him. Space does not contain Him. Slumber does not seize Him. Attributes do not limit Him. Tools do not bind Him. His Essence supersedes time. His Existence supersedes non-existence. His Eternity supersedes beginning. By giving senses to other, He proves that He is devoid of sense. By creating substance, He proves that He is not a substance. By giving contrasts, He proves that He has no contrast. By establishing pairs in creation, He proves that He has not partner. Light is the opposite of darkness like certainty is the opposite of uncertainty. Dryness is the opposite of wetness as cold is the opposite of heat. By creating similarity, Allah points out that He is the Creator. By creating difference, Allah points out that He is the Differentiator. As the Might and High has said: And of everything We have created pairs that you may be mindful.1 Therefore, He differentiated between the prior and the subsequent to prove that nothing precedes Him, and that nothing succeeds Him. Everything that has an instinct bears witness that the One who gave them their instinct ha no instinct. Everything that is different bears witness that the One who made the different is devoid of differences. Everything that is subjected to time bears witness the One who subjected them to time is not subject to time. Everything that is veiled bears witness that the only veil which exists between them and the One who veiled them is themselves. Allah was Lord even when there were no subjects. He was the One and Only True God even when no creation existed. He was All-Knowing even when there was nothing to be known. He was the Creator even before the creation existed. He was the All-Hearing even when there was nothing to be heard. He did not earn the title of Creator merely because of creation. He did not earn the title of Creator merely because he gave the created a beginning. And how could it be otherwise when the conjunction since' [mudh] does not make Him obscure? The word may' [qad] does not approach Him. The expression perhaps' [laalla] does not veil Him. The conjunction when' [mata] does not set a time limit for Him. The expression at the time when' [hina] does not comprise Him. The word with' [maa] does not unite Him with anything. Verily, particles bind together, and tools point to things similar to themselves to show their effectiveness. The conjunction since' prevents Him from being without beginning. The word may' prevents Him from being eternal. The conjuction if not' [law la] prevents Him from being Complete; thus indicating division. Difference is manifest through opposition, making its Creator evident to the intellect while being concealed fro sight. When Allah is imagined, other than Him is imagined. Difference points to Him. Through difference, verification is introduced, and through difference, the intellect confirms the belief in Allah Through verification faith is complete. There is no profession of faith without recognition, and no recognition without sincerity. There is no sincerity in anthropomorphism. And there is no negation (of Truth) through the affirmation of anthropomorphism. Hence, whatever is found in creation is not found in the Creator, and whatever is possible in creation is impossible to the Creator. Motion and stillness do not occur in Him. And how can something He executed occur in Him? And how can something He originated return to Him? If this were the case, His Essence would have contrast, His Essential Being would be divided into parts, and He could not be called \"without beginning.\" And since the creator differs from the created, if He is restricted with the word behind' then He will be restricted with the word in front.' If you seek to complete Him, then you imply that He is deficient. How can He be Eternal if it is implied that He has a beginning? How can He give existence if He has been created? If any sign of creation exists in Him that would deny Him. If any sign of creation existed in Him, He would surely be subject to change. However, there is no evidence that He is subject to change. There are no answers to questions about Him. No reverence for Him can be found in meaning. There was no injustice in manifesting Himself to creation. The Eternal cannot be divided into \"two\" and the One without a Beginning cannot have a beginning. There is no god but Allah, the Greatest, and the Most High. Whoever gives partner to Allah is a liar, who is lead far astray, and who is in manifest loss. May Allah bless the Prophet Muhammad and His Noble and Pure Progeny!",
"Hadith": 1
},
{
"Content": "3. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (may Allah have mercy on him) said: Muhammad ibn Abu Abd Allah al-Naysaburi said; and (also) Ahmad ibn Yahya ibn Zakariyya al-Qittan, on the authority of Bakr ibn Abd Allah ibn Habib, on the authority of Tamim ibn Buhlul, on the authority of his father, on the authority of Abu Muawiyah, on the authority of al-Hasan ibn Abd al-Rahman, on the authority of his father, on the authority of Abu Abd Allah (AS) on the authority of his father, on the authority of his grandfather (AS) that The Commander of the Faithful (AS) roused the people to was with Muawiyah for the second time. When the people gathered around him, he stood up and addressed them in the following terms: All praise be to Allah, the One and Only who is sought by all, the Unique and the One Who was not created out of anything nor created anything out of pre-existing matter. On the contrary, He created everything through His Might which is manifest in all things. And verily, everything came into existence because of Him. He has no attribute which can be comprehended, nor has He any limit which can be established. In linguistic embellishment, the tongue is crippled when it comes to describing His Attributes. And circumlocution with respect to His Attributes leads to a blind alley. The sharpest of intellects are unable to comprehend His Kingdom. All comprehensive explanation is rendered ineffective in delving deep into His Kingdom. Unseen veils impede even the lowest level of understanding of His Hidden Knowledge. The keenest insights are at a loss when attempting to comprehend the most superficial layer of His Subtleties. Thus, hallowed be Allah who can neither be reached by the most intrepid intellect nor conceived by the deepest insight. Exalted be He who is not subject to time, length, or limit. Purified be He whose Beginning has not beginning, whose End has no end, and who will never be annihilated. Glorified be He! He is as He has described Himself, and the describers cannot reach His Descriptions. He delineated the boundaries of all things at the time of their creation, and completely eradicated the possibility of Him resembling things or of things resembling Him. He cannot be contained by things which could describe Him. He has never been separate from things that can describe Him. He has never bin distant from things which could raise questions as to His whereabouts. Rather, He, the Glorified, has encompassed all the things through His Knowledge, strengthened them, and enumerated them in His Memory. Nothing is hidden from Him behind the veils of the atmosphere, the deep slumber which occurs in darkness, and whatever exists in the highest Heavens, and the lowest Earth. Everything that exists has a custodian and a keeper. All things are surrounded by other things. And He encompasses them all. He is the One, the Unique, and the Besought. He is not subject to time. He does not tire from creating thins. Whatever He willed, He said: \"Be\" and it was. He created everything without precedent, without fatigue, and without planning. Anything which makes something makes it out of something. Allah, however, made His Creation out of nothing. Every scholar acquired knowledge after being ignorant while Allah was never ignorant, and never acquired knowledge. He encompassed all things through His Knowledge even before they were created. Hence, His Knowledge did not increase through their creation. After they came into existence, He knew as much about them as He knew before they came into existence. He never created anything to strengthen His Control. He never created anything out of fear of decay or loss. He never created anything to oppose an adversary. He never created anything to match an equal. He never created anything to become the equal of a dominating partner. He never did anything of the like because all of creation is nurtured by Him, and all things that exist are His Humble Slaves and Servants. Glorified be He who never feels weary from creating, and sustaining. And glorified be He who was not prevented from creating more out of inability or laziness. He knew what He created, and created what He knew. Whatever He created was not the result of deliberation or based on new knowledge. Nor does any doubt arise in Him regarding the things He has not created. What He created, and what He did not create, was the result of His Inviolable Decision. His Firm Knowledge, and His Exact Command. He made Himself Unique in His Lordship, and Specific in (His) Oneness. He earmarked glory and praise for Himself, made Himself Peerless in Unity, Grandeur and Sublimity. He remains Matchless in Praise, and Exalted in His Glory. He is far above parenthood. And he is purified and sanctified against the feminine touch (i.e. sexual relations). He is far too Great and too Mighty to seek the proximity of any participant. Thus, nothing He has created can oppose Him. There is no equal to Him in His Possessions, and there is no partner for Him in His Kingdom. He is the One, the Unique, and the Besought of all. He is the Eternal, the Everlasting, and the Lord of Space. He has always been, and always will be. He is Unique in Eternity. He existed before time and will exist after the end of all affairs. He will never come to an end nor be exhausted. This is how I describe my Lord. Thus, there is no god but Allah. He is the Greatest of the Great. Glorified and Exalted be He. He is the Mightiest of the Mighty. He is far, far, above what the unjust claim about Him. And Ahmad ibn Muhammad ibn al-Saqar al-Saigh also said this sermon that Muhammad ibn al-Abbas ibn Bassam said: Abu Zayd Said ibn Muhammad al-Basri related to me that Umrah bint Aws related to me that My grandfather al-Husayn ibn Abd al-Rahman related to me on the authority of his father, on the authority of Abu Ad Allah Ja''far ibn Muhammad (AS), on the authority of his father on the authority of his grandfather (AS) that the Commander of the Faithful (AS) addressed this sermon when he roused the people to the war with Muawiyah for the second time.",
"Hadith": 3
},
{
"Content": "4. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (may Allah be pleased with him) said: Muhammad ibn al-Hasan al-Saffar; and Sad ibn Abd Allah all said on the authority of Ahmad ibn Muhammad ibn Isa; and al-Haytham ibn Abu Masruq al-Nahdi; and Muhammad ibn al-Husayn ibn Abu al-Khattab all of whom on the authority of al-Hasan ibn Mahbub; on the authority of Umar ibn Abu al-Miqdam; on the authority of Ishaq ibn Ghalib; on the authority of Abu Abd Allah (AS); on the authority of his father (AS) that  n The Messenger of Allah (SA) said in some of his sermons: All praise is due to the Allah Who is Unique in His Beginning, and is Greatest in Divinity in His Eternity. He is the Great Absolute with Grandeur and Might. He innovated what He instigated. And He originated what He created without example prior to creating anything. The One without a Beginning raised us through the benevolence of His Lordship. With His knowledge He rendered. Due to the judgment of His Omnipotence He created all of creation. With the light of morning He made the dawn. Therefore, there is no substitute for His Creation, and none can modify what He makes. There is no hastening his Judgement, and no resting from His Call. There is no decline to His Realm, not an interruption to His Time. He is the First Existence, and is Forever Permanent. He is covered by His light, not by His Creation, in the high-aspiring horizon, the lofty might, and the high realm. He is far from everything, yet He is close to everything. Hence, He is Evident to His creation without being seen. He is the Highest Prospect. He liked to be qualified with Oneness so He covered Himself with His own Light. He is Distinctive in His Sublimity, and is Hidden from His Creation. He sent Messengers to His Creation as His Decisive Argument and Witnesses over them. Between the Messengers, He sent Prophets to His Creation, to give glad tidings (to the believers) who would be granted eternal life after having received the Evidence from Allah. He also sent Prophets to His Creation as warners of impeding doom to those who would be destroyed after having received the Evidence (from Allah). He did all of this so that servants may know their Lord. As a result, they recognized His Lordship after having denied it. They professed the Unity of His Divinity as a result of Diving Guidance.",
"Hadith": 4
},
{
"Content": "5. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (may Allah be pleased with him) said: Muhammad ibn Yahya al-Attar, and Ahmad ibn Idris both said: Muhammad ibn Ahmad ibn Yahya said on the authority of some our scholars hurrying the transmission that A man came to al-Hasan ibn Ali (AS) and said to him: \"O son of the Messenger of Allah! Describe your Lord to me so that I can understand Him better.\" Therefore, al-Hasan ibn Ali (AS) bowed his head in silence for quite a while, before lifting it up and saying: All praise is for Allah, who has no beginning, nor end. He neither has a face through which He may be perceived, nor a back that He may be restricted. He cannot be limited with (the word) till what,' nor with an appearance so that He may have parts. He cannot be described with variation so that He may have an extent. He can neither be perceived by intellects and imaginations, nor by thoughts and concepts. Reason and intellect cannot describe Him by means of the questions: when,' from what did He begin,' on what' does He reveal or in what' does He conceal? We cannot say why not' as He does not shun (His Creation). He created the creations; therefore, He was Original and unprecedented. He originated what He unprecedented and unprecedented what He originated. He did what He intended, and intended what He extended. Such is Allah, the Lord of the Worlds.",
"Hadith": 5
},
{
"Content": "6. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (may Allah be pleased with him) said: Muhammad ibn al-Hasan al-Saffar said on the authority of Ubbad ibn Sulayman, on the authority of Sad ibn Sad that I asked Abu al-Hasan (Ali) al-Rida (AS) about Divine Unity. He responded: \"It is what you already follow.\"",
"Hadith": 6
},
{
"Content": "7. My Father (may Allah have mercy on him) that Sad ibn Abd Allah said on the authority of Ibrahim ibn Hashim; ad Yaqub ibn Yazid both of them on the authority of Ibn Fuddal, on the authority of Ibn Bukayr, on the authority of Zurarah that Abu Abd Allah al-Sadiq (AS) was asked to interpret the Word of the Mighty and High: And to Him submits whoever is in heavens and the Earth, willingly or unwillingly.1 He said: \"They are bound to the belief in the Unity of Allah, the Mighty and High.\"",
"Hadith": 7
},
{
"Content": "8. My father (may Allah have mercy on him) that Sad ibn Abd Allah said: Muhammad ibn alHusayn said on the authority of Muhammad ibn Sinan, on the authority of Ishaq ibn alHarith, on the authority of Abu Basir that Abu Abd Allah al-Sadiq (AS) took out a small box and took out from it a piece of paper, which had the following written on it: Praise be to the One! There is no god but He. He is the Eternal, and the Originator without beginning. He is the Eternal, who does not tire. He is the Living, who does not die. He is the Creator of the seen and the unseen. He is the Knower of Everything without being taught. Such is Allah who has no associate.",
"Hadith": 8
},
{
"Content": "9. Muhammad ibn al-Qasim the Commentator (may Allah have mercy on him) said: Yusuf ibn Muhammad ibn Ziyad, and Ali ibn Muhammad ibn Sayyar said on the authority of their fathers, on the authority of al-Hasan ibn Ali ibn Muhammad ibn Ali al-Rida (AS), on the authority of his father (AS), on the authority of his grandfather AS) that   m   > A man stood up in the presence of (Ali) al-Rida (AS) and said to him: \"O son of the Messenger of Allah! Describe your Lord for us as there are some people who differ with us.\" Hence, al-Rida (AS) said: Verily, he who describes his Lord by analogy is still ambiguous in the world. He is straying from the straight path. He is transient in the deviation (from that which is right). He is lead astray from the way. And he says things that are not proper. I am describing Him the way He described Himself, without relying on images. It is possible to describe Him without recurring to anthropomorphism. He is Close in His Farness, and is without an equivalent. He cannot be compared to His Creation. He does not oppress anyone in His Judgment. The creation is critical of what they know. And they pursue what He has embedded in His Book. He is Aware of everything they do. They do not intend anyone but Him. He is Near, but He is not attached. He is Far, but not cut off. He is Ascertained, ut is not exemplified. He is United, and not divided into parts. He is Known by His Signs, and is proved by His Symbols. Hence, there is no god but He, the Great, and the Most High.",
"Hadith": 9
},
{
"Content": "10. He (AS) then said: He spoke another word after this: My father related to me on the authority of father, on the authority of his grandfather, on the authority of his father (AS) that The messenger of Allah (SA) said: \"Anyone who attributes Him with the shortcomings of His Servants had done Him an injustice. The Compiler of this book says: The tradition is long. We have taken from it the required passage. I have transmitted al of it in the commentary of the Quran.",
"Hadith": 10
},
{
"Content": "1. My father (RA) said: Muhammad ibn Yahya al-Attar said on the authority of Ahmad ibn Muhammad ibn Isa, on the authority of Abu Hashim al-Jafar that I asked Abu Jafar Muhammad ibn Ali the Second (AS), \"What is the meaning of the One [al-Wahid]?\" He replied, \"He is the One whose Divine Unity [al-Wahdaniyyah] is professed by all tongues.\"",
"Hadith": 1
},
{
"Content": "2. Muhammad ibn Muhammad ibn Isam al-Kulayni; and Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) both said: Muhammad ibn Yaqub al-Kulayni, on the authority of Ali ibn Muhammad said; and Muhammad ibn al-Hasan all of whom on the authority of Sahl ibn Ziyad, on the authority of Abu Hashim al-Jafari that I asked Abu Jafar the Second (AS), \"What is the meaning of the One?\" He answered, \"He is the One whose Divine Unity [al-Tawhid] is profess by all. As Allah, the Mighty and High, says: And if you as them, Who created the Heavens and the Earth, they will certainly say, Allah.1",
"Hadith": 2
},
{
"Content": "3. Muhammad ibn Ibrahim ibn Ishaq al-Taliqani (RA) said: Muhammad ibn Said ibn Yahya al-Buzuri said: Ibrahim ibn al-Haytham al-Baladi said: My father said on the authority of alMuafi ibn Imran, on the authority of Israil, on the authority of al-Miqdad ibn Shurayh ibn Hani', on the authority of his father that On the Day of Battle of Jamal, a Bedouin stood before the Commander of the Faithful (AS), and asked, \"O Commander of the Faithful! Do you say that Allah is One?\" He says: the people attacked him saying that \"O Bedouin! Do you not see the state of mind of the Commander of the Faithful?\" So the Commander of the Faithful (AS) said: \"Leave him alone. Verily, what this Bedouin seeks to know is what we are seeking to establish by fighting these people.\" He (the Commander of the Faithful) then said: O Bedouin! The statement that Allah is One' is of four types: Two types cannot be applied to Allah, the Mighty and High; while the two other types can be applied to Him. As for the two types of statements that cannot be applied to Him, the first is the claim that Allah is One in a numerical sense. Such a statement cannot be applied to Allah, because as the One, He has no second, and He is not subject to mathematic calculation. Do you not see that he who claims that Allah is the third of the three has disbelieved (in Him)? The second statement which cannot be applied to Allah is the claim that He is One with humankind. Since He derives the species from the genus, He cannot be described through anthropomorphism [tashbih]. Our Lord is Higher and more Exalted than this. As for the two types of statements that can be applied to Allah, the first would be to say that He is the One who resembles none. The second statement which can apply to Allah is the statement that He, the Mighty and High, is Alone, in the sense that He is Indivisible in Existence [wujud], Intellect [aql], and Thought [wahm]. That is another dignified description of our Lord, he Mighty and High.",
"Hadith": 3
},
{
"Content": "1. Hamzah ibn Muhammad al-Alawi (RA) said: Ali ibn Ibrahim ibn Hashim, on the authority of Muhammad ibn Isa, on the authority of Yunus ibn Abd al-Rahman, on Muhammad ibn Hukaym reported that I described the statement of Hisham al-Jawaliqi, and what he says about a fortunate young man, and described to him the word of Hisham ibn al-Hakam. He (AS):\" Verily, nothing resembles Allah, the Mighty and High.\"",
"Hadith": 1
},
{
"Content": "2. ~Ali ibn ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Yaqub said: Ali ibn Muhammad, who eliminated the source of report, on the authority of Muhammad ibn al-Faraj al-Rukhkhaji that I wrote to Abu al-Hasan al-Kazim (AS) asking hm about what Hisham ibn al-Hakam said about the body of Allah, and what Hisham ibn Salim had said about the image of Allah. So he (AS) replied to me: \"Leave the confusion of the baffled, and take refuge in Allah from Satan. Things are not as the two Hishams claim.\"",
"Hadith": 2
},
{
"Content": "3. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan alSaffar, on the authority of Sahl ibn Ziyad, on the authority of Hamzah ibn Muhammad that I wrote to Abu al-Hasan al-Kazim (AS) asking him about the substance and the shape of Allah; therefore, he (AS) wrote to me: \"Glory to the One who has none like Him, ad who is devoid of both body and image.\"",
"Hadith": 3
},
{
"Content": "4. My father (RA) that Ahmad ibn Idris said: Muhammad ibn Abd al-Jabbar, on the authority of Safwan ibn Yahya, on the authority of Ali ibn Abu Hamzah that  U         m    I said to Abu Abd Allah al-Sadiq (AS): I heard Hisham ibn al-Hakam narrating from you that Allah, the Mighty and High, has a Needless body of Light; His Recognition is necessary, and He grants it to whoever He desires from His Creation. He (AS) said: Glory to Him who is known only to Himself! There is none like Him, and He is the All-Hearing and the Al-Seeing. He cannot be confined, sensed, touched, or felt. The senses perceive Him not, and nothing can comprehend Him. He does not have a body or an image, nor lineation or delineation.",
"Hadith": 4
},
{
"Content": "5. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan alSaffar, on the authority of Sahl ibn Ziyad, on the authority of Muhammad ibn Ismail ibn Bazi, on the authority of Muhammad ibn Zayd that I came to (Ali) al-Rida (AS) asking him about Divine Unity, so he (AS) dictated to me: All praise be to Allah, the Originator, Producer, and Innovator [Mubtadi] of all things from the beginning by His Power and Wisdom, not from anything that could invalidate His Invention, nor for nay wrong cause. He created whatever He wanted how He wanted, and He did so independently in order to manifest His Wisdom, and the Reality of His Lordship. Intellects cannot grasp Him. Imagination cannot reach Him. Eyes cannot perceive Him, and scale cannot encompass Him. Speech is incapable without Him. Eyes are expressionless without Him, and rhetoric of description goes astray in Him. He is hidden without a veil and is covered without a covering. He is recognized without seeing. He is described without an image. And He is praised despite the face that He does not possess a body. There is no god but Allah, the great, the Most Exalted.\"",
"Hadith": 5
},
{
"Content": "6. Ali ibn Ahmad ibn Abd Allah ibn Ahmad ibn Abu Abd Allah al-Barqi said, on the authority of his father, on the authority of his grandfather Ahmad ibn Abu Abd Allah, on the authority of Ahmad ibn Muhammad ibn Abu Nasr, on the authority of Muhammad ibn Hukaym that I described the statement of Hisham al-Jawaliqi, and narrated for Musa al-Kazim (AS) the statement of Hisham ibn al-Hakam that He possesses a body. Hence, he (AS) said: \"Verily, nothing resembles Allah. Indecent language is better than words which give the Creator a created body or image composed of parts. Exalted from these, the High, the Great.\"",
"Hadith": 6
},
{
"Content": "7. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (may Allah be pleased with them) said: Muhammad ibn Abu Abd Allah al-Kufi said: Muhammad ibn Ismail al-Barmaki said: on the authority of al-Husan ibn al-Hasan, and al-Husayn ibn Ali, on the authority of Salih ibn Abu Hammad, on the authority of Bakr ibn Salih, on the authority of Muhammad ibn al-Husayn ibn Said, on the authority of Abd Allah in al-Mughayrah, on the authority of Muhammad ibn Ziyad said: I heard Yunus ibn Zabyan say      m   I entered in the presence of Abu Abd Allah al-Sadiq (AS) and told him: Hisham ibn al-Hakam made a long statement. I will simply summarize it: He considers Allah to be a body because things are of two types: bodies or actions of bodies. Hence, if it is not possible for the creator to be an action, it is only possible that He be a Doer. Then Abu Abd Allah (AS) replied: \"Woe to him! Does he not know that a body is extremely limited, and an image is absolutely limited? Hence, if a limit is possible then increase and decrease are possible, and if increase and decrease are possible, then He is created. I asked: \"Then what should I say? He answered: He has neither body nor image for He is the creator of bodies and images. He is devoid of parts and limits. He does not increase, nor does He decrease. If He were as he (Hisham) says then there would be no difference between the Creator and the created, or between the Inventor and the invented. However, He is the Inventor. The Creator of Bodies and Images does not resemble anything nor does anything resemble Him.\"",
"Hadith": 7
},
{
"Content": "8. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (may Allah be pleased with him) said: Muhammad ibn Abu Abd Allah al-Kufi said: on the authority of Muhammad ibn Ismail alBarmaki, on the authority of al-Hasan ibn Abd al-Rahman al-Hammani that  3 I said to Abu al-Hasan Musa ibn Jafar (AS): Hisham ibn al-Hakam thinks that Allah is a body. There is nothing whatsoever like unto Him, the All-knowing, the All-Hearing, the All-Seeing, the Omnipotent, the Speaker, and the Communicator. Speech, Omnipotence, and Knowledge flow from the One Same Source, None of these things are created. So he (AS) said: May Allah kill him! Does he not know that a body is limited, and that speech is other than the speaker? Allah forbid, I am free from such words. He is devoid of both body and image. He has not limits, and everything other than Him is created. Verily, everything that exists is the result of His Will and Intent which is expressed without words, the use of the tongue, or any reluctance or hesitation.",
"Hadith": 8
},
{
"Content": "9. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (may Allah have mercy on him) said: on the authority of Muhammad ibn Yaqub al-Kulayni, on the authority of Ali ibn Muhammad, on the authority of Sahl ibn Ziyad, on the authority of Ibrahim ibn Muhammad al-Hamdani that I wrote to Abu al-Hasan al-Naqi (AS), informing him that some of his following have differences on the subject of Divine Unity. Some of them say that He has a body, while others say that He has an image. So He (AS) wrote to me the following in his own handwriting: \"Glory be to Him who has no limit and who cannot be described! There is nothing whatsoever like unto Him. And He is the All-Hearing, the All-Knowing.\" He (AS) may have said: \"the All-Seeing.\"",
"Hadith": 9
},
{
"Content": "10. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (may Allah be pleased with him) said: Muhammad ibn Yahya al-Attar said: Muhammad ibn Ahmad said: Muhammad ibn Isa said, on the authority of Hisham ibn Ibrahim who said: al-Abbasi said I said to him (AS), meaning Abu alhasan al-Rida (AS): \"May I be your ransom! One of your followers told me to ask you a question about something.\" He (AS) said: \"And who would that be?\" I said: \"Al-Hasan ibn Sahl.\" He (AS) asked: \"What is the issue about?' I replied: \"It is about Divine Unity.\" He (AS) said: \"What about Divine Unity?\" I said: \"He wants to know whether Allah possesses a body or not?\" He (AS) answered me: There are three positions regarding Divine Unity. The first group attempts to describe Him through anthropomorphism. The second group attempts to describe Him through negation. And the third group attempts to describe Him without falling into anthropomorphism. Describing Him through anthropomorphism is not allowed, and describing Him through negation is not allowed. The correct position is attempting to describe him without falling into anthropomorphism.",
"Hadith": 10
},
{
"Content": "11. Muhammad ibn Ali Majilwayh (may Allah have mercy on him) said: Muhammad ibn Yahya al-Attar said: Muhammad ibn Ahmad said: on the authority of Imran ibn Musa, on the authority of al-Hasan ibn al-Abba ibn Huraysh al-Razi, on the authority of some of our scholars that The purified [Tayyib], Ali ibn Muhammad, and Abu Jafar al-Jawad (AS) both said: \"He who claims that Allah has a body, do not give him the poor-rate, and do not pray behind him.\"",
"Hadith": 11
},
{
"Content": "12. Muhammad ibn Musa ibn al-Mutawakkil (may Allah have mercy on him) said: Muhammad ibn Yahya al-Attar said: on the authority of Sahl ibn Ziyad, on the authority of Muhammad ibn Ali al-Qasani who said I wrote to him (AS) informing him that some of the people here differed on the subject of Divine Unity. He (AS) replied in writing: \"Glory be to Him who has no limit, and who cannot be described! Nothing whatsoever is like unto Him. And he is the All-Hearing, and the All-Seeing.\"",
"Hadith": 12
},
{
"Content": "13. Al-Husayn ibn Ahmad ibn Idris (may Allah have mercy on him) said, on the authority of his father, on the authority of Abu Said al-Adami, on the authority of Bishr ibn Bashshar alNaysaburi that: I wrote to Abu al-Hasan al-Naqi (AS) informing him that the people differed on the subject of Divine Unity. Some of them say \"He has a body\" while others say that \"He has an image.\" So, he (AS) wrote (back): \"Glory be to Him who has no limit, who cannot be described, and with whom nothing resembles! Nothing whatsoever is like unto Him. And He is the All-Hearing and the All-Seeing.\"",
"Hadith": 13
},
{
"Content": "14. Ahmad ibn Muhammad ibn Muhammad ibn Yahya al-Attar (may Allah have mercy on him) said: on the authority of his father, on the authority of Sahl ibn Ziyad that I wrote the following to Abu Muhammad al-Askari (AS) in the year 255 AH: O my Master! Our scholars are divided on the question of Divine Unity. Some of them say that \"He has a body,\" while others say that \"He has an image.\" O my Master! If you deem it appropriates, teach me the correct view since I do not know the answer, and be gracious to your servant. Hence, he (AS) wrote to me the following in his own handwriting: You enquired about Divine Unity. This is far from your honorable reach. Allah, the Exalted, is One, Alone, and Needless. He begets not, nor is He begotten, and none is equal unto Him. He is the Creator, and not the created. He, the Blessed and exalted, creates bodies as He wishes. He creates images as He wishes, but He is not an image. Exalted be His Praise, and Hallowed be His names. He is far above having a resemblance. There is no other than Him. Nothing whatsoever is like unto Him, and He is the All-Hearing and the All-Seeing.",
"Hadith": 14
},
{
"Content": "15. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (may Allah have mercy on him) said: Muhammad ibn al-Hasan al-Saffar said: al-Abbas ibn Maruf said, on the authority of Hammad ibn Uthman, on the authority of Abd al-Rahim al-Qasir that I wrote a letter, and sent it by hand via Abd Al-Malik ibn Ayan to Abu Abd Allah al-Sadiq (AS). In it, I asked about several issues, one of which was: \"Please inform me about Allah, the Mighty and High. Can He be described with image and lineation? If this letter reaches you, may Allah make me your ransom, write back to me with the correct vies about Divine Unity.\" So he (AS) wrote back to me, sending the letter via Abd al-Malik ibn Ayan: May Allah have mercy on you! You have enquired about Divine Unity. Allah is Greater than what your companions have ascribed. He is All-Hearing and All-Seeing, and there is nothing like unto Him. Allah is greater than the descriptions of the describers, those who describe Him inhuman terms, and those who compare Him with His creation, thus slandering Allah. Beware! May Allah have mercy on you! The correct view about Divine Unity is to be found in the attributes that Allah, the Mighty and High, revealed in the Quran. Reject anthropomorphism, and do not apply to Allah what is vain. Allah is Firmly Present. Allah is high above the descriptions of the describers. Do not exceed the Quran, as you will misled after the clear explanation has reached you.",
"Hadith": 15
},
{
"Content": "16. Ahmad ibn Muhammad ibn Yahya al-Attar (may Allah have mercy on him) said, on the authority of his father, on the authority of Sahl ibn Ziyad, on the authority of some of our scholars that I wrote to Abu al-Hasan al-Kazim (AS) asking him about the body and image of Allah, so he replied in writing: \"Glory be to Him who has nothing whatsoever like unto Him, and who is devoid of both body and image.\"",
"Hadith": 16
},
{
"Content": "17. Ahmad ibn Muhammad ibn Yahya al-Attar (may Allah be pleased with him) said, on the authority of his father, on the authority of Sahl ibn Ziyad al-Adami, on the authority of Hamzah ibn Muhammad that I wrote to Abu al-Hasan al-Kazim (AS) asking him whether Allah had a body or an image. Hence he (AS) wrote in reply: \"Glory be to Him who has nothing whatsoever like unto Him,\"",
"Hadith": 17
},
{
"Content": "18. Ali ibn Ahmad ibn Abd Allah ibn Ahmad ibn Abu Abd Allah al-Barqi (may Allah have mercy on him) said, on the authority of his father, on the authority of his grandfather Ahmad ibn Abu Abd Allah, on the authority of his father, on the authority of Abd Allah ibn Bahr, on the authority of Abu Ayyub al-Khazzaz, on the authority of Muhammad ibn Muslim that I asked Abu Jafar al-Baqir (AS) about the claim that Allah, the Mighty and High, created Adam (AS) in His Image; hence, he said: That was a recently created image. Allah favored it, and chose it over all different images. Then He attributed it to Himself like He attributed the Kabah and the Sprit to Himself. Thus, He said: My House.1 And said: And when I breathed into him My Spirit.2",
"Hadith": 18
},
{
"Content": "19. Muhammad ibn Musa ibn al-Mutawakkil (may Allah have mercy on him) said: Abd Allah ibn Jafar al-Himyari said, on the authority of Ahmad ibn Muhammad ibn Isa, on the authority alI Hasan ibn Mahbub, on the authority of Yaqub al-Sarraj that I said to Abu Abd Allah al-Sadiq (AS): \"Some of our scholars think that Allah looks like a human being, while others think that he is beardless and has curly hair.\" Abu Abd Allah (AS) fell down in prostration, then raised his head, and said: Glory be to Allah who has nothing whatsoever like unto Him! Vision cannot perceive Him, and knowledge cannot encompass Him. He begets not, because the son resembles his father, not is He begotten, so that He could resemble the one before Him. And none is like Him. Exalted is He, the High, and Mighty from such attributions!",
"Hadith": 19
},
{
"Content": "20. Muhammad ibn Musa ibn al-Mutawakkil (may Allah have mercy on him) said: Ali ibn Ibrahim ibn Hashim said, on the authority of his father, on the authority of al-Saqr ibn [Abu] Dulaf that I asked Abu al-Hasan Ali ibn Muhammad ibn Ali ibn Musa al-Rida (AS) about Divine Unity: \"Verily, I say what Hisham ibn al-Hasam said.\" So he (AS) became angry and said: What is the matter with you and Hisham? Indeed, he is not from us who thinks that Allah, the Mighty and High, has a body. We are free from such a person in this world, and in the Hereafter. O son of [Abu] Dulaf! Verily, the body is created and Allah is its Creator. The Compiler of this book says: Allah willing, I will mention the proof that bodies are created in the chapter of this book titled \"The Proof of the Creation of the World.\"1",
"Hadith": 20
},
{
"Content": "1. My father (RA) that Sad ibn Abd Allah al-Ashari said: Ahmad ibn Muhammad ibn Khalid, on the authority of Muhammad ibn Isa, on the authority of one he mentioned, said Abu Jafar al-Baqir (AS) was asked: \"Is it permissible to say that Allah, the Might and High, is a Thing?\" He (AS) replied: \"Yes, to the extent that it removes Him from both extremes: annulment [tatil], and anthropomorphism [tashbih].\"",
"Hadith": 1
},
{
"Content": "2. My father (RA) that Ali ibn Ibrahim, on the authority of his father, on the authority of alAbbas ibn Amr, on the authority of Hisham ibn al-Hakam that > An atheist asked Abu Abd Allah al-Sadiq (AS) \"What is He?\" He (AS) replied: He is a Thing unlike other things. If you consider the meaning of the word \"thing.\" He is indeed a Thing by definition [al-shay'iyyah], with the exception that He has neither substance nor shape\"",
"Hadith": 2
},
{
"Content": "3. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan alSaffar, on the authority of Ahmad ibn Muhammad ibn Khalid, on the authority of al-Nadr ibn Suwayd, on the authority of Yahya al-Halabi, on the authority of Ibn Muskan, on the authority of Zurarah that I heard Abu Abd Allah al-Sadiq (RA) say: \"Verily, Allah, the Blessed and Exalted, is free from His Creation, and His Creation is free from Him. Whatever can be defined by the word thing' is a creation other than Almighty Allah. Exalted is He who is beyond compare.\"",
"Hadith": 3
},
{
"Content": "4. Hamzah ibn Muhammad al-Alawi (RA) said: Ali ibn Ibrahim on the authority of his father, on the authority of Ibn Abu Umayr, on the authority of Ali ibn Atiyyah, on the authority of Khaythamah that Abu Jafar al-Basir (AS) said: Verily, Allah, Blessed and Exalted be He, is free from His Creation, and His Creation is free from Him. Whatever can be defined by the word \"thing\" is a creation other than Allah, the Mighty and High. Allah, the Exalted, is the Creator of all things.",
"Hadith": 4
},
{
"Content": "5. Muhammad ibn Ali Majilwayh (RA) said: Ali ibn Ibrahim ibn Hashim, on the authority of Muhammad ibn Isa, on the authority of Yunus ibn Abd al-Rahman, on the authority of Abu alMaghra, who eliminated the source of report from Abu Jafar, and said: Al-Baqir (AS) said: \"Verily, Allah, Blessed and Exalted be He, is free from His Creation, and His Creation is free from Him. Whatever can be defined by the word \"thing\" is a creation other than Allah, the Mighty and High.\"",
"Hadith": 5
},
{
"Content": "6. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan alSaffar, on the authority of Muhammad ibn Isa ibn Ubayd, on the authority of Abd al-Rahman ibn Abu Najran that I asked Abu Jafar the Second (AS) about Divine Unity [Tawhid], so I said: \"Is He presumed to be a thing?\" Consequently, he (AS) replied: Yes. However, since He is Incomprehensible, and Unlimited, He is unlike anything you can conceive. Nothing resembles Him. Imagination perceives Him not. And how could imagination perceive Him when He is beyond all imagination? He is an Imagined Thing which is Incomprehensible and Unlimited.",
"Hadith": 6
},
{
"Content": "7. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Abu Abd Allah al-Kufi said: Muhammad ibn Ismail al-Barmaki said: on the authority of al-Husayn ibn al-Hasan, on the authority of Bakr ibn Salih, on the authority of al-Husayn ibn Said that Abu Jafar the Second (Imam Muhammad al-Taqi (AS) was asked: \"Is it permissible to say that Allah is a Thing?\" Hence, he (AS) answered: \"Yes, to the extent that it removes Him from the two extremes: annulment [tatil] and anthropomorphism [tashbih].\"",
"Hadith": 7
},
{
"Content": "8. Jafar ibn Muhammad ibn Masrur (RA) said: Muhammad ibn Jafar ibn Buttah said: some of our scholars, on the authority of Muhammad ibn Isa related to me that Abu al-Hasan al-Rida (AS) said to me: \"What would you say if you were asked: Tell us, is Allah, the Mighty and High, a Thing or is He not a thing?\" He said: I said to him (AS): Allah, the Mighty and High, has acknowledged that He is a Thing when he said: Say: What thing is the weightiest in testimony? Say: Allah is a witness between you and me.1 I would say: He is a Thing unlike other things, as negating that He is a Thing would negate Him and deny Him. He (AS) said to me: \"You are correct and you are right.\" (Ali) al-Rida (AS) then said to me: People have three beliefs regarding Divine Unity [al-Tawhid]: negation, anthropomorphism, and description without anthropomorphism. Negation, however, is not permissible nor is anthropomorphism, because nothing resembles Allah, Blessed and Exalted be He. The correct position is the third one, description without anthropomorphism.",
"Hadith": 8
},
{
"Content": "1. Muhammad ibn Musa ibn al-Mutawakkil (may Allah have mercy on him) said: Ali ibn Ibrahim ibn Hashim said on the authority of his father, on the authority of al-Nawfali, on the authority of al-Sakuni, on the authority of Abu Abd Allah, on the authority of his forefathers (AS) that The Prophet (SA) passed by a man who was supplication with his eyes raised to the sky. The Messenger of Allah (SA) said to him: \"Cast down your eyes for you will certainly not see Him.\" He (SA) also said that: \"The Prophet (SA) passed by a man who was supplicating with his hands raised to the sky. The Messenger of Allah (SA) said to him: Lower your hand for your will surely not reach Him.'",
"Hadith": 1
},
{
"Content": "2. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (may Allah have mercy on him) said: Muhammad ibn Abu Abd Allah al-Kufi said on the authority of Ali ibn Abu al-Qasim, on the authority of Yaqub ibn Ishaq that I wrote to Abu Muhammad al-Askari (AS) asking him how a servant could serve a Lord he cannot see? Hence, he (AS) replied in writing: \"O Abu Yusuf! My Master, my Lord, and the Benefactor upon me any my forefathers, is far above being seen.\" He said: \"I also asked whether the Messenger of Allah (SA) saw him Lord?\" He wrote back: \"Verily, Allah, the Blessed and Exalted, manifested to the Messenger what He desired from the Light of His Magnitude.\"",
"Hadith": 2
},
{
"Content": "3. Al-Husayn ibn Ahmad ibn Idris (RA) said on the authority of his father, on the authority of Muhammad ibn Abd al-Jabbar, on the authority of Safwan ibn Yahya, on the authority of Asim ibn Humayd that I consulted Abu Abd Allah al-Sadiq (AS) regarding what is narrated about the vision of Allah. Hence, he (AS) explained: The sun is a seventieth portion of the light of the Throne [al-kursi]. The throne is a seventieth portion of the light of the Empyrean [arsh]. The Empyrean is a seventieth portion of the light of the Veil [hijab]. And the Veil is a seventieth portion of the Veil of Light [sitr]. Hence, if they speak the truth, can their eyes bear the sight of the sun on a cloudless day?",
"Hadith": 3
},
{
"Content": "4. My father (RA) said: Muhammad ibn Yahya al-Attar said on the authority of Ahmad ibn Muhammad ibn Isa that Ibn Abu Nasr said on the authority of Abu al-Hasan (Ali) al-Rida (AS) that The Messenger of Allah said: \"When I was taken to heaven during the Night Journey, Jibrail took to me to a place where he had never stopped before. Hence, the Veil was remove for me and Allah, the Mighty and High, showed me what He desired from the Light of His Magnitude.\"",
"Hadith": 4
},
{
"Content": "5. My Father (RA) said: Ali ibn Ibrahim ibn Hashimsaid on the authority of his father, on the authority of Ali ibn Mabad, on the authority of Abd Allah ibn Sinan, on the authority of his father that I was in the presence of Abu Jafar al-Baqir (AS) when a Kharijite entered his presence and asked him: \"O Abu Jafar, who do you serve?\" He (AS) replied: \"Allah?\" He questioned: \"Have you seen Him?\" He (AS) answered: Eyes cannot see him through vision, but hearts can see Him through certainty of faith. He is neither recognized with analogy, nor perceived with the senses, and cannot be compared to people. He is attributed through signs and recognized through indications. There is no oppression in His Judgement. Such is Allah; there is no god but Him. He said: \"Then the man left while saying that Allah knows best where to place His Message.\"",
"Hadith": 5
},
{
"Content": "6. My father said: Sad ibn Abd Allah said: Ahmad ibn Muhammad ibn Abu Nasr on the authority of Abu al-Hasan al-Mausili, on the authority of Abu abd Allah that A rabbi came to the Commander of the Faithful (AS) and asked: \"O Commander of Faithful! Do you see your Lord when you serve Him?\" Thus, he (AS) replied: \"Woe unto you! I do not serve a Lord that I cannot see.\" The rabbi asked: \"How do you see Him?\" He (AS) responded: \"Woe unto you! The eyes do not perceive Him through vision but the hearts see Him through certainty of faith.\"",
"Hadith": 6
},
{
"Content": "7. Al-Husayn ibn Ahmad ibn Idris (RA) said on the authority of his father, on the authority of Ahmad ibn Ishaq that I wrote to Abu al-Hasan the third (al-Naqi) (AS) asking about the vision of (Allah) and what people say about it. Hence, he wrote: Vision is only possible so long so there is no obstacle between the seer and the seen. So, when there is an obstacle to vision, or lack of light between the seer and the seen, vision is impeded or inaccurate. Fault necessitates when the seer equals the seen in the cause that is required between them for vision. When it comes to vision, we can speak in anthropomorphic terms due to cause and effect.",
"Hadith": 7
},
{
"Content": "8. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Yaqub said: Ahmad ibn Idris said on the authority of Ahmad Muhammad ibn Isa, on the authority of Ali ibn Sayf, on the authority of Muhammad ibn Ubaydah that I wrote to Abu al-Hasan (Ali) al-Rida (AS) asking him about the vision of Allah and what that Sunnis and the Shiites narrate regarding the subject. I asked him to explain the subject in detail to me. Hence, he (AS) wrote in his own handwriting: All agree unanimously that Allah's recognition is necessary. So, if it is possible to see Allah, the Mighty and High, with the eyes, then recognition has taken place. And this recognition could take place with or without faith. If recognition via vision is faith, then it is not faith, because faith is the opposite of visual recognition. If recognition via vision is faith, then there would be no people of faith in the world since nobody has seen Allah, Exalted is His Remembrance. If faith is based on visual recognition, then it might vanish as a result of death and resurrection. This is sufficient proof that Allah, noble be His Remembrance, cannot be seen by the eye....",
"Hadith": 8
},
{
"Content": "9. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Yaqub al-Kulayni said on the authority of Ahmad ibn Idris, on the authority of Muhammad ibn Abd al-Jabbar, on the authority of Safwan ibn Yahya that Abu Qurrah, the traditionist, asked me to take him to Abu al-Hasan (Ali) al-Rida (AS); therefore, I asked for his permission to visit him, and he granted it to me. So, he (Abu Qurrah) went to him, and asked him about the laws regarding the permissible and the forbidden, until he reached the subject of Divine Unity. Hence, Abu Qurrah said: \"It has been transmitted to us that Allah, the Mighty and High, divided vision and speech between two prophets; allocating speech to Musa (AS) and allocating vision for Muhammad (SA).\" Consequently, Abu al-Hasan (AS) replied: Who is it that brought the revelation from Allah, the Mighty and High, to both jinn and humankind? Vision comprehends Him not, and He comprehends (all) vision.1 And they do not comprehend Him in knowledge.2 Nothing whatsoever is like unto Him.3 Was it not Muhammad He said: \"Of course?\" If that is the case, then how could he come to all of creation, saying that he was sent by Allah, call them by His Command, that vision comprehend Him not, and He comprehend all vision. And they do not comprehend Him in Knowledge. Nothing whatsoever is like unto Him, and then claim that \"I have seen Him with my own eyes. I comprehend Him, and He has a human form.\" Are people not ashamed of saying such things? The unbelievers can use this against us: claiming that Allah revealed one thing and the Prophet contradicted it! Abu Qurrah enquired: \"Then He says: And certainly he saw Him in another descent.3\" Hence, Abu al-Hasan (AS) replied: Verily, the verse after this verse stipulates what he saw, as He says, The heart was not untrue in (making him see) what he saw.4 He is saying that the heart of Muhammad (SA) was not untrue in what his eyes saw. Then He informs of what he saw and says: Certainly he saw of the greatest signs of his Lord.5 Thus, the signs of Allah, the Mighty and High, are other than Allah. As He has said: And they do not comprehend Him in knowledge. So, if the eyes saw Him, then they comprehended Him in knowledge, and recognition had taken place. Abu Qurrah enquired: \"Do you claim that the prophetic traditions are false?\" Abu al-Hasan (AS) responded: \"Any prophetic traditions which contradict the Quran are false. According to the consensus of all Muslims, He cannot be comprehended in knowledge, vision comprehends Him not, and nothing whatsoever is like unto Him.\"",
"Hadith": 9
},
{
"Content": "10. My father (RA) said: Muhammad ibn Yahya al-Attar said on the authority of Ahmad ibn Muhammad ibn Isa, on the authority of Ibn Abu Najran, on the authority of Abd Allah ibn Sinan that Abu Abd Allah al-Sadiq (AS) was asked to interpret the Word of the Mighty and High: Vision comprehends Him not, and He comprehends (all) vision. He explained: It is the comprehension of the imagination. Do you not see His Word: Verily, there have come to you clear proofs from your Lord. This does not mean the vision of eyes; however, whoever will see, it is for his own soul. And whoever will be blind, it shall be against himself.1 This does not mean blindness of the eyes. It certainly means comprehension of the imagination, like it is said: so and so has the vision of poetry, so and so has the vision of jurisprudence, so and so has the vision of coins, and so and so has the vision of clothes. Allah is far above visual perception.",
"Hadith": 10
},
{
"Content": "11. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan alSaffar said: Ahmad ibn Muhammad said on the authority of Abu Hashim al-Jafari, on the authority of Abu al-Hasan (Ali) al-Rida (AS) that I asked him whether it is possible to describe Allah, the Mighty and High. Hence, he replied: \"Do you not read the Quran?\" I responded: \"What do you mean?\" He said: \"Do you not read the Word of the Mighty and High: Vision comprehends Him not, and He comprehends (all) vision.2 I answered: \"So?\" He (AS) asked: \"Then do you know what vision means?\" I replied: \"Sure\" He (AS) said: \"What is t?\" I said: \"The vision of the eyes.\" Hence, he (AS) explained: \"Verily, the imagination of the mind is greater than the vision of the eyes. Thus, imagination comprehends Him not, and He comprehends all imagination.\"",
"Hadith": 11
},
{
"Content": "12. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Abu Abd Allah al-Kufi said on the authority of who he mentioned, on the authority of Muhammad ibn Isa, on the authority of Dawud ibn al-Qasim on the authority of Abu Hashim al-Jafari that I asked Abu Jafar ibn al-Rida (AS): \"Vision comprehends Him not, and He comprehends (all) vision. He (AS) replied: O Abu Hashim! The imagination of mind is more precise than the vision of the eyes. You may imagine Sind, India, the towns which you have not visited, and which you have not seen with your eyes. Thus, if imagination cannot comprehend Him, how can the eyes?\"",
"Hadith": 12
},
{
"Content": "13. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Abu Abd Allah al-Kufi said: Muhammad ibn Ismail al-Barmaki said: al-Husayn ibn al-Hasan said: Bakr ibn Salih said on the authority of al-Husayn ibn Said, on the authority of Ibrahim ibn Muhammad al-Khazzaz and Muhammad ibn al-Husayn both said      2  . We entered into the presence of Abu al-Hasan (Ali) al-Rida (AS). We related to him what was transmitted regarding Muhammad (SA); namely, that he saw His Lord in the form of a vigorous young man of thirty years of age, whose feet wee covered in greenery. I also explained to him that Hisham ibn Salim, Sahib al-Taqi and al-Maythami say that Allah's belly is hollow and the rest (of His body) is solid. Hence, he (AS) fell in prostration and then said: May You be Glorified! They have not recognized You, nor have they testified to Your Unity. As a result, they have described You as such. May You be glorified! Had they recognized You, they would have only described You by means of the attributes with which You have described yourself. May You be glorified! They have certainly wronged themselves by describing You with what is not worthy of You. O my God, I only describe You with the attributes with which You have described yourself, and I do not compare You with Your Creation. You are worthy of all good. Do not count me among the oppressors. Then he (AS) turned his face to us and said: \"Whatever you have imagined, imagine Allah as other than that.\" He (AS) then added: We, the Household of Muhammad (SA), are the middle way [al-Namat al-Awsat] which the exaggerator [ghali] cannot comprehend, and the neglectful follower does not reach. O Muhammad! Verily, when the Messenger of Allah (SA) looked at the grandeur of His Lord, he, the Messenger, was in a form of a vigorous young man of thirty years of age. O Muhammad! MY Lord is far above possessing the attributes of the created. He says, I asked him (AS): `May I be your ransom! Whose feet were covered in green?\" He (AS) replied: That refers to Muhammad (SA). When looked at his Lord by means of his heat, Allah covered him in the Light of His Veil until it was apparent to him what was behind the veil. Verily, the Light of Allah is green, red, and white, as well as other colors. O Muhammad, we only accept what agrees with the Book (Quran), and the Sunnah (traditions of the Prophet).",
"Hadith": 13
},
{
"Content": "14. Muhammad ibn Muhammad ibn Isam al-Kulayni (RA) said: Muhammad ibn Yaqub al-Kulayni said on the authority of Ali ibn Muhammad, on the authority of Sahl ibn Ziyad and others, on the authority of Muhammad ibn Sulayman, on the authority of Ali ibn Ibrahim al-Jafari, on the authority of Abd Allah ibn Sinan, that Abu Abd Allah al-Sadiq (AS) said: Verily, Allah is the Most Great, and the Lofty [al-rafi]. Worshippers cannot describe Him, nor can they reach the core of His Magnificence. Vision comprehends Him not, and He comprehends (all) vision; and He is the Subtle, the All-Aware. He cannot be described in terms of how,' where' and when'. And how can I describe him by means of how' when it is He who created the condition for the question how;' hence, I recognized the condition by the fact that He created the how.' And how can I describe Him in terms of where' when it was He was created space; hence, I recognized space by the fact that he created the where.' And how can I describe him in terms of when' when it was he who created time; hence, I recognized time by the fact that He created time. Thus, Allah, the Blessed and Exalted, is present in every place, and is absent from everything. Vision comprehends Him not, and He comprehends all vision. There is no god but He: the Most High, the Great. And He is the Knower of subtleties, the Aware.",
"Hadith": 14
},
{
"Content": "15. My father (RA) said: Sad ibn Abd Allah said on the authority of Ibrahim ibn Hashim, on the authority of the Ibn Abu Najran, on the authority of Muhammad ibn Sinan, on the authority of Ibrahim and al-Fadl sons fo Muhammad al-Ashariyyayn, on the authority of Ubayd ibn Zurarah, on the authority of his father that I asked Abu Abd Allah al-Sadiq (AS): \"May I be your ransom! What use to make the Messenger of Allah (SA) swoon when he received the revelation?\" He (AS) answered: \"That happened when there was nothing separating him from Allah. That happened when Allah manifested Himself to him.\" He says that he (AS) then added: \"Such is Prophethood, O Zurarah! Accept it with humility.\"",
"Hadith": 15
},
{
"Content": "16. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Ibrahim ibn Hashim said on the authority of Ibn Abu Umayr, on the authority of Murazim, that Abu Abd Allah al-Sadiq (AS) said: \"The Messenger of Allah saw his Lord, the Mighty and High, by means of his heart.\" The confirmation of this is found in the following tradition.",
"Hadith": 16
},
{
"Content": "17. What Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan al-Saffar said on the authority of Muhammad ibn al-Husayn ibn Abu al-Khattab, on the authority of Muhammad ibn al-Fudayl that I asked Abu al-Hasan al-Kazim (AS): \"Did the Messenger of Allah (SA) see his Lord, the Mighty and High?\" Hence, he (AS) replied: \"Yes, he saw Him by means of his heart. Have you not heard Allah, the Might and High that the heart was not untrue in (making him see) what he saw.1 That is to say, he did not see Him with his eyes, but he saw Him with the heart.\"",
"Hadith": 17
},
{
"Content": "18. My father (RA) said: Sad ibn Abd Allah said on the authority of al-Qasim ibn Muhammad alIsfahani, on the authority of Sulayman ibn Dawud al-Minqari, on the authority of Hafs ibn Ghiyath or someone else that I asked Abu Abd Allah al-Sadiq (AS) about the Word of Allah, the Mighty and High: Certainly, he saw of the greatest signs of his Lord.2 He (AS) replied: \"He saw Jibrail (AS). His thighs were covered in pearls like dew drops on plants. He had six hundred wings. He filled the space between the sky and the Earth.\"",
"Hadith": 18
},
{
"Content": "19. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Yaqub al-Kulayni said on the authority of Ahmad ibn Idris, on the authority of Muhammad ibn Abd al-Jabbar, on the authority of Safwan ibn Yahya that I met him1 (AS) on my return from Mecca to Khurasan and he was going to Iraq. I heard him say that \"Whoever fears Allah is feared, and whoever obeys Allah is obeyed.\" So I politely went over to him and greeted him. Hence, he (AS) returned my greetings and then added: O Fath, he who pleases the Creator does not consider the displeasure of the creation. And he who displeases the Creator deserves that that displeasure of creation overpowers him. Verily, the Creator can only be described by means of the attributes He has given Himself. And how could He be described when he made the senses incapable of conceiving Him, the concepts incapable of describing Him, and the eyes incapable of perceiving Him? He is far above the attributes of the attributers and the descriptions of the describers. He is distant in His Closeness and close in His Distance. Thus, He is near in His Farness and Far in His Nearness. Since He created conditions, the question how' cannot apply to Him. He ionized space; therefore, the question where' cannot apply to Him. IN doing so He is the Inventor [Mubdi'] of conditions and space. O Fath! Everybody is nourished with food except the Creator, the Sustainer. Verily, He created bodies, yet He has neither body nor image. He does not have parts, not does He have an end. He does not increase or decrease. He is not composed of any substance that would be found in a body. He is the Subtle, the All-Knowing, the All-Listening, and the All-Hearing. He is the One, the Unique, and the Needless. He begets not, nor is He begotten, and there is nothing equal unto Him. He is the Producer of All things. He gave shape to all bodies and made all images. IF it were as the anthropomorphist say, then the Creator could not be distinguished from the created, the Sustainer from the sustained, or the Originator from the originated. However, He is the Producer. He differs from created bodies, images and things in that He resembles nothing. I asked: \"if Allah is One and humankind is one, do they not resemble each other in oneness?\" Hence, he (AS) replied: You have said something impossible. May Allah secure you! Verily, the resemblance is limited to meaning. Names are one, and they indicate what is named. When it is said that the human being is one, it means that he is one as opposed to two. But, in fact, the human being is not truly one because his body parts are different and his colors are different. He is composed of many parts which are not the same. His blood is other than his flesh. His flesh is other than his blood. His nerves are other than his veins. His hair is other than his skin. His darkness is other than his paleness. Likewise is the rest of creation. Thus, the human being in only \"one\" in name but not \"one\" in meaning. Allah, Exalted be His Majesty, is One and there is none other than Him. There is no variation, contrast, increase, or decrease in Him. As for the human being, he is created from different parts and different substances. He is only \"one\" in combination. I enquired: As for your statement regarding \"the Subtle,\" kindly explain it to me, I know, of course, that His Subtlety differs from that of others. However, I would appreciate it if you could explain it to me in greater detail. Therefore, he (AS) answered: O Fath! I said: He is Subtle in subtleness of His Creation and in His Knowledge of microscopic matter. Do you not see His Stamp on the various types of plants, both soft and rough? And do you not contemplate the subtle creation of creatures like the gnat and the mosquito and those insects which are even smaller than these two and are almost invisible to the naked eye? In fact, they are almost invisible due to their tiny size, making it virtually impossible to differentiate the male from the female, and the young from the old. Thus, when we see the smallness of creatures in their refinement, their instinct to reproduce, and their fear of death; when we see the creatures that exist in the depths of the oceans, and in the branches of trees; when we see what exists in deserts and wastelands, and that each species has a means of communication through which they are understood by their offspring; when we see how creatures feed their offspring, and how creatures are distinguished by color, red with yellow, and white with red; then, and only then do we come to appreciate the subtlety of the Creator. Verily, everything has a precursor. Allah, the Creator, the Subtle, and the Sublime created everything out of nothing. I asked: \"May I be your ransom! Is there a creator other than the Sublime Creator?\" He (AS) replied: Verily, Allah, the Blessed and High says: Blessed be Allah, the best of creators.1 He has certainly acknowledged that there are creators among His Servants, including Jesus, the son of Mary [Isa ibn Maryam] (AS). He created from clay a figure of a bird by the will of Allah. Then he breathed into it, and it became a bird, by the will of Allah. And Samiri made for them the body of a calf that mooed. I enquired: \"Undoubtedly Isa created from clay a bird as a proof of his Prophethood, while Samiri made the body of calf to refute Musa's (AS) Prophethood. Was that Allah's will? Certainly this is astonishing.\" He answered: Woe unto you, O Fath! Verily, Allah has two intents or two wills; the definite [hatm] intent, and the determined [azm] intent. He forbids with desire, and orders without desire. Have you not seen that He banned Adam (AS) and his wife from eating from the tree while He wanted them to. Had he not willed it, they would not have eaten it, and if they had not eaten it, they would have defied Allah's will. He ordered Ibrahim (AS) to slaughter his son Ismail (AS) and desired him not to slaughter him. If He did not will for him to slaughter him, then Ibrahim (AS) would have defied Allah's will, the Mighty and High. I said: \"You have relieved me. May Allah relieve you! Except that you asked: The All-Hearing and the All-Seeing, does He hear with an ear and see with an eye?\" Consequently, He (AS) replied: Most certainly He hears what He sees and sees what He hears. He sees, but not with an eye like the eyes of the created. He hears, but not like the listeners listen. He hears in the sense that nothing is hidden from Him, not even the movement of a black particle on a hard rock in the dark of the night, in the depth of the Earth or in the depth of the oceans. We say: He is Seeing but not like the created. And when He comprehends all languages, and does not confuse one from another. We say: He hear, but not like others hear. I commented: \"May I be your ransom! I still have one last question.\" He (AS) said: \"Proceed for the sake of Allah, for the good deeds of your father!\" I asked: \"Would He know the things that He has not made; that if He did make them, how would they be?\" He answered: Woe to you! Your questions are defiantly difficult. Have you not heard Allah say? If there had been in them any gods except Allah, they would both have certainly been in a state of disorder.2 And His Word: And some of them would certainly have overpowered others.3 And He said relating an account of the people of Hell: Take us out; we will do good deeds other than those which we used to do.4 And He said: And if they were sent back, they would certainly go back to that which they are forbidden.5 He certainly knew what would have happened if other things had happened.",
"Hadith": 9
},
{
"Content": "10. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (may Allah be pleased with him) said: Muhammad ibn al-Husayn al-Saffar said on the authority of Ubbad ibn Sulayman, on the authority of Sad ibn Sad that I asked Abu al-Hasan (Ali) al-Rida (AS) about Divine Unity. He responded: \"It is what you already follow.\"",
"Hadith": 10
},
{
"Content": "1. My Father (RA) that Sad ibn Abd Allah said: Ahmad ibn Muhammad ibn Isa and Ibrahim ibn Hashim both said on the authority of al-Husayn ibn Sayf on the authority of Sulayman ibn Amr on the authority of Muhajjir ibn Husayn ibn Zayd ibn Arqam who said that The Messenger of Allah said: \"He who dies without associating anything with Allah will enter Heaven, whether he did good or evil.\"",
"Hadith": 1
},
{
"Content": "2. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan alSaffar and Sad ibn Abd Allah both said, on the authority of Ahmad ibn Muhammad ibn Isa, on the authority of al-Haytham ibn Abu Masruq al-Nahdi, and Muhammad ibn al-Husayn ibn Abu al-Khattab all of whom on the authority of al-Hasan ibn Mahbub, on the authority of Umar ibn Abu al-Miqdam, on the authority of Ishaq ibn Ghalib, on the authority of Abu Abd Allah (AS), on the authority of his father (AS) that The Messenger of Allah (SA) said in some of his sermons: All praise is due to the Allah Who is Unique in His Beginning, and is Greatest in Divinity in His Eternity. He is the Great Absolute with Grandeur and Might. He innovated what He instigated. And He originated what He created without example prior to creating anything. The One without a Beginning raised us through the benevolence of His Lordship. With His knowledge He rendered. Due to the judgment of His Omnipotence He created all of creation. With the light of morning He made the dawn. Therefore, there is no substitute for His Creation, and none can modify what He makes. There is no hastening his Judgement, and no resting from His Call. There is no decline to His Realm, not an interruption to His Time. He is the First Existence, and is Forever Permanent. He is covered by His light, not by His Creation, in the high-aspiring horizon, the lofty might, and the high realm. He is far from everything, yet He is close to everything. Hence, He is Evident to His creation without being seen. He is the Highest Prospect. He liked to be qualified with Oneness so He covered Himself with His own Light. He is Distinctive in His Sublimity, and is Hidden from His Creation. He sent Messengers to His Creation as His Decisive Argument and Witnesses over them. Between the Messengers, He sent Prophets to His Creation, to give glad tidings (to the believers) who would be granted eternal life after having received the Evidence from Allah. He also sent Prophets to His Creation as warners of impeding doom to those who would be destroyed after having received the Evidence (from Allah). He did all of this so that servants may know their Lord. As a result, they recognized His Lordship after having denied it. They professed the Unity of His Divinity as a result of Diving Guidance.",
"Hadith": 2
},
{
"Content": "3. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (may Allah have mercy on him) said: Muhammad ibn Abu Abd Allah al-Kufi said: Muhammad ibn Ismail al-Barmaki said: al-Husayn ibn al-Hasan ibn Burdah said: al-Abbas ibn Amr al-Fuqami said on the authority of Abu al-Qasim Ibrahim ibn Muhammad al- Alawi, on the authority of al-Fath ibn Yazid alJurjani that I met him1 (AS) on my return from Mecca to Khurasan and he was going to Iraq. I heard him say that \"Whoever fears Allah is feared, and whoever obeys Allah is obeyed.\" So I politely went over to him and greeted him. Hence, he (AS) returned my greetings and then added: O Fath, he who pleases the Creator does not consider the displeasure of the creation. And he who displeases the Creator deserves that that displeasure of creation overpowers him. Verily, the Creator can only be described by means of the attributes He has given Himself. And how could He be described when he made the senses incapable of conceiving Him, the concepts incapable of describing Him, and the eyes incapable of perceiving Him? He is far above the attributes of the attributers and the descriptions of the describers. He is distant in His Closeness and close in His Distance. Thus, He is near in His Farness and Far in His Nearness. Since He created conditions, the question how' cannot apply to Him. He ionized space; therefore, the question where' cannot apply to Him. IN doing so He is the Inventor [Mubdi'] of conditions and space. O Fath! Everybody is nourished with food except the Creator, the Sustainer. Verily, He created bodies, yet He has neither body nor image. He does not have parts, not does He have an end. He does not increase or decrease. He is not composed of any substance that would be found in a body. He is the Subtle, the All-Knowing, the All-Listening, and the All-Hearing. He is the One, the Unique, and the Needless. He begets not, nor is He begotten, and there is nothing equal unto Him. He is the Producer of All things. He gave shape to all bodies and made all images. IF it were as the anthropomorphist say, then the Creator could not be distinguished from the created, the Sustainer from the sustained, or the Originator from the originated. However, He is the Producer. He differs from created bodies, images and things in that He resembles nothing. I asked: \"if Allah is One and humankind is one, do they not resemble each other in oneness?\" Hence, he (AS) replied: You have said something impossible. May Allah secure you! Verily, the resemblance is limited to meaning. Names are one, and they indicate what is named. When it is said that the human being is one, it means that he is one as opposed to two. But, in fact, the human being is not truly one because his body parts are different and his colors are different. He is composed of many parts which are not the same. His blood is other than his flesh. His flesh is other than his blood. His nerves are other than his veins. His hair is other than his skin. His darkness is other than his paleness. Likewise is the rest of creation. Thus, the human being in only \"one\" in name but not \"one\" in meaning. Allah, Exalted be His Majesty, is One and there is none other than Him. There is no variation, contrast, increase, or decrease in Him. As for the human being, he is created from different parts and different substances. He is only \"one\" in combination. I enquired: As for your statement regarding \"the Subtle,\" kindly explain it to me, I know, of course, that His Subtlety differs from that of others. However, I would appreciate it if you could explain it to me in greater detail. Therefore, he (AS) answered: O Fath! I said: He is Subtle in subtleness of His Creation and in His Knowledge of microscopic matter. Do you not see His Stamp on the various types of plants, both soft and rough? And do you not contemplate the subtle creation of creatures like the gnat and the mosquito and those insects which are even smaller than these two and are almost invisible to the naked eye? In fact, they are almost invisible due to their tiny size, making it virtually impossible to differentiate the male from the female, and the young from the old. Thus, when we see the smallness of creatures in their refinement, their instinct to reproduce, and their fear of death; when we see the creatures that exist in the depths of the oceans, and in the branches of trees; when we see what exists in deserts and wastelands, and that each species has a means of communication through which they are understood by their offspring; when we see how creatures feed their offspring, and how creatures are distinguished by color, red with yellow, and white with red; then, and only then do we come to appreciate the subtlety of the Creator. Verily, everything has a precursor. Allah, the Creator, the Subtle, and the Sublime created everything out of nothing. I asked: \"May I be your ransom! Is there a creator other than the Sublime Creator?\" He (AS) replied: Verily, Allah, the Blessed and High says: Blessed be Allah, the best of creators.1 He has certainly acknowledged that there are creators among His Servants, including Jesus, the son of Mary [Isa ibn Maryam] (AS). He created from clay a figure of a bird by the will of Allah. Then he breathed into it, and it became a bird, by the will of Allah. And Samiri made for them the body of a calf that mooed.",
"Hadith": 3
},
{
"Content": "4. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (may Allah be pleased with him) said: Muhammad ibn al-Hasan al-Saffar said on the authority of Ubbad ibn Sulayman, on the authority of Sad ibn Sad that I asked Abu al-Hasan (Ali) al-Rida (AS) about Divine Unity. He responded: \"It is what you already follow.\"",
"Hadith": 4
},
{
"Content": "5. My Father (may Allah have mercy on him) that Sad ibn Abd Allah said on the authority of Ibrahim ibn Hashim; ad Yaqub ibn Yazid both of them on the authority of Ibn Fuddal, on the authority of Ibn Bukayr, on the authority of Zurarah that Abu Abd Allah al-Sadiq (AS) was asked to interpret the Word of the Mighty and High: And to Him submits whoever is in heavens and the Earth, willingly or unwillingly.1 He said: \"They are bound to the belief in the Unity of Allah, the Mighty and High.\"",
"Hadith": 5
},
{
"Content": "6. My father (may Allah have mercy on him) that Sad ibn Abd Allah said: Muhammad ibn alHusayn said on the authority of Muhammad ibn Sinan, on the authority of Ishaq ibn alHarith, on the authority of Abu Basir that Abu Abd Allah al-Sadiq (AS) took out a small box and took out from it a piece of paper, which had the following written on it: Praise be to the One! There is no god but He. He is the Eternal, and the Originator without beginning. He is the Eternal, who does not tire. He is the Living, who does not die. He is the Creator of the seen and the unseen. He is the Knower of Everything without being taught. Such is Allah who has no associate.",
"Hadith": 6
},
{
"Content": "7. Muhammad ibn al-Qasim the Commentator (may Allah have mercy on him) said: Yusuf ibn Muhammad ibn Ziyad, and Ali ibn Muhammad ibn Sayyar said on the authority of their fathers, on the authority of al-Hasan ibn Ali ibn Muhammad ibn Ali al-Rida (AS), on the authority of his father (AS), on the authority of his grandfather AS) that  m   > A man stood up in the presence of (Ali) al-Rida (AS) and said to him: \"O son of the Messenger of Allah! Describe your Lord for us as there are some people who differ with us.\" Hence, al-Rida (AS) said: Verily, he who describes his Lord by analogy is still ambiguous in the world. He is straying from the straight path. He is transient in the deviation (from that which is right). He is lead astray from the way. And he says things that are not proper. I am describing Him the way He described Himself, without relying on images. It is possible to describe Him without recurring to anthropomorphism. He is Close in His Farness, and is without an equivalent. He cannot be compared to His Creation. He does not oppress anyone in His Judgment. The creation is critical of what they know. And they pursue what He has embedded in His Book. He is Aware of everything they do. They do not intend anyone but Him. He is Near, but He is not attached. He is Far, but not cut off. He is Ascertained, ut is not exemplified. He is United, and not divided into parts. He is Known by His Signs, and is proved by His Symbols. Hence, there is no god but He, the Great, and the Most High.",
"Hadith": 7
},
{
"Content": "8. He (AS) then said: He spoke another word after this: My father related to me on the authority of father, on the authority of his grandfather, on the authority of his father (AS) that The messenger of Allah (SA) said: \"Anyone who attributes Him with the shortcomings of His Servants had done Him an injustice. The Compiler of this book says: The tradition is long. We have taken from it the required passage. I have transmitted all of it in the commentary of the Quran.",
"Hadith": 8
},
{
"Content": "1. Muhammad ibn Musa ibn al-Mutawakkil (may Allah have mercy on him) said: Ali ibn Ibrahim ibn Hashim said on the authority of his father, on the authority of al-Nawfali, on the authority of al-Sakuni, on the authority of Abu Abd Allah, on the authority of his forefathers (AS) that The Prophet (SA) passed by a man who was supplication with his eyes raised to the sky. The Messenger of Allah (SA) said to him: \"Cast down your eyes for you will certainly not see Him.\" He (SA) also said that: \"The Prophet (SA) passed by a man who was supplicating with his hands raised to the sky. The Messenger of Allah (SA) said to him: Lower your hand for your will surely not reach Him.'",
"Hadith": 1
},
{
"Content": "2. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (may Allah have mercy on him) said: Muhammad ibn Abu Abd Allah al-Kufi said on the authority of Ali ibn Abu al-Qasim, on the authority of Yaqub ibn Ishaq that I wrote to Abu Muhammad al-Askari (AS) asking him how a servant could serve a Lord he cannot see? Hence, he (AS) replied in writing: \"O Abu Yusuf! My Master, my Lord, and the Benefactor upon me any my forefathers, is far above being seen.\" He said: \"I also asked whether the Messenger of Allah (SA) saw him Lord?\" He wrote back: \"Verily, Allah, the Blessed and Exalted, manifested to the Messenger what He desired from the Light of His Magnitude.\"",
"Hadith": 2
},
{
"Content": "3. Al-Husayn ibn Ahmad ibn Idris (RA) said on the authority of his father, on the authority of Muhammad ibn Abd al-Jabbar, on the authority of Safwan ibn Yahya, on the authority of Asim ibn Humayd that I consulted Abu Abd Allah al-Sadiq (AS) regarding what is narrated about the vision of Allah. Hence, he (AS) explained: The sun is a seventieth portion of the light of the Throne [al-kursi]. The throne is a seventieth portion of the light of the Empyrean [arsh]. The Empyrean is a seventieth portion of the light of the Veil [hijab]. And the Veil is a seventieth portion of the Veil of Light [sitr]. Hence, if they speak the truth, can their eyes bear the sight of the sun on a cloudless day?",
"Hadith": 3
},
{
"Content": "4. My father (RA) said: Muhammad ibn Yahya al-Attar said on the authority of Ahmad ibn Muhammad ibn Isa that Ibn Abu Nasr said on the authority of Abu al-Hasan (Ali) al-Rida (AS) that The Messenger of Allah said: \"When I was taken to heaven during the Night Journey, Jibrail took to me to a place where he had never stopped before. Hence, the Veil was remove for me and Allah, the Mighty and High, showed me what He desired from the Light of His Magnitude.\"",
"Hadith": 4
},
{
"Content": "5. My Father (RA) said: Ali ibn Ibrahim ibn Hashimsaid on the authority of his father, on the authority of Ali ibn Mabad, on the authority of Abd Allah ibn Sinan, on the authority of his father that I was in the presence of Abu Jafar al-Baqir (AS) when a Kharijite entered his presence and asked him: \"O Abu Jafar, who do you serve?\" He (AS) replied: \"Allah?\" He questioned: \"Have you seen Him?\" He (AS) answered: Eyes cannot see him through vision, but hearts can see Him through certainty of faith. He is neither recognized with analogy, nor perceived with the senses, and cannot be compared to people. He is attributed through signs and recognized through indications. There is no oppression in His Judgement. Such is Allah; there is no god but Him. He said: \"Then the man left while saying that Allah knows best where to place His Message.\"",
"Hadith": 5
},
{
"Content": "6. My father said: Sad ibn Abd Allah said: Ahmad ibn Muhammad ibn Abu Nasr on the authority of Abu al-Hasan al-Mausili, on the authority of Abu abd Allah that A rabbi came to the Commander of the Faithful (AS) and asked: \"O Commander of Faithful! Do you see your Lord when you serve Him?\" Thus, he (AS) replied: \"Woe unto you! I do not serve a Lord that I cannot see.\" The rabbi asked: \"How do you see Him?\" He (AS) responded: \"Woe unto you! The eyes do not perceive Him through vision but the hearts see Him through certainty of faith.\"",
"Hadith": 6
},
{
"Content": "7. Al-Husayn ibn Ahmad ibn Idris (RA) said on the authority of his father, on the authority of Ahmad ibn Ishaq that I wrote to Abu al-Hasan the third (al-Naqi) (AS) asking about the vision of (Allah) and what people say about it. Hence, he wrote: Vision is only possible so long so there is no obstacle between the seer and the seen. So, when there is an obstacle to vision, or lack of light between the seer and the seen, vision is impeded or inaccurate. Fault necessitates when the seer equals the seen in the cause that is required between them for vision. When it comes to vision, we can speak in anthropomorphic terms due to cause and effect.",
"Hadith": 7
},
{
"Content": "8. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Yaqub said: Ahmad ibn Idris said on the authority of Ahmad Muhammad ibn Isa, on the authority of Ali ibn Sayf, on the authority of Muhammad ibn Ubaydah that I wrote to Abu al-Hasan (Ali) al-Rida (AS) asking him about the vision of Allah and what that Sunnis and the Shiites narrate regarding the subject. I asked him to explain the subject in detail to me. Hence, he (AS) wrote in his own handwriting: All agree unanimously that Allah's recognition is necessary. So, if it is possible to see Allah, the Mighty and High, with the eyes, then recognition has taken place. And this recognition could take place with or without faith. If recognition via vision is faith, then it is not faith, because faith is the opposite of visual recognition. If recognition via vision is faith, then there would be no people of faith in the world since nobody has seen Allah, Exalted is His Remembrance. If faith is based on visual recognition, then it might vanish as a result of death and resurrection. This is sufficient proof that Allah, noble be His Remembrance, cannot be seen by the eye....",
"Hadith": 8
},
{
"Content": "9. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Yaqub al-Kulayni said on the authority of Ahmad ibn Idris, on the authority of Muhammad ibn Abd al-Jabbar, on the authority of Safwan ibn Yahya that Abu Qurrah, the traditionist, asked me to take him to Abu al-Hasan (Ali) al-Rida (AS); therefore, I asked for his permission to visit him, and he granted it to me. So, he (Abu Qurrah) went to him, and asked him about the laws regarding the permissible and the forbidden, until he reached the subject of Divine Unity. Hence, Abu Qurrah said: \"It has been transmitted to us that Allah, the Mighty and High, divided vision and speech between two prophets; allocating speech to Musa (AS) and allocating vision for Muhammad (SA).\" Consequently, Abu al-Hasan (AS) replied: Who is it that brought the revelation from Allah, the Mighty and High, to both jinn and humankind? Vision comprehends Him not, and He comprehends (all) vision.1 And they do not comprehend Him in knowledge.2 Nothing whatsoever is like unto Him.3 Was it not Muhammad He said: \"Of course?\" If that is the case, then how could he come to all of creation, saying that he was sent by Allah, call them by His Command, that vision comprehend Him not, and He comprehend all vision. And they do not comprehend Him in Knowledge. Nothing whatsoever is like unto Him, and then claim that \"I have seen Him with my own eyes. I comprehend Him, and He has a human form.\" Are people not ashamed of saying such things? The unbelievers can use this against us: claiming that Allah revealed one thing and the Prophet contradicted it! Abu Qurrah enquired: \"Then He says: And certainly he saw Him in another descent.3\" Hence, Abu al-Hasan (AS) replied: Verily, the verse after this verse stipulates what he saw, as He says, The heart was not untrue in (making him see) what he saw.4 He is saying that the heart of Muhammad (SA) was not untrue in what his eyes saw. Then He informs of what he saw and says: Certainly he saw of the greatest signs of his Lord.5 Thus, the signs of Allah, the Mighty and High, are other than Allah. As He has said: And they do not comprehend Him in knowledge. So, if the eyes saw Him, then they comprehended Him in knowledge, and recognition had taken place. Abu Qurrah enquired: \"Do you claim that the prophetic traditions are false?\" Abu al-Hasan (AS) responded: \"Any prophetic traditions which contradict the Quran are false. According to the consensus of all Muslims, He cannot be comprehended in knowledge, vision comprehends Him not, and nothing whatsoever is like unto Him.\"",
"Hadith": 9
},
{
"Content": "10. My father (RA) said: Muhammad ibn Yahya al-Attar said on the authority of Ahmad ibn Muhammad ibn Isa, on the authority of Ibn Abu Najran, on the authority of Abd Allah ibn Sinan that Abu Abd Allah al-Sadiq (AS) was asked to interpret the Word of the Mighty and High: Vision comprehends Him not, and He comprehends (all) vision. He explained: It is the comprehension of the imagination. Do you not see His Word: Verily, there have come to you clear proofs from your Lord. This does not mean the vision of eyes; however, whoever will see, it is for his own soul. And whoever will be blind, it shall be against himself.1 This does not mean blindness of the eyes. It certainly means comprehension of the imagination, like it is said: so and so has the vision of poetry, so and so has the vision of jurisprudence, so and so has the vision of coins, and so and so has the vision of clothes. Allah is far above visual perception.",
"Hadith": 10
},
{
"Content": "11. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan alSaffar said: Ahmad ibn Muhammad said on the authority of Abu Hashim al-Jafari, on the authority of Abu al-Hasan (Ali) al-Rida (AS) that I asked him whether it is possible to describe Allah, the Mighty and High. Hence, he replied: \"Do you not read the Quran?\" I responded: \"What do you mean?\" He said: \"Do you not read the Word of the Mighty and High: Vision comprehends Him not, and He comprehends (all) vision.2 I answered: \"So?\" He (AS) asked: \"Then do you know what vision means?\" I replied: \"Sure\" He (AS) said: \"What is t?\" I said: \"The vision of the eyes.\" Hence, he (AS) explained: \"Verily, the imagination of the mind is greater than the vision of the eyes. Thus, imagination comprehends Him not, and He comprehends all imagination.\"",
"Hadith": 11
},
{
"Content": "12. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Abu Abd Allah al-Kufi said on the authority of who he mentioned, on the authority of Muhammad ibn Isa, on the authority of Dawud ibn al-Qasim on the authority of Abu Hashim al-Jafari that I asked Abu Jafar ibn al-Rida (AS): \"Vision comprehends Him not, and He comprehends (all) vision. He (AS) replied: O Abu Hashim! The imagination of mind is more precise than the vision of the eyes. You may imagine Sind, India, the towns which you have not visited, and which you have not seen with your eyes. Thus, if imagination cannot comprehend Him, how can the eyes?\"",
"Hadith": 12
},
{
"Content": "13. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Abu Abd Allah al-Kufi said: Muhammad ibn Ismail al-Barmaki said: al-Husayn ibn al-Hasan said: Bakr ibn Salih said on the authority of al-Husayn ibn Said, on the authority of Ibrahim ibn Muhammad al-Khazzaz and Muhammad ibn al-Husayn both said      2  . We entered into the presence of Abu al-Hasan (Ali) al-Rida (AS). We related to him what was transmitted regarding Muhammad (SA); namely, that he saw His Lord in the form of a vigorous young man of thirty years of age, whose feet wee covered in greenery. I also explained to him that Hisham ibn Salim, Sahib al-Taqi and al-Maythami say that Allah's belly is hollow and the rest (of His body) is solid. Hence, he (AS) fell in prostration and then said: May You be Glorified! They have not recognized You, nor have they testified to Your Unity. As a result, they have described You as such. May You be glorified! Had they recognized You, they would have only described You by means of the attributes with which You have described yourself. May You be glorified! They have certainly wronged themselves by describing You with what is not worthy of You. O my God, I only describe You with the attributes with which You have described yourself, and I do not compare You with Your Creation. You are worthy of all good. Do not count me among the oppressors. Then he (AS) turned his face to us and said: \"Whatever you have imagined, imagine Allah as other than that.\" He (AS) then added: We, the Household of Muhammad (SA), are the middle way [al-Namat al-Awsat] which the exaggerator [ghali] cannot comprehend, and the neglectful follower does not reach. O Muhammad! Verily, when the Messenger of Allah (SA) looked at the grandeur of His Lord, he, the Messenger, was in a form of a vigorous young man of thirty years of age. O Muhammad! MY Lord is far above possessing the attributes of the created. He says, I asked him (AS): `May I be your ransom! Whose feet were covered in green?\" He (AS) replied: That refers to Muhammad (SA). When looked at his Lord by means of his heat, Allah covered him in the Light of His Veil until it was apparent to him what was behind the veil. Verily, the Light of Allah is green, red, and white, as well as other colors. O Muhammad, we only accept what agrees with the Book (Quran), and the Sunnah (traditions of the Prophet).",
"Hadith": 13
},
{
"Content": "14. Muhammad ibn Muhammad ibn Isam al-Kulayni (RA) said: Muhammad ibn Yaqub al-Kulayni said on the authority of Ali ibn Muhammad, on the authority of Sahl ibn Ziyad and others, on the authority of Muhammad ibn Sulayman, on the authority of Ali ibn Ibrahim al-Jafari, on the authority of Abd Allah ibn Sinan, that Abu Abd Allah al-Sadiq (AS) said: Verily, Allah is the Most Great, and the Lofty [al-rafi]. Worshippers cannot describe Him, nor can they reach the core of His Magnificence. Vision comprehends Him not, and He comprehends (all) vision; and He is the Subtle, the All-Aware. He cannot be described in terms of how,' where' and when'. And how can I describe him by means of how' when it is He who created the condition for the question how;' hence, I recognized the condition by the fact that He created the how.' And how can I describe Him in terms of where' when it was He was created space; hence, I recognized space by the fact that he created the where.' And how can I describe him in terms of when' when it was he who created time; hence, I recognized time by the fact that He created time. Thus, Allah, the Blessed and Exalted, is present in every place, and is absent from everything. Vision comprehends Him not, and He comprehends all vision. There is no god but He: the Most High, the Great. And He is the Knower of subtleties, the Aware.",
"Hadith": 14
},
{
"Content": "15. My father (RA) said: Sad ibn Abd Allah said on the authority of Ibrahim ibn Hashim, on the authority of the Ibn Abu Najran, on the authority of Muhammad ibn Sinan, on the authority of Ibrahim and al-Fadl sons fo Muhammad al-Ashariyyayn, on the authority of Ubayd ibn Zurarah, on the authority of his father that I asked Abu Abd Allah al-Sadiq (AS): \"May I be your ransom! What use to make the Messenger of Allah (SA) swoon when he received the revelation?\" He (AS) answered: \"That happened when there was nothing separating him from Allah. That happened when Allah manifested Himself to him.\" He says that he (AS) then added: \"Such is Prophethood, O Zurarah! Accept it with humility.\"",
"Hadith": 15
},
{
"Content": "16. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Ibrahim ibn Hashim said on the authority of Ibn Abu Umayr, on the authority of Murazim, that Abu Abd Allah al-Sadiq (AS) said: \"The Messenger of Allah saw his Lord, the Mighty and High, by means of his heart.\" The confirmation of this is found in the following tradition.",
"Hadith": 16
},
{
"Content": "17. What Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan al-Saffar said on the authority of Muhammad ibn al-Husayn ibn Abu al-Khattab, on the authority of Muhammad ibn al-Fudayl that I asked Abu al-Hasan al-Kazim (AS): \"Did the Messenger of Allah (SA) see his Lord, the Mighty and High?\" Hence, he (AS) replied: \"Yes, he saw Him by means of his heart. Have you not heard Allah, the Might and High that the heart was not untrue in (making him see) what he saw.1 That is to say, he did not see Him with his eyes, but he saw Him with the heart.\"",
"Hadith": 17
},
{
"Content": "18. My father (RA) said: Sad ibn Abd Allah said on the authority of al-Qasim ibn Muhammad alIsfahani, on the authority of Sulayman ibn Dawud al-Minqari, on the authority of Hafs ibn Ghiyath or someone else that I asked Abu Abd Allah al-Sadiq (AS) about the Word of Allah, the Mighty and High: Certainly, he saw of the greatest signs of his Lord.2 He (AS) replied: \"He saw Jibrail (AS). His thighs were covered in pearls like dew drops on plants. He had six hundred wings. He filled the space between the sky and the Earth.\"",
"Hadith": 18
},
{
"Content": "19. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Yaqub al-Kulayni said on the authority of Ahmad ibn Idris, on the authority of Muhammad ibn Abd al-Jabbar, on the authority of Safwan ibn Yahya that I met him1 (AS) on my return from Mecca to Khurasan and he was going to Iraq. I heard him say that \"Whoever fears Allah is feared, and whoever obeys Allah is obeyed.\" So I politely went over to him and greeted him. Hence, he (AS) returned my greetings and then added: O Fath, he who pleases the Creator does not consider the displeasure of the creation. And he who displeases the Creator deserves that that displeasure of creation overpowers him. Verily, the Creator can only be described by means of the attributes He has given Himself. And how could He be described when he made the senses incapable of conceiving Him, the concepts incapable of describing Him, and the eyes incapable of perceiving Him? He is far above the attributes of the attributers and the descriptions of the describers. He is distant in His Closeness and close in His Distance. Thus, He is near in His Farness and Far in His Nearness. Since He created conditions, the question how' cannot apply to Him. He ionized space; therefore, the question where' cannot apply to Him. IN doing so He is the Inventor [Mubdi'] of conditions and space. O Fath! Everybody is nourished with food except the Creator, the Sustainer. Verily, He created bodies, yet He has neither body nor image. He does not have parts, not does He have an end. He does not increase or decrease. He is not composed of any substance that would be found in a body. He is the Subtle, the All-Knowing, the All-Listening, and the All-Hearing. He is the One, the Unique, and the Needless. He begets not, nor is He begotten, and there is nothing equal unto Him. He is the Producer of All things. He gave shape to all bodies and made all images. IF it were as the anthropomorphist say, then the Creator could not be distinguished from the created, the Sustainer from the sustained, or the Originator from the originated. However, He is the Producer. He differs from created bodies, images and things in that He resembles nothing. I asked: \"if Allah is One and humankind is one, do they not resemble each other in oneness?\" Hence, he (AS) replied: You have said something impossible. May Allah secure you! Verily, the resemblance is limited to meaning. Names are one, and they indicate what is named. When it is said that the human being is one, it means that he is one as opposed to two. But, in fact, the human being is not truly one because his body parts are different and his colors are different. He is composed of many parts which are not the same. His blood is other than his flesh. His flesh is other than his blood. His nerves are other than his veins. His hair is other than his skin. His darkness is other than his paleness. Likewise is the rest of creation. Thus, the human being in only \"one\" in name but not \"one\" in meaning. Allah, Exalted be His Majesty, is One and there is none other than Him. There is no variation, contrast, increase, or decrease in Him. As for the human being, he is created from different parts and different substances. He is only \"one\" in combination. I enquired: As for your statement regarding \"the Subtle,\" kindly explain it to me, I know, of course, that His Subtlety differs from that of others. However, I would appreciate it if you could explain it to me in greater detail. Therefore, he (AS) answered: O Fath! I said: He is Subtle in subtleness of His Creation and in His Knowledge of microscopic matter. Do you not see His Stamp on the various types of plants, both soft and rough? And do you not contemplate the subtle creation of creatures like the gnat and the mosquito and those insects which are even smaller than these two and are almost invisible to the naked eye? In fact, they are almost invisible due to their tiny size, making it virtually impossible to differentiate the male from the female, and the young from the old. Thus, when we see the smallness of creatures in their refinement, their instinct to reproduce, and their fear of death; when we see the creatures that exist in the depths of the oceans, and in the branches of trees; when we see what exists in deserts and wastelands, and that each species has a means of communication through which they are understood by their offspring; when we see how creatures feed their offspring, and how creatures are distinguished by color, red with yellow, and white with red; then, and only then do we come to appreciate the subtlety of the Creator. Verily, everything has a precursor. Allah, the Creator, the Subtle, and the Sublime created everything out of nothing. I asked: \"May I be your ransom! Is there a creator other than the Sublime Creator?\" He (AS) replied: Verily, Allah, the Blessed and High says: Blessed be Allah, the best of creators.1 He has certainly acknowledged that there are creators among His Servants, including Jesus, the son of Mary [Isa ibn Maryam] (AS). He created from clay a figure of a bird by the will of Allah. Then he breathed into it, and it became a bird, by the will of Allah. And Samiri made for them the body of a calf that mooed.",
"Hadith": 19
},
{
"Content": "20. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Abu Abd Allah al-Kufi said: Muhammad ibn Ismail al-Barmaki said: al-Husayn ibn al-Hasan said: Bakr ibn Salih said on the authority of al-Husayn ibn Said, on the authority of Ibrahim ibn al-Hakam ibn Zuhayr, on the authority of Abd Allah ibn Jarir al- Abdi that     2  . All praise is for Allah who is neither sense, nor felt, nor touched, and who cannot be perceived with the five senses. He cannot be imagined. He cannot be described by tongues. Everything that can be sensed is created. And Allah is the Most High. Wherever He is searched He is found. All praise is for Allah who was before the ward was' (was created). The word was' was not there to describe Him. In fact, He was the First Being. No creator has made Him. Exalted be His Praise! Rather, He created things before they existed; therefore, they were as He made them. He knows what has existed, and what will exist. He was there when nothing was there, and when nothing could be heard. Thus, He existed when there was no existence.",
"Hadith": 20
},
{
"Content": "1. Muhammad ibn Musa ibn al-Mutawakkil (RA) said; Ali ibn Ibrahim ibn Hashim said on the authority of Muhammad ibn Abu Ishaq al-Khaffaf that some of our scholars related that a  2  o Abd Allah al-Daysani come to Hisham ibn al-Hakam and asked him: \"Do you have a Lord?\" Hence, he replied: \"Of course.\" \"Is He Omnipotent [qadir]?\" He enquired. He answered: \"Yes, He is Omnipotent, and He is the Subduer.\" He asked: \"Does He have the power to place the whole world in an egg, without making the egg bigger or the world smaller?\" So Hisham responded: \"Can you give me some time?\" Therefore, he said: \"I shall give you some time.\" Then he left from his presence. Hisham went riding to Abu Abd Allah al-Sadiq (AS) and asked for his permission to enter; hence, he permitted him. He then explained, \"O son of the Messenger of Allah (SA)! Abd Allah al-Daysani came to me with a question that no one can resolve except Allah and you.\" Thus, Abu Abd Allah al-Sadiq (AS) said to him, \"What is it that he asked you?\" So he replied, \"He said to me so and so.\" Thus, Abu Abd Allah al-Sadiq (AS) explained, \"O Hisham! How many sense do you have?\" \"Five.\" Hisham answered. So the Imam (AS) asked, \"Which is the smallest of the senses?\" He said: \"The pupil (of the eye).\" \"What is the size of the pupil?\" The Imam (AS) enquired. Hisham responded, \"It is the size of a grain of lentil or even smaller than that.\" Thus, the Imam (AS) said: \"O Hisham! Look ahead and above you, and inform me of what you see.\" He replied, \"I see the sky, the Earth, houses, palaces, dust, mountains and rivers.\" Then, Abu Abd Allah (AS) said: \"Verily, the One who has the power to place what you see in a grain of lentil or seen smaller than that has the power to place the whole world in an egg, without making the world smaller or making the egg bigger.\" Hisham threw himself down to the Imam's feet and kissed his hands, head and feet, and then said: \"This is sufficient for me, O son of the Messenger of Allah.\" Then he returned to his house. The following day al-Daysani came to him and said; \"O Hisham, I have come to you, greeted you, and have not come demanding an answer.\" Hisham replied, \"Whether or not you came for an answer, I have it.\" Hence, al-Daysani left is present. He was informed that Hisham went to the presence of Abu Abd Allah (AS) and he has taught him the answer. Abd Allah al-Daysani left, and reached the door of Abu Abd Allah (AS). He asked for his permission to enter and the Imam permitted him. When he sat down, he said to the Imam (AS), \"O Jafar son of Muhammad! Guide me to my Lord.\" Thus, Abu Abd Allah (AS) asked, \"What is your name?\" So he walked out on the Imam (AS) and did not inform him of is name. Hence, he friends asked him, \"Why did you not tell him your name?\" He replied, \"If I had told that my name is Abd Allah, he would have said: Who is that you are the servant of?\" They said to him \"Return to him and tell him to guide you to your Lord without asking you your name.\" Therefore, he returned to him and said: \"O Jafar! Guide me to my Lord, and do not ask me about my name.\" Thus, Abu Abd Allah (AS) said to him, \"Sit down.\" He had a young boy, who had an egg in his hand and was playing with it. So Abu Abd Allah (AS) said: \"Young lad, bring me the egg.\" So he brought it to him. Abu Abd Allah (AS) further said: O Daysani, this is a concealed stronghold. It has a solid cover, and inside the solid cover there is soft layer. Inside the soft layer there is the egg-yolk and the albumin. Neither does the egg-yolk mix with the albumin not does the albumin mix the egg-yolk. Each remains in its state. No informer comes out of it to inform of its usefulness nor has a defect informed of its decay. No one knows whether it will make a male or a female. Colors lie that of the peacocks burst out of it. Do you not think that it is the product of Planner [mudabbir]? He put his head down for a long time, then said: \"I bear witness that there is no god but Allah, Alone. He has no associates, and Muhammad is His Servant and Messenger, and you are an Imam and a Proof from Allah for His Creation. I repent for the misguidance in which I was in.\"",
"Hadith": 1
},
{
"Content": "2. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan al-Saffar said, on the authority of Ahmad ibn Muhammad ibn Khalid, on the authority of some of our scholars that  . Abu al-Hasan al-Rida (AS) was passing by a grave from the graves of his Household, so he placed his hand on the grave and said: O my God! Your Omnipotence is apparent. However, since You are Shapeless, people are ignorant of You. They try to measure You in a vain efforts to recognize You. However, any measurement of You is other than you. O my Lord! I disassociate myself from those who compare You with Your creation. Nothing is similar to You. My Lord! They cannot comprehend You. If they wanted to recognize You, Your blessings are the best proof for You.",
"Hadith": 2
},
{
"Content": "3. My father (RA) that Sad ibn Abd Allah said: Muhammad ibn al-Husayn ibn Abu al-Khattab said, on the authority of Ahmad ibn Muhammad ibn Abu Nasr that A group of people came from across the river to see Abu al-Hasan al-Rida (AS) and said: \"We have come to ask you three questions. If you can answer all the three question, we will know that you are the Most Learned.\" The Imam (AS) said: \"Ask.\" They said: \"Let us know about Allah: Where is He? How is He? And what does He rely upon?\" Hence, he (AS) replied, \"Verily, Allah, the Mighty and High, created the quality of how;' therefore how' does not apply to Hi. He has created space; thus, He is not in need of space. And He relies upon His Omnipotence.\" They said: We testify that you are Most Learned One.\"",
"Hadith": 3
},
{
"Content": "4. Muhammad ibn Ali Majilwayh (RA) said, on the authority of his paternal uncle Muhammad ibn Abu al-Qasim, on the authority of Ahmad ibn Muhammad ibn Khalid, on the authority of Muhammad ibn Ali al-Kufi, on the authority of Abd al-Rahman, ibn Muhammad ibn Abu Hashim, on the authority of Ahmad ibn Muhsin al-Maythami that  m   m I was in the presence of Abu Mansur al-Mutatabbib when he said: One of my companions related to me that: I was sitting in the Sacred Mosque of Mecca with Ibn Abu al-Awja' and Abd Allah ibn alMuqaffa when Ibn al-Muqaffaasked pointing at the place of circumambulation [Tawaf], \"Do you see these created beings?\". He said: \"There is not a single human being among them, except the Shaykh who is sitting over there (meaning Jafar ibn Muhammad). The rest are nothing but riffraff and beasts.\" So Ibn Abu al-Awja' answered him, \"How is it that you apply the term (human being) to this shaykh and no to the others?\" \"Because I have seen in him what I do not see in them,\" he replied. Thus, Ibn Abu al-Awja' enquired, \"I must confirm for myself what you have said regarding him.\" Then, Ibn al-Muqaffa replied to him, \"Do not even go there! For, verily, I fear that you may destroy what you already have!\" He said: \"This is not your view. In fact, you fear that I will regard your view as weak once I see the one whom you have praised.\" Ibn al-Muqaffa then replied, \"If you suspect this then go to him, to have y our doubts removed. Do not be stubborn. It will protect you from hesitation. Inform him of what may benefit or harm you.\" The reporter says that Ibn Abu al-Awja' got up and Ibn al-Muqaffa and I remained. Then he returned to us and said: \"O Ibn al-Muqaffa! He is not a human being, even though he may be a mystic [ruhani] in this world. If he desires, he appears as a body. If he desires, he conceals himself as a spirit. This is what he is.\" He asked, \"How is that?\" He replied, \"I sat near him. When there was no one there other than me, he (AS) said to me, \"If things are as people claim, and if they believed in what they professed, (referring to the people circumambulating the Kabah), then they are safe, and you are destroyed. However, if the matter is the way you all say it, and it certainly is not, then you are both equal.\" I asked him, \"May Allah have mercy on you! What is it that we say and what is it that they say? My statement and their statement is nothing but the same.\" He (AS) responded, \"How can your statement and their statement be one when they say that they have a return, reward, and punishment. They affirm that the sky has a Lord and it is inhabited while you claim that the sky is wasteland and there is no one there.\" Ibn Abu al-Awja' says that I availed the opportunity from him and asked him, What ha stopped Him, if the matter is the way you say it, to appear to His Creation and call them to His service so that any two of them may not differ from each other? Why has He hidden Himself from them, and has sent the Messengers to them? If He had directly come in contact with them, more would believe in Him. Thus, he (AS) replied to me, Woe to you! How is He hidden from you when He showed you His Omnipotence in your own self? He brought you into being when you did not exist. His Omnipotence is shown in your old age after youth, in your strength after weakness, and in your weakness after strength; in your illness after health, and your health after illness; in your pleasure after anger, and your anger after pleasure; in your sadness after happiness, and your happiness after sadness; in liking after disliking, and in disliking after liking; in deciding after refusing, and in refusing after deciding; in kindness after meanness, and in meanness after kindness, in your exhortation after apprehension, and apprehension after exhortation; in your hope after despair, and your despair after hope; in the idea which was not in your imagination, and in the distance between what you believe from your mind. He was still counting to me (the proofs of) His Omnipotence in my own self, which I could not reject, until I started believing that Allah would appear between me and him.",
"Hadith": 4
},
{
"Content": "5. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan alSaffar, on the authority of Ahmad ibn Muhammad ibn Khalid, on the authority of Muhammad ibn Isa, on the authority of Muhammad ibn Abu Nasr, on the authority of Muhammad ibn Zayd that I came to (Ali) al-Rida (AS) asking him about Divine Unity, so he (AS) dictated to me: All praise be to Allah, the Originator, Producer, and Innovator [Mubtadi] of all things from the beginning by His Power and Wisdom, not from anything that could invalidate His Invention, nor for nay wrong cause. He created whatever He wanted how He wanted, and He did so independently in order to manifest His Wisdom, and the Reality of His Lordship. Intellects cannot grasp Him. Imagination cannot reach Him. Eyes cannot perceive Him, and scale cannot encompass Him. Speech is incapable without Him. Eyes are expressionless without Him, and rhetoric of description goes astray in Him. He is hidden without a veil and is covered without a covering. He is recognized without seeing. He is described without an image. And He is praised despite the face that He does not possess a body. There is no god but Allah, the great, the Most Exalted.\"",
"Hadith": 5
},
{
"Content": "6. Ali ibn Ahmad ibn Abd Allah ibn Ahmad ibn Abu Abd Allah al-Barqi said, on the authority of his father, on the authority of his grandfather Ahmad ibn Abu Abd Allah, on the authority of Ahmad ibn Muhammad ibn Abu Nasr, on the authority of Muhammad ibn Hukaym that I described the statement of Hisham al-Jawaliqi, and narrated for Musa al-Kazim (AS) the statement of Hisham ibn al-Hakam that He possesses a body. Hence, he (AS) said: \"Verily, nothing resembles Allah. Indecent language is better than words which give the Creator a created body or image composed of parts. Exalted from these, the High, the Great.\"",
"Hadith": 6
},
{
"Content": "7. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (may Allah be pleased with them) said: Muhammad ibn Abu Abd Allah al-Kufi said: Muhammad ibn Ismail al-Barmaki said: on the authority of al-Husan ibn al-Hasan, and al-Husayn ibn Ali, on the authority of Salih ibn Abu Hammad, on the authority of Bakr ibn Salih, on the authority of Muhammad ibn al-Husayn ibn Said, on the authority of Abd Allah in al-Mughayrah, on the authority of Muhammad ibn Ziyad said: I heard Yunus ibn Zabyan say      m   I entered in the presence of Abu Abd Allah al-Sadiq (AS) and told him: Hisham ibn al-Hakam made a long statement. I will simply summarize it: He considers Allah to be a body because things are of two types: bodies or actions of bodies. Hence, if it is not possible for the creator to be an action, it is only possible that He be a Doer. Then Abu Abd Allah (AS) replied: \"Woe to him! Does he not know that a body is extremely limited, and an image is absolutely limited? Hence, if a limit is possible then increase and decrease are possible, and if increase and decrease are possible, then He is created. I asked: \"Then what should I say? He answered: He has neither body nor image for He is the creator of bodies and images. He is devoid of parts and limits. He does not increase, nor does He decrease. If He were as he (Hisham) says then there would be no difference between the Creator and the created, or between the Inventor and the invented. However, He is the Inventor. The Creator of Bodies and Images does not resemble anything nor does anything resemble Him.\"",
"Hadith": 7
},
{
"Content": "8. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (may Allah be pleased with him) said: Muhammad ibn Abu Abd Allah al-Kufi said: on the authority of Muhammad ibn Ismail alBarmaki, on the authority of al-Hasan ibn Abd al-Rahman al-Hammani that  3 I said to Abu al-Hasan Musa ibn Jafar (AS): Hisham ibn al-Hakam thinks that Allah is a body. There is nothing whatsoever like unto Him, the All-knowing, the All-Hearing, the All-Seeing, the Omnipotent, the Speaker, and the Communicator. Speech, Omnipotence, and Knowledge flow from the One Same Source, None of these things are created. So he (AS) said: May Allah kill him! Does he not know that a body is limited, and that speech is other than the speaker? Allah forbid, I am free from such words. He is devoid of both body and image. He has not limits, and everything other than Him is created. Verily, everything that exists is the result of His Will and Intent which is expressed without words, the use of the tongue, or any reluctance or hesitation.",
"Hadith": 8
},
{
"Content": "9. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (may Allah have mercy on him) said: on the authority of Muhammad ibn Yaqub al-Kulayni, on the authority of Ali ibn Muhammad, on the authority of Sahl ibn Ziyad, on the authority of Ibrahim ibn Muhammad al-Hamdani that I wrote to Abu al-Hasan al-Naqi (AS), informing him that some of his following have differences on the subject of Divine Unity. Some of them say that He has a body, while others say that He has an image. So He (AS) wrote to me the following in his own handwriting: \"Glory be to Him who has no limit and who cannot be described! There is nothing whatsoever like unto Him. And He is the All-Hearing, the All-Knowing.\" He (AS) may have said: \"the All-Seeing.\"",
"Hadith": 9
},
{
"Content": "10. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (may Allah be pleased with him) said: Muhammad ibn Yahya al-Attar said: Muhammad ibn Ahmad said: Muhammad ibn Isa said, on the authority of Hisham ibn Ibrahim who said: al-Abbasi said I said to him (AS), meaning Abu alhasan al-Rida (AS): \"May I be your ransom! One of your followers told me to ask you a question about something.\" He (AS) said: \"And who would that be?\" I said: \"Al-Hasan ibn Sahl.\" He (AS) asked: \"What is the issue about?' I replied: \"It is about Divine Unity.\" He (AS) said: \"What about Divine Unity?\" I said: \"He wants to know whether Allah possesses a body or not?\" He (AS) answered me: There are three positions regarding Divine Unity. The first group attempts to describe Him through anthropomorphism. The second group attempts to describe Him through negation. And the third group attempts to describe Him without falling into anthropomorphism. Describing Him through anthropomorphism is not allowed, and describing Him through negation is not allowed. The correct position is attempting to describe him without falling into anthropomorphism.",
"Hadith": 10
},
{
"Content": "11. Muhammad ibn Ali Majilwayh (may Allah have mercy on him) said: Muhammad ibn Yahya al-Attar said: Muhammad ibn Ahmad said: on the authority of Imran ibn Musa, on the authority of al-Hasan ibn al-Abba ibn Huraysh al-Razi, on the authority of some of our scholars that The purified [Tayyib], Ali ibn Muhammad, and Abu Jafar al-Jawad (AS) both said: \"He who claims that Allah has a body, do not give him the poor-rate, and do not pray behind him.\"",
"Hadith": 11
},
{
"Content": "12. Muhammad ibn Musa ibn al-Mutawakkil (may Allah have mercy on him) said: Muhammad ibn Yahya al-Attar said: on the authority of Sahl ibn Ziyad, on the authority of Muhammad ibn Ali al-Qasani who said I wrote to him (AS) informing him that some of the people here differed on the subject of Divine Unity. He (AS) replied in writing: \"Glory be to Him who has no limit, and who cannot be described! Nothing whatsoever is like unto Him. And he is the All-Hearing, and the All-Seeing.\"",
"Hadith": 12
},
{
"Content": "13. Al-Husayn ibn Ahmad ibn Idris (may Allah have mercy on him) said, on the authority of his father, on the authority of Abu Said al-Adami, on the authority of Bishr ibn Bashshar alNaysaburi that: I wrote to Abu al-Hasan al-Naqi (AS) informing him that the people differed on the subject of Divine Unity. Some of them say \"He has a body\" while others say that \"He has an image.\" So, he (AS) wrote (back): \"Glory be to Him who has no limit, who cannot be described, and with whom nothing resembles! Nothing whatsoever is like unto Him. And He is the All-Hearing and the All-Seeing.\"",
"Hadith": 13
},
{
"Content": "14. Ahmad ibn Muhammad ibn Muhammad ibn Yahya al-Attar (may Allah have mercy on him) said: on the authority of his father, on the authority of Sahl ibn Ziyad that I wrote the following to Abu Muhammad al-Askari (AS) in the year 255 AH: O my Master! Our scholars are divided on the question of Divine Unity. Some of them say that \"He has a body,\" while others say that \"He has an image.\" O my Master! If you deem it appropriates, teach me the correct view since I do not know the answer, and be gracious to your servant. Hence, he (AS) wrote to me the following in his own handwriting: You enquired about Divine Unity. This is far from your honorable reach. Allah, the Exalted, is One, Alone, and Needless. He begets not, nor is He begotten, and none is equal unto Him. He is the Creator, and not the created. He, the Blessed and exalted, creates bodies as He wishes. He creates images as He wishes, but He is not an image. Exalted be His Praise, and Hallowed be His names. He is far above having a resemblance. There is no other than Him. Nothing whatsoever is like unto Him, and He is the All-Hearing and the All-Seeing.",
"Hadith": 14
},
{
"Content": "15. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (may Allah have mercy on him) said: Muhammad ibn al-Hasan al-Saffar said: al-Abbas ibn Maruf said, on the authority of Hammad ibn Uthman, on the authority of Abd al-Rahim al-Qasir that I wrote a letter, and sent it by hand via Abd Al-Malik ibn Ayan to Abu Abd Allah al-Sadiq (AS). In it, I asked about several issues, one of which was: \"Please inform me about Allah, the Mighty and High. Can He be described with image and lineation? If this letter reaches you, may Allah make me your ransom, write back to me with the correct vies about Divine Unity.\" So he (AS) wrote back to me, sending the letter via Abd al-Malik ibn Ayan: May Allah have mercy on you! You have enquired about Divine Unity. Allah is Greater than what your companions have ascribed. He is All-Hearing and All-Seeing, and there is nothing like unto Him. Allah is greater than the descriptions of the describers, those who describe Him inhuman terms, and those who compare Him with His creation, thus slandering Allah. Beware! May Allah have mercy on you! The correct view about Divine Unity is to be found in the attributes that Allah, the Mighty and High, revealed in the Quran. Reject anthropomorphism, and do not apply to Allah what is vain. Allah is Firmly Present. Allah is high above the descriptions of the describers. Do not exceed the Quran, as you will misled after the clear explanation has reached you.",
"Hadith": 15
},
{
"Content": "16. Ahmad ibn Muhammad ibn Yahya al-Attar (may Allah have mercy on him) said, on the authority of his father, on the authority of Sahl ibn Ziyad, on the authority of some of our scholars that I wrote to Abu al-Hasan al-Kazim (AS) asking him about the body and image of Allah, so he replied in writing: \"Glory be to Him who has nothing whatsoever like unto Him, and who is devoid of both body and image.\"",
"Hadith": 16
},
{
"Content": "17. Ahmad ibn Muhammad ibn Yahya al-Attar (may Allah be pleased with him) said, on the authority of his father, on the authority of Sahl ibn Ziyad al-Adami, on the authority of Hamzah ibn Muhammad that I wrote to Abu al-Hasan al-Kazim (AS) asking him whether Allah had a body or an image. Hence he (AS) wrote in reply: \"Glory be to Him who has nothing whatsoever like unto Him,\"",
"Hadith": 17
},
{
"Content": "18. Ali ibn Ahmad ibn Abd Allah ibn Ahmad ibn Abu Abd Allah al-Barqi (may Allah have mercy on him) said, on the authority of his father, on the authority of his grandfather Ahmad ibn Abu Abd Allah, on the authority of his father, on the authority of Abd Allah ibn Bahr, on the authority of Abu Ayyub al-Khazzaz, on the authority of Muhammad ibn Muslim that I asked Abu Jafar al-Baqir (AS) about the claim that Allah, the Mighty and High, created Adam (AS) in His Image; hence, he said: That was a recently created image. Allah favored it, and chose it over all different images. Then He attributed it to Himself like He attributed the Kabah and the Sprit to Himself. Thus, He said: My House.1 And said: And when I breathed into him My Spirit.2",
"Hadith": 18
},
{
"Content": "19. Muhammad ibn Musa ibn al-Mutawakkil (may Allah have mercy on him) said: Abd Allah ibn Jafar al-Himyari said, on the authority of Ahmad ibn Muhammad ibn Isa, on the authority alI Hasan ibn Mahbub, on the authority of Yaqub al-Sarraj that I said to Abu Abd Allah al-Sadiq (AS): \"Some of our scholars think that Allah looks like a human being, while others think that he is beardless and has curly hair.\" Abu Abd Allah (AS) fell down in prostration, then raised his head, and said: Glory be to Allah who has nothing whatsoever like unto Him! Vision cannot perceive Him, and knowledge cannot encompass Him. He begets not, because the son resembles his father, not is He begotten, so that He could resemble the one before Him. And none is like Him. Exalted is He, the High, and Mighty from such attributions!",
"Hadith": 19
},
{
"Content": "20. Muhammad ibn Musa ibn al-Mutawakkil (may Allah have mercy on him) said: Ali ibn Ibrahim ibn Hashim said, on the authority of his father, on the authority of al-Saqr ibn [Abu] Dulaf that I asked Abu al-Hasan Ali ibn Muhammad ibn Ali ibn Musa al-Rida (AS) about Divine Unity: \"Verily, I say what Hisham ibn al-Hasam said.\" So he (AS) became angry and said: What is the matter with you and Hisham? Indeed, he is not from us who thinks that Allah, the Mighty and High, has a body. We are free from such a person in this world, and in the Hereafter. O son of [Abu] Dulaf! Verily, the body is created and Allah is its Creator.",
"Hadith": 20
},
{
"Content": "1. My father (RA) that Sad ibn Abd Allah said: Ahmad ibn Muhammad ibn Khalid, on the authority of Muhammad ibn Isa, on the authority of one he mentioned, said Abu Jafar al-Baqir (AS) was asked: \"Is it permissible to say that Allah, the Might and High, is a Thing?\" He (AS) replied: \"Yes, to the extent that it removes Him from both extremes: annulment [tatil], and anthropomorphism [tashbih].\"",
"Hadith": 1
},
{
"Content": "2. My father (RA) that Ali ibn Ibrahim, on the authority of his father, on the authority of alAbbas ibn Amr, on the authority of Hisham ibn al-Hakam that > An atheist asked Abu Abd Allah al-Sadiq (AS) \"What is He?\" He (AS) replied: He is a Thing unlike other things. If you consider the meaning of the word \"thing.\" He is indeed a Thing by definition [al-shay'iyyah], with the exception that He has neither substance nor shape\"",
"Hadith": 2
},
{
"Content": "3. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan alSaffar, on the authority of Ahmad ibn Muhammad ibn Khalid, on the authority of al-Nadr ibn Suwayd, on the authority of Yahya al-Halabi, on the authority of Ibn Muskan, on the authority of Zurarah that I heard Abu Abd Allah al-Sadiq (RA) say: \"Verily, Allah, the Blessed and Exalted, is free from His Creation, and His Creation is free from Him. Whatever can be defined by the word thing' is a creation other than Almighty Allah. Exalted is He who is beyond compare.\"",
"Hadith": 3
},
{
"Content": "4. Hamzah ibn Muhammad al-Alawi (RA) said: Ali ibn Ibrahim on the authority of his father, on the authority of Ibn Abu Umayr, on the authority of Ali ibn Atiyyah, on the authority of Khaythamah that Abu Jafar al-Basir (AS) said: Verily, Allah, Blessed and Exalted be He, is free from His Creation, and His Creation is free from Him. Whatever can be defined by the word \"thing\" is a creation other than Allah, the Mighty and High. Allah, the Exalted, is the Creator of all things.",
"Hadith": 4
},
{
"Content": "5. Muhammad ibn Ali Majilwayh (RA) said: Ali ibn Ibrahim ibn Hashim, on the authority of Muhammad ibn Isa, on the authority of Yunus ibn Abd al-Rahman, on the authority of Abu alMaghra, who eliminated the source of report from Abu Jafar, and said: Al-Baqir (AS) said: \"Verily, Allah, Blessed and Exalted be He, is free from His Creation, and His Creation is free from Him. Whatever can be defined by the word \"thing\" is a creation other than Allah, the Mighty and High.\"",
"Hadith": 5
},
{
"Content": "6. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan alSaffar, on the authority of Muhammad ibn Isa ibn Ubayd, on the authority of Abd al-Rahman ibn Abu Najran that I asked Abu Jafar the Second (AS) about Divine Unity [Tawhid], so I said: \"Is He presumed to be a thing?\" Consequently, he (AS) replied: Yes. However, since He is Incomprehensible, and Unlimited, He is unlike anything you can conceive. Nothing resembles Him. Imagination perceives Him not. And how could imagination perceive Him when He is beyond all imagination? He is an Imagined Thing which is Incomprehensible and Unlimited.",
"Hadith": 6
},
{
"Content": "7. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Abu Abd Allah al-Kufi said: Muhammad ibn Ismail al-Barmaki said: on the authority of al-Husayn ibn alHasan, on the authority of Bakr ibn Salih, on the authority of al-Husayn ibn Said that Abu Jafar the Second (Imam Muhammad al-Taqi (AS) was asked: \"Is it permissible to say that Allah is a Thing?\" Hence, he (AS) answered: \"Yes, to the extent that it removes Him from the two extremes: annulment [tatil] and anthropomorphism [tashbih].\"",
"Hadith": 7
},
{
"Content": "8. Jafar ibn Muhammad ibn Masrur (RA) said: Muhammad ibn Jafar ibn Buttah said: some of our scholars, on the authority of Muhammad ibn Isa related to me that Abu al-Hasan al-Rida (AS) said to me: \"What would you say if you were asked: Tell us, is Allah, the Mighty and High, a Thing or is He not a thing?\" He said: I said to him (AS): Allah, the Mighty and High, has acknowledged that He is a Thing when he said: Say: What thing is the weightiest in testimony? Say: Allah is a witness between you and me.1 I would say: He is a Thing unlike other things, as negating that He is a Thing would negate Him and deny Him.",
"Hadith": 8
},
{
"Content": "1. Muhammad ibn Musa ibn al-Mutawakkil (may Allah have mercy on him) said: Ali ibn Ibrahim ibn Hashim said on the authority of his father, on the authority of al-Nawfali, on the authority of al-Sakuni, on the authority of Abu Abd Allah, on the authority of his forefathers (AS) that The Prophet (SA) passed by a man who was supplication with his eyes raised to the sky. The Messenger of Allah (SA) said to him: \"Cast down your eyes for you will certainly not see Him.\" He (SA) also said that: \"The Prophet (SA) passed by a man who was supplicating with his hands raised to the sky. The Messenger of Allah (SA) said to him: Lower your hand for your will surely not reach Him.'",
"Hadith": 1
},
{
"Content": "2. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (may Allah have mercy on him) said: Muhammad ibn Abu Abd Allah al-Kufi said on the authority of Ali ibn Abu al-Qasim, on the authority of Yaqub ibn Ishaq that I wrote to Abu Muhammad al-Askari (AS) asking him how a servant could serve a Lord he cannot see? Hence, he (AS) replied in writing: \"O Abu Yusuf! My Master, my Lord, and the Benefactor upon me any my forefathers, is far above being seen.\" He said: \"I also asked whether the Messenger of Allah (SA) saw him Lord?\" He wrote back: \"Verily, Allah, the Blessed and Exalted, manifested to the Messenger what He desired from the Light of His Magnitude.\"",
"Hadith": 2
},
{
"Content": "3. Al-Husayn ibn Ahmad ibn Idris (RA) said on the authority of his father, on the authority of Muhammad ibn Abd al-Jabbar, on the authority of Safwan ibn Yahya, on the authority of Asim ibn Humayd that I consulted Abu Abd Allah al-Sadiq (AS) regarding what is narrated about the vision of Allah. Hence, he (AS) explained: The sun is a seventieth portion of the light of the Throne [al-kursi]. The throne is a seventieth portion of the light of the Empyrean [arsh]. The Empyrean is a seventieth portion of the light of the Veil [hijab]. And the Veil is a seventieth portion of the Veil of Light [sitr]. Hence, if they speak the truth, can their eyes bear the sight of the sun on a cloudless day?",
"Hadith": 3
},
{
"Content": "4. My father (RA) said: Muhammad ibn Yahya al-Attar said on the authority of Ahmad ibn Muhammad ibn Isa that Ibn Abu Nasr said on the authority of Abu al-Hasan (Ali) al-Rida (AS) that The Messenger of Allah said: \"When I was taken to heaven during the Night Journey, Jibrail took to me to a place where he had never stopped before. Hence, the Veil was remove for me and Allah, the Mighty and High, showed me what He desired from the Light of His Magnitude.\"",
"Hadith": 4
},
{
"Content": "5. My Father (RA) said: Ali ibn Ibrahim ibn Hashimsaid on the authority of his father, on the authority of Ali ibn Mabad, on the authority of Abd Allah ibn Sinan, on the authority of his father that I was in the presence of Abu Jafar al-Baqir (AS) when a Kharijite entered his presence and asked him: \"O Abu Jafar, who do you serve?\" He (AS) replied: \"Allah?\" He questioned: \"Have you seen Him?\" He (AS) answered: Eyes cannot see him through vision, but hearts can see Him through certainty of faith. He is neither recognized with analogy, nor perceived with the senses, and cannot be compared to people. He is attributed through signs and recognized through indications. There is no oppression in His Judgement. Such is Allah; there is no god but Him. He said: \"Then the man left while saying that Allah knows best where to place His Message.\"",
"Hadith": 5
},
{
"Content": "6. My father said: Sad ibn Abd Allah said: Ahmad ibn Muhammad ibn Abu Nasr on the authority of Abu al-Hasan al-Mausili, on the authority of Abu abd Allah that A rabbi came to the Commander of the Faithful (AS) and asked: \"O Commander of Faithful! Do you see your Lord when you serve Him?\" Thus, he (AS) replied: \"Woe unto you! I do not serve a Lord that I cannot see.\" The rabbi asked: \"How do you see Him?\" He (AS) responded: \"Woe unto you! The eyes do not perceive Him through vision but the hearts see Him through certainty of faith.\"",
"Hadith": 6
},
{
"Content": "7. Al-Husayn ibn Ahmad ibn Idris (RA) said on the authority of his father, on the authority of Ahmad ibn Ishaq that I wrote to Abu al-Hasan the third (al-Naqi) (AS) asking about the vision of (Allah) and what people say about it. Hence, he wrote: Vision is only possible so long so there is no obstacle between the seer and the seen. So, when there is an obstacle to vision, or lack of light between the seer and the seen, vision is impeded or inaccurate. Fault necessitates when the seer equals the seen in the cause that is required between them for vision. When it comes to vision, we can speak in anthropomorphic terms due to cause and effect.",
"Hadith": 7
},
{
"Content": "8. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Yaqub said: Ahmad ibn Idris said on the authority of Ahmad Muhammad ibn Isa, on the authority of Ali ibn Sayf, on the authority of Muhammad ibn Ubaydah that I wrote to Abu al-Hasan (Ali) al-Rida (AS) asking him about the vision of Allah and what that Sunnis and the Shiites narrate regarding the subject. I asked him to explain the subject in detail to me. Hence, he (AS) wrote in his own handwriting: All agree unanimously that Allah's recognition is necessary. So, if it is possible to see Allah, the Mighty and High, with the eyes, then recognition has taken place. And this recognition could take place with or without faith. If recognition via vision is faith, then it is not faith, because faith is the opposite of visual recognition. If recognition via vision is faith, then there would be no people of faith in the world since nobody has seen Allah, Exalted is His Remembrance. If faith is based on visual recognition, then it might vanish as a result of death and resurrection. This is sufficient proof that Allah, noble be His Remembrance, cannot be seen by the eye....",
"Hadith": 8
},
{
"Content": "9. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Yaqub al-Kulayni said on the authority of Ahmad ibn Idris, on the authority of Muhammad ibn Abd al-Jabbar, on the authority of Safwan ibn Yahya that Abu Qurrah, the traditionist, asked me to take him to Abu al-Hasan (Ali) al-Rida (AS); therefore, I asked for his permission to visit him, and he granted it to me. So, he (Abu Qurrah) went to him, and asked him about the laws regarding the permissible and the forbidden, until he reached the subject of Divine Unity. Hence, Abu Qurrah said: \"It has been transmitted to us that Allah, the Mighty and High, divided vision and speech between two prophets; allocating speech to Musa (AS) and allocating vision for Muhammad (SA).\" Consequently, Abu al-Hasan (AS) replied: Who is it that brought the revelation from Allah, the Mighty and High, to both jinn and humankind? Vision comprehends Him not, and He comprehends (all) vision.1 And they do not comprehend Him in knowledge.2 Nothing whatsoever is like unto Him.3 Was it not Muhammad He said: \"Of course?\" If that is the case, then how could he come to all of creation, saying that he was sent by Allah, call them by His Command, that vision comprehend Him not, and He comprehend all vision. And they do not comprehend Him in Knowledge. Nothing whatsoever is like unto Him, and then claim that \"I have seen Him with my own eyes. I comprehend Him, and He has a human form.\" Are people not ashamed of saying such things? The unbelievers can use this against us: claiming that Allah revealed one thing and the Prophet contradicted it! Abu Qurrah enquired: \"Then He says: And certainly he saw Him in another descent.3\" Hence, Abu al-Hasan (AS) replied: Verily, the verse after this verse stipulates what he saw, as He says, The heart was not untrue in (making him see) what he saw.4 He is saying that the heart of Muhammad (SA) was not untrue in what his eyes saw. Then He informs of what he saw and says: Certainly he saw of the greatest signs of his Lord.5 Thus, the signs of Allah, the Mighty and High, are other than Allah. As He has said: And they do not comprehend Him in knowledge. So, if the eyes saw Him, then they comprehended Him in knowledge, and recognition had taken place. Abu Qurrah enquired: \"Do you claim that the prophetic traditions are false?\" Abu al-Hasan (AS) responded: \"Any prophetic traditions which contradict the Quran are false. According to the consensus of all Muslims, He cannot be comprehended in knowledge, vision comprehends Him not, and nothing whatsoever is like unto Him.\"",
"Hadith": 9
},
{
"Content": "10. My father (RA) said: Muhammad ibn Yahya al-Attar said on the authority of Ahmad ibn Muhammad ibn Isa, on the authority of Ibn Abu Najran, on the authority of Abd Allah ibn Sinan that Abu Abd Allah al-Sadiq (AS) was asked to interpret the Word of the Mighty and High: Vision comprehends Him not, and He comprehends (all) vision. He explained: It is the comprehension of the imagination. Do you not see His Word: Verily, there have come to you clear proofs from your Lord. This does not mean the vision of eyes; however, whoever will see, it is for his own soul. And whoever will be blind, it shall be against himself.1 This does not mean blindness of the eyes. It certainly means comprehension of the imagination, like it is said: so and so has the vision of poetry, so and so has the vision of jurisprudence, so and so has the vision of coins, and so and so has the vision of clothes. Allah is far above visual perception.",
"Hadith": 10
},
{
"Content": "11. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan alSaffar said: Ahmad ibn Muhammad said on the authority of Abu Hashim al-Jafari, on the authority of Abu al-Hasan (Ali) al-Rida (AS) that I asked him whether it is possible to describe Allah, the Mighty and High. Hence, he replied: \"Do you not read the Quran?\" I responded: \"What do you mean?\" He said: \"Do you not read the Word of the Mighty and High: Vision comprehends Him not, and He comprehends (all) vision.2 I answered: \"So?\" He (AS) asked: \"Then do you know what vision means?\" I replied: \"Sure\" He (AS) said: \"What is t?\" I said: \"The vision of the eyes.\" Hence, he (AS) explained: \"Verily, the imagination of the mind is greater than the vision of the eyes. Thus, imagination comprehends Him not, and He comprehends all imagination.\"",
"Hadith": 11
},
{
"Content": "12. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Abu Abd Allah al-Kufi said on the authority of who he mentioned, on the authority of Muhammad ibn Isa, on the authority of Dawud ibn al-Qasim on the authority of Abu Hashim al-Jafari that I asked Abu Jafar ibn al-Rida (AS): \"Vision comprehends Him not, and He comprehends (all) vision. He (AS) replied: O Abu Hashim! The imagination of mind is more precise than the vision of the eyes. You may imagine Sind, India, the towns which you have not visited, and which you have not seen with your eyes. Thus, if imagination cannot comprehend Him, how can the eyes?\"",
"Hadith": 12
},
{
"Content": "13. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Abu Abd Allah al-Kufi said: Muhammad ibn Ismail al-Barmaki said: al-Husayn ibn al-Hasan said: Bakr ibn Salih said on the authority of al-Husayn ibn Said, on the authority of Ibrahim ibn Muhammad al-Khazzaz and Muhammad ibn al-Husayn both said      2  . We entered into the presence of Abu al-Hasan (Ali) al-Rida (AS). We related to him what was transmitted regarding Muhammad (SA); namely, that he saw His Lord in the form of a vigorous young man of thirty years of age, whose feet wee covered in greenery. I also explained to him that Hisham ibn Salim, Sahib al-Taqi and al-Maythami say that Allah's belly is hollow and the rest (of His body) is solid. Hence, he (AS) fell in prostration and then said: May You be Glorified! They have not recognized You, nor have they testified to Your Unity. As a result, they have described You as such. May You be glorified! Had they recognized You, they would have only described You by means of the attributes with which You have described yourself. May You be glorified! They have certainly wronged themselves by describing You with what is not worthy of You. O my God, I only describe You with the attributes with which You have described yourself, and I do not compare You with Your Creation. You are worthy of all good. Do not count me among the oppressors. Then he (AS) turned his face to us and said: \"Whatever you have imagined, imagine Allah as other than that.\" He (AS) then added: We, the Household of Muhammad (SA), are the middle way [al-Namat al-Awsat] which the exaggerator [ghali] cannot comprehend, and the neglectful follower does not reach. O Muhammad! Verily, when the Messenger of Allah (SA) looked at the grandeur of His Lord, he, the Messenger, was in a form of a vigorous young man of thirty years of age. O Muhammad! MY Lord is far above possessing the attributes of the created. He says, I asked him (AS): `May I be your ransom! Whose feet were covered in green?\" He (AS) replied: That refers to Muhammad (SA). When looked at his Lord by means of his heat, Allah covered him in the Light of His Veil until it was apparent to him what was behind the veil. Verily, the Light of Allah is green, red, and white, as well as other colors. O Muhammad, we only accept what agrees with the Book (Quran), and the Sunnah (traditions of the Prophet).",
"Hadith": 13
},
{
"Content": "14. Muhammad ibn Muhammad ibn Isam al-Kulayni (RA) said: Muhammad ibn Yaqub al-Kulayni said on the authority of Ali ibn Muhammad, on the authority of Sahl ibn Ziyad and others, on the authority of Muhammad ibn Sulayman, on the authority of Ali ibn Ibrahim al-Jafari, on the authority of Abd Allah ibn Sinan, that Abu Abd Allah al-Sadiq (AS) said: Verily, Allah is the Most Great, and the Lofty [al-rafi]. Worshippers cannot describe Him, nor can they reach the core of His Magnificence. Vision comprehends Him not, and He comprehends (all) vision; and He is the Subtle, the All-Aware. He cannot be described in terms of how,' where' and when'. And how can I describe him by means of how' when it is He who created the condition for the question how;' hence, I recognized the condition by the fact that He created the how.' And how can I describe Him in terms of where' when it was He was created space; hence, I recognized space by the fact that he created the where.' And how can I describe him in terms of when' when it was he who created time; hence, I recognized time by the fact that He created time. Thus, Allah, the Blessed and Exalted, is present in every place, and is absent from everything. Vision comprehends Him not, and He comprehends all vision. There is no god but He: the Most High, the Great. And He is the Knower of subtleties, the Aware.",
"Hadith": 14
},
{
"Content": "15. My father (RA) said: Sad ibn Abd Allah said on the authority of Ibrahim ibn Hashim, on the authority of the Ibn Abu Najran, on the authority of Muhammad ibn Sinan, on the authority of Ibrahim and al-Fadl sons fo Muhammad al-Ashariyyayn, on the authority of Ubayd ibn Zurarah, on the authority of his father that I asked Abu Abd Allah al-Sadiq (AS): \"May I be your ransom! What use to make the Messenger of Allah (SA) swoon when he received the revelation?\" He (AS) answered: \"That happened when there was nothing separating him from Allah. That happened when Allah manifested Himself to him.\" He says that he (AS) then added: \"Such is Prophethood, O Zurarah! Accept it with humility.\"",
"Hadith": 15
},
{
"Content": "16. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Ibrahim ibn Hashim said on the authority of Ibn Abu Umayr, on the authority of Murazim, that Abu Abd Allah al-Sadiq (AS) said: \"The Messenger of Allah saw his Lord, the Mighty and High, by means of his heart.\" The confirmation of this is found in the following tradition.",
"Hadith": 16
},
{
"Content": "17. What Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan al-Saffar said on the authority of Muhammad ibn al-Husayn ibn Abu al-Khattab, on the authority of Muhammad ibn al-Fudayl that I asked Abu al-Hasan al-Kazim (AS): \"Did the Messenger of Allah (SA) see his Lord, the Mighty and High?\" Hence, he (AS) replied: \"Yes, he saw Him by means of his heart. Have you not heard Allah, the Might and High that the heart was not untrue in (making him see) what he saw.1 That is to say, he did not see Him with his eyes, but he saw Him with the heart.\"",
"Hadith": 17
},
{
"Content": "18. My father (RA) said: Sad ibn Abd Allah said on the authority of al-Qasim ibn Muhammad alIsfahani, on the authority of Sulayman ibn Dawud al-Minqari, on the authority of Hafs ibn Ghiyath or someone else that I asked Abu Abd Allah al-Sadiq (AS) about the Word of Allah, the Mighty and High: Certainly, he saw of the greatest signs of his Lord.2 He (AS) replied: \"He saw Jibrail (AS). His thighs were covered in pearls like dew drops on plants. He had six hundred wings. He filled the space between the sky and the Earth.\"",
"Hadith": 18
},
{
"Content": "19. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Yaqub al-Kulayni said on the authority of Ahmad ibn Idris, on the authority of Muhammad ibn Abd al-Jabbar, on the authority of Safwan ibn Yahya that I met him1 (AS) on my return from Mecca to Khurasan and he was going to Iraq. I heard him say that \"Whoever fears Allah is feared, and whoever obeys Allah is obeyed.\" So I politely went over to him and greeted him. Hence, he (AS) returned my greetings and then added: O Fath, he who pleases the Creator does not consider the displeasure of the creation. And he who displeases the Creator deserves that that displeasure of creation overpowers him. Verily, the Creator can only be described by means of the attributes He has given Himself. And how could He be described when he made the senses incapable of conceiving Him, the concepts incapable of describing Him, and the eyes incapable of perceiving Him? He is far above the attributes of the attributers and the descriptions of the describers. He is distant in His Closeness and close in His Distance. Thus, He is near in His Farness and Far in His Nearness. Since He created conditions, the question how' cannot apply to Him. He ionized space; therefore, the question where' cannot apply to Him. IN doing so He is the Inventor [Mubdi'] of conditions and space. O Fath! Everybody is nourished with food except the Creator, the Sustainer. Verily, He created bodies, yet He has neither body nor image. He does not have parts, not does He have an end. He does not increase or decrease. He is not composed of any substance that would be found in a body. He is the Subtle, the All-Knowing, the All-Listening, and the All-Hearing. He is the One, the Unique, and the Needless. He begets not, nor is He begotten, and there is nothing equal unto Him. He is the Producer of All things. He gave shape to all bodies and made all images. IF it were as the anthropomorphist say, then the Creator could not be distinguished from the created, the Sustainer from the sustained, or the Originator from the originated. However, He is the Producer. He differs from created bodies, images and things in that He resembles nothing. I asked: \"if Allah is One and humankind is one, do they not resemble each other in oneness?\" Hence, he (AS) replied: You have said something impossible. May Allah secure you! Verily, the resemblance is limited to meaning. Names are one, and they indicate what is named. When it is said that the human being is one, it means that he is one as opposed to two. But, in fact, the human being is not truly one because his body parts are different and his colors are different. He is composed of many parts which are not the same. His blood is other than his flesh. His flesh is other than his blood. His nerves are other than his veins. His hair is other than his skin. His darkness is other than his paleness. Likewise is the rest of creation. Thus, the human being in only \"one\" in name but not \"one\" in meaning. Allah, Exalted be His Majesty, is One and there is none other than Him. There is no variation, contrast, increase, or decrease in Him. As for the human being, he is created from different parts and different substances. He is only \"one\" in combination. I enquired: As for your statement regarding \"the Subtle,\" kindly explain it to me, I know, of course, that His Subtlety differs from that of others. However, I would appreciate it if you could explain it to me in greater detail. Therefore, he (AS) answered: O Fath! I said: He is Subtle in subtleness of His Creation and in His Knowledge of microscopic matter. Do you not see His Stamp on the various types of plants, both soft and rough? And do you not contemplate the subtle creation of creatures like the gnat and the mosquito and those insects which are even smaller than these two and are almost invisible to the naked eye? In fact, they are almost invisible due to their tiny size, making it virtually impossible to differentiate the male from the female, and the young from the old. Thus, when we see the smallness of creatures in their refinement, their instinct to reproduce, and their fear of death; when we see the creatures that exist in the depths of the oceans, and in the branches of trees; when we see what exists in deserts and wastelands, and that each species has a means of communication through which they are understood by their offspring; when we see how creatures feed their offspring, and how creatures are distinguished by color, red with yellow, and white with red; then, and only then do we come to appreciate the subtlety of the Creator. Verily, everything has a precursor. Allah, the Creator, the Subtle, and the Sublime created everything out of nothing. I asked: \"May I be your ransom! Is there a creator other than the Sublime Creator?\" He (AS) replied: Verily, Allah, the Blessed and High says: Blessed be Allah, the best of creators.1 He has certainly acknowledged that there are creators among His Servants, including Jesus, the son of Mary [Isa ibn Maryam] (AS). He created from clay a figure of a bird by the will of Allah. Then he breathed into it, and it became a bird, by the will of Allah. And Samiri made for them the body of a calf that mooed.",
"Hadith": 19
},
{
"Content": "20. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Abu Abd Allah al-Kufi said: Muhammad ibn Ismail al-Barmaki said: al-Husayn ibn al-Hasan said: Bakr ibn Salih said on the authority of al-Husayn ibn Said, on the authority of Ibrahim ibn al-Hakam ibn Zuhayr, on the authority of Abd Allah ibn Jarir al- Abdi that     2  . All praise is for Allah who is neither sense, nor felt, nor touched, and who cannot be perceived with the five senses. He cannot be imagined. He cannot be described by tongues. Everything that can be sensed is created. And Allah is the Most High. Wherever He is searched He is found. All praise is for Allah who was before the ward was' (was created). The word was' was not there to describe Him. In fact, He was the First Being. No creator has made Him. Exalted be His Praise! Rather, He created things before they existed; therefore, they were as He made them. He knows what has existed, and what will exist. He was there when nothing was there, and when nothing could be heard. Thus, He existed when there was no existence.",
"Hadith": 20
},
{
"Content": "1. My father (RA) that Sad ibn Abd Allah said: Ahmad ibn Muhammad ibn Isa, on the authority of Muhammad ibn Isa, on the authority of Yunus ibn Abd al-Rahman, on Muhammad ibn Hukaym reported that I described the statement of Hisham al-Jawaliqi, and what he says about a fortunate young man, and described to him the word of Hisham ibn al-Hakam. He (AS):\" Verily, nothing resembles Allah, the Mighty and High.",
"Hadith": 1
},
{
"Content": "2. ~Ali ibn ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Yaqub said: Ali ibn Muhammad, who eliminated the source of report, on the authority of Muhammad ibn al-Faraj al-Rukhkhaji that I wrote to Abu al-Hasan al-Kazim (AS) asking hm about what Hisham ibn al-Hakam said about the body of Allah, and what Hisham ibn Salim had said about the image of Allah. So he (AS) replied to me: \"Leave the confusion of the baffled, and take refuge in Allah from Satan. Things are not as the two Hishams claim.\"",
"Hadith": 2
},
{
"Content": "3. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan alSaffar, on the authority of Sahl ibn Ziyad, on the authority of Hamzah ibn Muhammad that I wrote to Abu al-Hasan al-Kazim (AS) asking him about the substance and the shape of Allah; therefore, he (AS) wrote to me: \"Glory to the One who has none like Him, ad who is devoid of both body and image.\"",
"Hadith": 3
},
{
"Content": "4. My father (RA) that Ahmad ibn Idris said: Muhammad ibn Abd al-Jabbar, on the authority of Safwan ibn Yahya, on the authority of Ali ibn Abu Hamzah that  U         m    I said to Abu Abd Allah al-Sadiq (AS): I heard Hisham ibn al-Hakam narrating from you that Allah, the Mighty and High, has a Needless body of Light; His Recognition is necessary, and He grants it to whoever He desires from His Creation. He (AS) said: Glory to Him who is known only to Himself! There is none like Him, and He is the All-Hearing and the Al-Seeing. He cannot be confined, sensed, touched, or felt. The senses perceive Him not, and nothing can comprehend Him. He does not have a body or an image, nor lineation or delineation.",
"Hadith": 4
},
{
"Content": "5. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan alSaffar, on the authority of Sahl ibn Ziyad, on the authority of Muhammad ibn Ismail ibn Bazi, on the authority of Muhammad ibn Zayd that I came to (Ali) al-Rida (AS) asking him about Divine Unity, so he (AS) dictated to me: All praise be to Allah, the Originator, Producer, and Innovator [Mubtadi] of all things from the beginning by His Power and Wisdom, not from anything that could invalidate His Invention, nor for nay wrong cause. He created whatever He wanted how He wanted, and He did so independently in order to manifest His Wisdom, and the Reality of His Lordship. Intellects cannot grasp Him. Imagination cannot reach Him. Eyes cannot perceive Him, and scale cannot encompass Him. Speech is incapable without Him. Eyes are expressionless without Him, and rhetoric of description goes astray in Him. He is hidden without a veil and is covered without a covering. He is recognized without seeing. He is described without an image. And He is praised despite the face that He does not possess a body. There is no god but Allah, the great, the Most Exalted.\"",
"Hadith": 5
},
{
"Content": "6. Ali ibn Ahmad ibn Abd Allah ibn Ahmad ibn Abu Abd Allah al-Barqi said, on the authority of his father, on the authority of his grandfather Ahmad ibn Abu Abd Allah, on the authority of Ahmad ibn Muhammad ibn Abu Nasr, on the authority of Muhammad ibn Hukaym that I described the statement of Hisham al-Jawaliqi, and narrated for Musa al-Kazim (AS) the statement of Hisham ibn al-Hakam that He possesses a body. Hence, he (AS) said: \"Verily, nothing resembles Allah. Indecent language is better than words which give the Creator a created body or image composed of parts. Exalted from these, the High, the Great.\"",
"Hadith": 6
},
{
"Content": "7. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (may Allah be pleased with them) said: Muhammad ibn Abu Abd Allah al-Kufi said: Muhammad ibn Ismail al-Barmaki said: on the authority of al-Husan ibn al-Hasan, and al-Husayn ibn Ali, on the authority of Salih ibn Abu Hammad, on the authority of Bakr ibn Salih, on the authority of Muhammad ibn al-Husayn ibn Said, on the authority of Abd Allah in al-Mughayrah, on the authority of Muhammad ibn Ziyad said: I heard Yunus ibn Zabyan say      m   I entered in the presence of Abu Abd Allah al-Sadiq (AS) and told him: Hisham ibn al-Hakam made a long statement. I will simply summarize it: He considers Allah to be a body because things are of two types: bodies or actions of bodies. Hence, if it is not possible for the creator to be an action, it is only possible that He be a Doer. Then Abu Abd Allah (AS) replied: \"Woe to him! Does he not know that a body is extremely limited, and an image is absolutely limited? Hence, if a limit is possible then increase and decrease are possible, and if increase and decrease are possible, then He is created. I asked: \"Then what should I say? He answered: He has neither body nor image for He is the creator of bodies and images. He is devoid of parts and limits. He does not increase, nor does He decrease. If He were as he (Hisham) says then there would be no difference between the Creator and the created, or between the Inventor and the invented. However, He is the Inventor. The Creator of Bodies and Images does not resemble anything nor does anything resemble Him.",
"Hadith": 7
},
{
"Content": "8. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (may Allah be pleased with him) said: Muhammad ibn Abu Abd Allah al-Kufi said: on the authority of Muhammad ibn Ismail alBarmaki, on the authority of al-Hasan ibn Abd al-Rahman al-Hammani that  3 I said to Abu al-Hasan Musa ibn Jafar (AS): Hisham ibn al-Hakam thinks that Allah is a body. There is nothing whatsoever like unto Him, the All-knowing, the All-Hearing, the All-Seeing, the Omnipotent, the Speaker, and the Communicator. Speech, Omnipotence, and Knowledge flow from the One Same Source, None of these things are created. So he (AS) said: May Allah kill him! Does he not know that a body is limited, and that speech is other than the speaker? Allah forbid, I am free from such words. He is devoid of both body and image. He has not limits, and everything other than Him is created. Verily, everything that exists is the result of His Will and Intent which is expressed without words, the use of the tongue, or any reluctance or hesitation.",
"Hadith": 8
},
{
"Content": "9. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (may Allah have mercy on him) said: on the authority of Muhammad ibn Yaqub al-Kulayni, on the authority of Ali ibn Muhammad, on the authority of Sahl ibn Ziyad, on the authority of Ibrahim ibn Muhammad al-Hamdani that I wrote to Abu al-Hasan al-Naqi (AS), informing him that some of his following have differences on the subject of Divine Unity. Some of them say that He has a body, while others say that He has an image. So He (AS) wrote to me the following in his own handwriting: \"Glory be to Him who has no limit and who cannot be described! There is nothing whatsoever like unto Him. And He is the All-Hearing, the All-Knowing.\" He (AS) may have said: \"the All-Seeing.\"",
"Hadith": 9
},
{
"Content": "10. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (may Allah be pleased with him) said: Muhammad ibn Yahya al-Attar said: Muhammad ibn Ahmad said: Muhammad ibn Isa said, on the authority of Hisham ibn Ibrahim who said: al-Abbasi said I said to him (AS), meaning Abu alhasan al-Rida (AS): \"May I be your ransom! One of your followers told me to ask you a question about something.\" He (AS) said: \"And who would that be?\" I said: \"Al-Hasan ibn Sahl.\" He (AS) asked: \"What is the issue about?' I replied: \"It is about Divine Unity.\" He (AS) said: \"What about Divine Unity?\" I said: \"He wants to know whether Allah possesses a body or not?\" He (AS) answered me: There are three positions regarding Divine Unity. The first group attempts to describe Him through anthropomorphism. The second group attempts to describe Him through negation. And the third group attempts to describe Him without falling into anthropomorphism. Describing Him through anthropomorphism is not allowed, and describing Him through negation is not allowed. The correct position is attempting to describe him without falling into anthropomorphism.",
"Hadith": 10
},
{
"Content": "11. Muhammad ibn Ali Majilwayh (may Allah have mercy on him) said: Muhammad ibn Yahya al-Attar said: Muhammad ibn Ahmad said: on the authority of Imran ibn Musa, on the authority of al-Hasan ibn al-Abba ibn Huraysh al-Razi, on the authority of some of our scholars that The purified [Tayyib], Ali ibn Muhammad, and Abu Jafar al-Jawad (AS) both said: \"He who claims that Allah has a body, do not give him the poor-rate, and do not pray behind him.\"",
"Hadith": 11
},
{
"Content": "12. Muhammad ibn Musa ibn al-Mutawakkil (may Allah have mercy on him) said: Muhammad ibn Yahya al-Attar said: on the authority of Sahl ibn Ziyad, on the authority of Muhammad ibn Ali al-Qasani who said I wrote to him (AS) informing him that some of the people here differed on the subject of Divine Unity. He (AS) replied in writing: \"Glory be to Him who has no limit, and who cannot be described! Nothing whatsoever is like unto Him. And he is the All-Hearing, and the All-Seeing.\"",
"Hadith": 12
},
{
"Content": "13. Al-Husayn ibn Ahmad ibn Idris (may Allah have mercy on him) said, on the authority of his father, on the authority of Abu Said al-Adami, on the authority of Bishr ibn Bashshar alNaysaburi that: I wrote to Abu al-Hasan al-Naqi (AS) informing him that the people differed on the subject of Divine Unity. Some of them say \"He has a body\" while others say that \"He has an image.\" So, he (AS) wrote (back): \"Glory be to Him who has no limit, who cannot be described, and with whom nothing resembles! Nothing whatsoever is like unto Him. And He is the All-Hearing and the All-Seeing.\"",
"Hadith": 13
},
{
"Content": "14. Ahmad ibn Muhammad ibn Muhammad ibn Yahya al-Attar (may Allah have mercy on him) said: on the authority of his father, on the authority of Sahl ibn Ziyad that I wrote the following to Abu Muhammad al-Askari (AS) in the year 255 AH: O my Master! Our scholars are divided on the question of Divine Unity. Some of them say that \"He has a body,\" while others say that \"He has an image.\" O my Master! If you deem it appropriates, teach me the correct view since I do not know the answer, and be gracious to your servant. Hence, he (AS) wrote to me the following in his own handwriting: You enquired about Divine Unity. This is far from your honorable reach. Allah, the Exalted, is One, Alone, and Needless. He begets not, nor is He begotten, and none is equal unto Him. He is the Creator, and not the created. He, the Blessed and exalted, creates bodies as He wishes. He creates images as He wishes, but He is not an image. Exalted be His Praise, and Hallowed be His names. He is far above having a resemblance. There is no other than Him. Nothing whatsoever is like unto Him, and He is the All-Hearing and the All-Seeing.",
"Hadith": 14
},
{
"Content": "15. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (may Allah have mercy on him) said: Muhammad ibn al-Hasan al-Saffar said: al-Abbas ibn Maruf said, on the authority of Hammad ibn Uthman, on the authority of Abd al-Rahim al-Qasir that I wrote a letter, and sent it by hand via Abd Al-Malik ibn Ayan to Abu Abd Allah al-Sadiq (AS). In it, I asked about several issues, one of which was: \"Please inform me about Allah, the Mighty and High. Can He be described with image and lineation? If this letter reaches you, may Allah make me your ransom, write back to me with the correct vies about Divine Unity.\" So he (AS) wrote back to me, sending the letter via Abd al-Malik ibn Ayan: May Allah have mercy on you! You have enquired about Divine Unity. Allah is Greater than what your companions have ascribed. He is All-Hearing and All-Seeing, and there is nothing like unto Him. Allah is greater than the descriptions of the describers, those who describe Him inhuman terms, and those who compare Him with His creation, thus slandering Allah. Beware! May Allah have mercy on you! The correct view about Divine Unity is to be found in the attributes that Allah, the Mighty and High, revealed in the Quran. Reject anthropomorphism, and do not apply to Allah what is vain. Allah is Firmly Present. Allah is high above the descriptions of the describers. Do not exceed the Quran, as you will misled after the clear explanation has reached you.",
"Hadith": 15
},
{
"Content": "16. Ahmad ibn Muhammad ibn Yahya al-Attar (may Allah have mercy on him) said, on the authority of his father, on the authority of Sahl ibn Ziyad, on the authority of some of our scholars that I wrote to Abu al-Hasan al-Kazim (AS) asking him about the body and image of Allah, so he replied in writing: \"Glory be to Him who has nothing whatsoever like unto Him, and who is devoid of both body and image.\"",
"Hadith": 16
},
{
"Content": "17. Ahmad ibn Muhammad ibn Yahya al-Attar (may Allah be pleased with him) said, on the authority of his father, on the authority of Sahl ibn Ziyad al-Adami, on the authority of Hamzah ibn Muhammad that I wrote to Abu al-Hasan al-Kazim (AS) asking him whether Allah had a body or an image. Hence he (AS) wrote in reply: \"Glory be to Him who has nothing whatsoever like unto Him,\"",
"Hadith": 17
},
{
"Content": "18. Ali ibn Ahmad ibn Abd Allah ibn Ahmad ibn Abu Abd Allah al-Barqi (may Allah have mercy on him) said, on the authority of his father, on the authority of his grandfather Ahmad ibn Abu Abd Allah, on the authority of his father, on the authority of Abd Allah ibn Bahr, on the authority of Abu Ayyub al-Khazzaz, on the authority of Muhammad ibn Muslim that I asked Abu Jafar al-Baqir (AS) about the claim that Allah, the Mighty and High, created Adam (AS) in His Image; hence, he said: That was a recently created image. Allah favored it, and chose it over all different images. Then He attributed it to Himself like He attributed the Kabah and the Sprit to Himself. Thus, He said: My House.1 And said: And when I breathed into him My Spirit.2",
"Hadith": 18
},
{
"Content": "19. Muhammad ibn Musa ibn al-Mutawakkil (may Allah have mercy on him) said: Abd Allah ibn Jafar al-Himyari said, on the authority of Ahmad ibn Muhammad ibn Isa, on the authority alI Hasan ibn Mahbub, on the authority of Yaqub al-Sarraj that I said to Abu Abd Allah al-Sadiq (AS): \"Some of our scholars think that Allah looks like a human being, while others think that he is beardless and has curly hair.\" Abu Abd Allah (AS) fell down in prostration, then raised his head, and said: Glory be to Allah who has nothing whatsoever like unto Him! Vision cannot perceive Him, and knowledge cannot encompass Him. He begets not, because the son resembles his father, not is He begotten, so that He could resemble the one before Him. And none is like Him. Exalted is He, the High, and Mighty from such attributions!",
"Hadith": 19
},
{
"Content": "20. Muhammad ibn Musa ibn al-Mutawakkil (may Allah have mercy on him) said: Ali ibn Ibrahim ibn Hashim said, on the authority of his father, on the authority of al-Saqr ibn [Abu] Dulaf that I asked Abu al-Hasan Ali ibn Muhammad ibn Ali ibn Musa al-Rida (AS) about Divine Unity: \"Verily, I say what Hisham ibn al-Hasam said.\" So he (AS) became angry and said: What is the matter with you and Hisham? Indeed, he is not from us who thinks that Allah, the Mighty and High, has a body. We are free from such a person in this world, and in the Hereafter. O son of [Abu] Dulaf! Verily, the body is created and Allah is its Creator.",
"Hadith": 20
},
{
"Content": "1. My father (RA) that Sad ibn Abd Allah said: Ahmad ibn Muhammad ibn Khalid, on the authority of Muhammad ibn Isa, on the authority of one he mentioned, said Abu Jafar al-Baqir (AS) was asked: \"Is it permissible to say that Allah, the Might and High, is a Thing?\" He (AS) replied: \"Yes, to the extent that it removes Him from both extremes: annulment [tatil], and anthropomorphism [tashbih].\"",
"Hadith": 1
},
{
"Content": "2. My father (RA) that Ali ibn Ibrahim, on the authority of his father, on the authority of alAbbas ibn Amr, on the authority of Hisham ibn al-Hakam that > An atheist asked Abu Abd Allah al-Sadiq (AS) \"What is He?\" He (AS) replied: He is a Thing unlike other things. If you consider the meaning of the word \"thing.\" He is indeed a Thing by definition [al-shay'iyyah], with the exception that He has neither substance nor shape\"",
"Hadith": 2
},
{
"Content": "3. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan alSaffar, on the authority of Ahmad ibn Muhammad ibn Khalid, on the authority of al-Nadr ibn Suwayd, on the authority of Yahya al-Halabi, on the authority of Ibn Muskan, on the authority of Zurarah that I heard Abu Abd Allah al-Sadiq (RA) say: \"Verily, Allah, the Blessed and Exalted, is free from His Creation, and His Creation is free from Him. Whatever can be defined by the word thing' is a creation other than Almighty Allah. Exalted is He who is beyond compare.\"",
"Hadith": 3
},
{
"Content": "4. Hamzah ibn Muhammad al-Alawi (RA) said: Ali ibn Ibrahim on the authority of his father, on the authority of Ibn Abu Umayr, on the authority of Ali ibn Atiyyah, on the authority of Khaythamah that Abu Jafar al-Basir (AS) said: Verily, Allah, Blessed and Exalted be He, is free from His Creation, and His Creation is free from Him. Whatever can be defined by the word \"thing\" is a creation other than Allah, the Mighty and High. Allah, the Exalted, is the Creator of all things.",
"Hadith": 4
},
{
"Content": "5. Muhammad ibn Ali Majilwayh (RA) said: Ali ibn Ibrahim ibn Hashim, on the authority of Muhammad ibn Isa, on the authority of Yunus ibn Abd al-Rahman, on the authority of Abu alMaghra, who eliminated the source of report from Abu Jafar, and said: Al-Baqir (AS) said: \"Verily, Allah, Blessed and Exalted be He, is free from His Creation, and His Creation is free from Him. Whatever can be defined by the word \"thing\" is a creation other than Allah, the Mighty and High.\"",
"Hadith": 5
},
{
"Content": "6. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan alSaffar, on the authority of Muhammad ibn Isa ibn Ubayd, on the authority of Abd al-Rahman ibn Abu Najran that I asked Abu Jafar the Second (AS) about Divine Unity [Tawhid], so I said: \"Is He presumed to be a thing?\" Consequently, he (AS) replied: Yes. However, since He is Incomprehensible, and Unlimited, He is unlike anything you can conceive. Nothing resembles Him. Imagination perceives Him not. And how could imagination perceive Him when He is beyond all imagination? He is an Imagined Thing which is Incomprehensible and Unlimited.",
"Hadith": 6
},
{
"Content": "7. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Abu Abd Allah al-Kufi said: Muhammad ibn Ismail al-Barmaki said: on the authority of al-Husayn ibn alHasan, on the authority of Bakr ibn Salih, on the authority of al-Husayn ibn Said that Abu Jafar the Second (Imam Muhammad al-Taqi (AS) was asked: \"Is it permissible to say that Allah is a Thing?\" Hence, he (AS) answered: \"Yes, to the extent that it removes Him from the two extremes: annulment [tatil] and anthropomorphism [tashbih].\"",
"Hadith": 7
},
{
"Content": "8. Jafar ibn Muhammad ibn Masrur (RA) said: Muhammad ibn Jafar ibn Buttah said: some of our scholars, on the authority of Muhammad ibn Isa related to me that Abu al-Hasan al-Rida (AS) said to me: \"What would you say if you were asked: Tell us, is Allah, the Mighty and High, a Thing or is He not a thing?\" He said: I said to him (AS): Allah, the Mighty and High, has acknowledged that He is a Thing when he said: Say: What thing is the weightiest in testimony? Say: Allah is a witness between you and me.1 I would say: He is a Thing unlike other things, as negating that He is a Thing would negate Him and deny Him.",
"Hadith": 8
},
{
"Content": "1. Muhammad ibn Musa ibn al-Mutawakkil (may Allah have mercy on him) said: Ali ibn Ibrahim ibn Hashim said on the authority of his father, on the authority of al-Nawfali, on the authority of al-Sakuni, on the authority of Abu Abd Allah, on the authority of his forefathers (AS) that The Prophet (SA) passed by a man who was supplication with his eyes raised to the sky. The Messenger of Allah (SA) said to him: \"Cast down your eyes for you will certainly not see Him.\" He (SA) also said that: \"The Prophet (SA) passed by a man who was supplicating with his hands raised to the sky. The Messenger of Allah (SA) said to him: Lower your hand for your will surely not reach Him.'",
"Hadith": 1
},
{
"Content": "2. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (may Allah have mercy on him) said: Muhammad ibn Abu Abd Allah al-Kufi said on the authority of Ali ibn Abu al-Qasim, on the authority of Yaqub ibn Ishaq that I wrote to Abu Muhammad al-Askari (AS) asking him how a servant could serve a Lord he cannot see? Hence, he (AS) replied in writing: \"O Abu Yusuf! My Master, my Lord, and the Benefactor upon me any my forefathers, is far above being seen.\" He said: \"I also asked whether the Messenger of Allah (SA) saw him Lord?\" He wrote back: \"Verily, Allah, the Blessed and Exalted, manifested to the Messenger what He desired from the Light of His Magnitude.\"",
"Hadith": 2
},
{
"Content": "3. Al-Husayn ibn Ahmad ibn Idris (RA) said on the authority of his father, on the authority of Muhammad ibn Abd al-Jabbar, on the authority of Safwan ibn Yahya, on the authority of Asim ibn Humayd that I consulted Abu Abd Allah al-Sadiq (AS) regarding what is narrated about the vision of Allah. Hence, he (AS) explained: The sun is a seventieth portion of the light of the Throne [al-kursi]. The throne is a seventieth portion of the light of the Empyrean [arsh]. The Empyrean is a seventieth portion of the light of the Veil [hijab]. And the Veil is a seventieth portion of the Veil of Light [sitr]. Hence, if they speak the truth, can their eyes bear the sight of the sun on a cloudless day?",
"Hadith": 3
},
{
"Content": "4. My father (RA) said: Muhammad ibn Yahya al-Attar said on the authority of Ahmad ibn Muhammad ibn Isa that Ibn Abu Nasr said on the authority of Abu al-Hasan (Ali) al-Rida (AS) that The Messenger of Allah said: \"When I was taken to heaven during the Night Journey, Jibrail took to me to a place where he had never stopped before. Hence, the Veil was remove for me and Allah, the Mighty and High, showed me what He desired from the Light of His Magnitude.\"",
"Hadith": 4
},
{
"Content": "5. My Father (RA) said: Ali ibn Ibrahim ibn Hashimsaid on the authority of his father, on the authority of Ali ibn Mabad, on the authority of Abd Allah ibn Sinan, on the authority of his father that I was in the presence of Abu Jafar al-Baqir (AS) when a Kharijite entered his presence and asked him: \"O Abu Jafar, who do you serve?\" He (AS) replied: \"Allah?\" He questioned: \"Have you seen Him?\" He (AS) answered: Eyes cannot see him through vision, but hearts can see Him through certainty of faith. He is neither recognized with analogy, nor perceived with the senses, and cannot be compared to people. He is attributed through signs and recognized through indications. There is no oppression in His Judgement. Such is Allah; there is no god but Him. He said: \"Then the man left while saying that Allah knows best where to place His Message.\"",
"Hadith": 5
},
{
"Content": "6. My father said: Sad ibn Abd Allah said: Ahmad ibn Muhammad ibn Abu Nasr on the authority of Abu al-Hasan al-Mausili, on the authority of Abu abd Allah that A rabbi came to the Commander of the Faithful (AS) and asked: \"O Commander of Faithful! Do you see your Lord when you serve Him?\" Thus, he (AS) replied: \"Woe unto you! I do not serve a Lord that I cannot see.\" The rabbi asked: \"How do you see Him?\" He (AS) responded: \"Woe unto you! The eyes do not perceive Him through vision but the hearts see Him through certainty of faith.\"",
"Hadith": 6
},
{
"Content": "7. Al-Husayn ibn Ahmad ibn Idris (RA) said on the authority of his father, on the authority of Ahmad ibn Ishaq that I wrote to Abu al-Hasan the third (al-Naqi) (AS) asking about the vision of (Allah) and what people say about it. Hence, he wrote: Vision is only possible so long so there is no obstacle between the seer and the seen. So, when there is an obstacle to vision, or lack of light between the seer and the seen, vision is impeded or inaccurate. Fault necessitates when the seer equals the seen in the cause that is required between them for vision. When it comes to vision, we can speak in anthropomorphic terms due to cause and effect.",
"Hadith": 7
},
{
"Content": "8. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Yaqub said: Ahmad ibn Idris said on the authority of Ahmad Muhammad ibn Isa, on the authority of Ali ibn Sayf, on the authority of Muhammad ibn Ubaydah that I wrote to Abu al-Hasan (Ali) al-Rida (AS) asking him about the vision of Allah and what that Sunnis and the Shiites narrate regarding the subject. I asked him to explain the subject in detail to me. Hence, he (AS) wrote in his own handwriting: All agree unanimously that Allah's recognition is necessary. So, if it is possible to see Allah, the Mighty and High, with the eyes, then recognition has taken place. And this recognition could take place with or without faith. If recognition via vision is faith, then it is not faith, because faith is the opposite of visual recognition. If recognition via vision is faith, then there would be no people of faith in the world since nobody has seen Allah, Exalted is His Remembrance. If faith is based on visual recognition, then it might vanish as a result of death and resurrection. This is sufficient proof that Allah, noble be His Remembrance, cannot be seen by the eye....",
"Hadith": 8
},
{
"Content": "9. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Yaqub al-Kulayni said on the authority of Ahmad ibn Idris, on the authority of Muhammad ibn Abd al-Jabbar, on the authority of Safwan ibn Yahya that Abu Qurrah, the traditionist, asked me to take him to Abu al-Hasan (Ali) al-Rida (AS); therefore, I asked for his permission to visit him, and he granted it to me. So, he (Abu Qurrah) went to him, and asked him about the laws regarding the permissible and the forbidden, until he reached the subject of Divine Unity. Hence, Abu Qurrah said: \"It has been transmitted to us that Allah, the Mighty and High, divided vision and speech between two prophets; allocating speech to Musa (AS) and allocating vision for Muhammad (SA).\" Consequently, Abu al-Hasan (AS) replied: Who is it that brought the revelation from Allah, the Mighty and High, to both jinn and humankind? Vision comprehends Him not, and He comprehends (all) vision.1 And they do not comprehend Him in knowledge.2 Nothing whatsoever is like unto Him.3 Was it not Muhammad He said: \"Of course?\" If that is the case, then how could he come to all of creation, saying that he was sent by Allah, call them by His Command, that vision comprehend Him not, and He comprehend all vision. And they do not comprehend Him in Knowledge. Nothing whatsoever is like unto Him, and then claim that \"I have seen Him with my own eyes. I comprehend Him, and He has a human form.\" Are people not ashamed of saying such things? The unbelievers can use this against us: claiming that Allah revealed one thing and the Prophet contradicted it! Abu Qurrah enquired: \"Then He says: And certainly he saw Him in another descent.3\" Hence, Abu al-Hasan (AS) replied: Verily, the verse after this verse stipulates what he saw, as He says, The heart was not untrue in (making him see) what he saw.4 He is saying that the heart of Muhammad (SA) was not untrue in what his eyes saw. Then He informs of what he saw and says: Certainly he saw of the greatest signs of his Lord.5 Thus, the signs of Allah, the Mighty and High, are other than Allah. As He has said: And they do not comprehend Him in knowledge. So, if the eyes saw Him, then they comprehended Him in knowledge, and recognition had taken place. Abu Qurrah enquired: \"Do you claim that the prophetic traditions are false?\" Abu al-Hasan (AS) responded: \"Any prophetic traditions which contradict the Quran are false. According to the consensus of all Muslims, He cannot be comprehended in knowledge, vision comprehends Him not, and nothing whatsoever is like unto Him.\"",
"Hadith": 9
},
{
"Content": "10. My father (RA) said: Muhammad ibn Yahya al-Attar said on the authority of Ahmad ibn Muhammad ibn Isa, on the authority of Ibn Abu Najran, on the authority of Abd Allah ibn Sinan that Abu Abd Allah al-Sadiq (AS) was asked to interpret the Word of the Mighty and High: Vision comprehends Him not, and He comprehends (all) vision. He explained: It is the comprehension of the imagination. Do you not see His Word: Verily, there have come to you clear proofs from your Lord. This does not mean the vision of eyes; however, whoever will see, it is for his own soul. And whoever will be blind, it shall be against himself.1 This does not mean blindness of the eyes. It certainly means comprehension of the imagination, like it is said: so and so has the vision of poetry, so and so has the vision of jurisprudence, so and so has the vision of coins, and so and so has the vision of clothes. Allah is far above visual perception.",
"Hadith": 10
},
{
"Content": "11. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan alSaffar said: Ahmad ibn Muhammad said on the authority of Abu Hashim al-Jafari, on the authority of Abu al-Hasan (Ali) al-Rida (AS) that I asked him whether it is possible to describe Allah, the Mighty and High. Hence, he replied: \"Do you not read the Quran?\" I responded: \"What do you mean?\" He said: \"Do you not read the Word of the Mighty and High: Vision comprehends Him not, and He comprehends (all) vision.2 I answered: \"So?\" He (AS) asked: \"Then do you know what vision means?\" I replied: \"Sure\" He (AS) said: \"What is t?\" I said: \"The vision of the eyes.\" Hence, he (AS) explained: \"Verily, the imagination of the mind is greater than the vision of the eyes. Thus, imagination comprehends Him not, and He comprehends all imagination.\"",
"Hadith": 11
},
{
"Content": "12. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Abu Abd Allah al-Kufi said on the authority of who he mentioned, on the authority of Muhammad ibn Isa, on the authority of Dawud ibn al-Qasim on the authority of Abu Hashim al-Jafari that I asked Abu Jafar ibn al-Rida (AS): \"Vision comprehends Him not, and He comprehends (all) vision. He (AS) replied: O Abu Hashim! The imagination of mind is more precise than the vision of the eyes. You may imagine Sind, India, the towns which you have not visited, and which you have not seen with your eyes. Thus, if imagination cannot comprehend Him, how can the eyes?\"",
"Hadith": 12
},
{
"Content": "13. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Abu Abd Allah al-Kufi said: Muhammad ibn Ismail al-Barmaki said: al-Husayn ibn al-Hasan said: Bakr ibn Salih said on the authority of al-Husayn ibn Said, on the authority of Ibrahim ibn Muhammad al-Khazzaz and Muhammad ibn al-Husayn both said      2  . We entered into the presence of Abu al-Hasan (Ali) al-Rida (AS). We related to him what was transmitted regarding Muhammad (SA); namely, that he saw His Lord in the form of a vigorous young man of thirty years of age, whose feet wee covered in greenery. I also explained to him that Hisham ibn Salim, Sahib al-Taqi and al-Maythami say that Allah's belly is hollow and the rest (of His body) is solid. Hence, he (AS) fell in prostration and then said: May You be Glorified! They have not recognized You, nor have they testified to Your Unity. As a result, they have described You as such. May You be glorified! Had they recognized You, they would have only described You by means of the attributes with which You have described yourself. May You be glorified! They have certainly wronged themselves by describing You with what is not worthy of You. O my God, I only describe You with the attributes with which You have described yourself, and I do not compare You with Your Creation. You are worthy of all good. Do not count me among the oppressors. Then he (AS) turned his face to us and said: \"Whatever you have imagined, imagine Allah as other than that.\" He (AS) then added: We, the Household of Muhammad (SA), are the middle way [al-Namat al-Awsat] which the exaggerator [ghali] cannot comprehend, and the neglectful follower does not reach. O Muhammad! Verily, when the Messenger of Allah (SA) looked at the grandeur of His Lord, he, the Messenger, was in a form of a vigorous young man of thirty years of age. O Muhammad! MY Lord is far above possessing the attributes of the created. He says, I asked him (AS): `May I be your ransom! Whose feet were covered in green?\" He (AS) replied: That refers to Muhammad (SA). When looked at his Lord by means of his heat, Allah covered him in the Light of His Veil until it was apparent to him what was behind the veil. Verily, the Light of Allah is green, red, and white, as well as other colors. O Muhammad, we only accept what agrees with the Book (Quran), and the Sunnah (traditions of the Prophet).",
"Hadith": 13
},
{
"Content": "14. Muhammad ibn Muhammad ibn Isam al-Kulayni (RA) said: Muhammad ibn Yaqub al-Kulayni said on the authority of Ali ibn Muhammad, on the authority of Sahl ibn Ziyad and others, on the authority of Muhammad ibn Sulayman, on the authority of Ali ibn Ibrahim al-Jafari, on the authority of Abd Allah ibn Sinan, that Abu Abd Allah al-Sadiq (AS) said: Verily, Allah is the Most Great, and the Lofty [al-rafi]. Worshippers cannot describe Him, nor can they reach the core of His Magnificence. Vision comprehends Him not, and He comprehends (all) vision; and He is the Subtle, the All-Aware. He cannot be described in terms of how,' where' and when'. And how can I describe him by means of how' when it is He who created the condition for the question how;' hence, I recognized the condition by the fact that He created the how.' And how can I describe Him in terms of where' when it was He was created space; hence, I recognized space by the fact that he created the where.' And how can I describe him in terms of when' when it was he who created time; hence, I recognized time by the fact that He created time. Thus, Allah, the Blessed and Exalted, is present in every place, and is absent from everything. Vision comprehends Him not, and He comprehends all vision. There is no god but He: the Most High, the Great. And He is the Knower of subtleties, the Aware.",
"Hadith": 14
},
{
"Content": "15. My father (RA) said: Sad ibn Abd Allah said on the authority of Ibrahim ibn Hashim, on the authority of the Ibn Abu Najran, on the authority of Muhammad ibn Sinan, on the authority of Ibrahim and al-Fadl sons fo Muhammad al-Ashariyyayn, on the authority of Ubayd ibn Zurarah, on the authority of his father that I asked Abu Abd Allah al-Sadiq (AS): \"May I be your ransom! What use to make the Messenger of Allah (SA) swoon when he received the revelation?\" He (AS) answered: \"That happened when there was nothing separating him from Allah. That happened when Allah manifested Himself to him.\" He says that he (AS) then added: \"Such is Prophethood, O Zurarah! Accept it with humility.\"",
"Hadith": 15
},
{
"Content": "16. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Ibrahim ibn Hashim said on the authority of Ibn Abu Umayr, on the authority of Murazim, that Abu Abd Allah al-Sadiq (AS) said: \"The Messenger of Allah saw his Lord, the Mighty and High, by means of his heart.\" The confirmation of this is found in the following tradition.",
"Hadith": 16
},
{
"Content": "17. What Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan al-Saffar said on the authority of Muhammad ibn al-Husayn ibn Abu al-Khattab, on the authority of Muhammad ibn al-Fudayl that I asked Abu al-Hasan al-Kazim (AS): \"Did the Messenger of Allah (SA) see his Lord, the Mighty and High?\" Hence, he (AS) replied: \"Yes, he saw Him by means of his heart. Have you not heard Allah, the Might and High that the heart was not untrue in (making him see) what he saw.1 That is to say, he did not see Him with his eyes, but he saw Him with the heart.\"",
"Hadith": 17
},
{
"Content": "18. My father (RA) said: Sad ibn Abd Allah said on the authority of al-Qasim ibn Muhammad alIsfahani, on the authority of Sulayman ibn Dawud al-Minqari, on the authority of Hafs ibn Ghiyath or someone else that I asked Abu Abd Allah al-Sadiq (AS) about the Word of Allah, the Mighty and High: Certainly, he saw of the greatest signs of his Lord.2 He (AS) replied: \"He saw Jibrail (AS). His thighs were covered in pearls like dew drops on plants. He had six hundred wings. He filled the space between the sky and the Earth.\"",
"Hadith": 18
},
{
"Content": "19. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Yaqub al-Kulayni said on the authority of Ahmad ibn Idris, on the authority of Muhammad ibn Abd al-Jabbar, on the authority of Safwan ibn Yahya that I met him1 (AS) on my return from Mecca to Khurasan and he was going to Iraq. I heard him say that \"Whoever fears Allah is feared, and whoever obeys Allah is obeyed.\" So I politely went over to him and greeted him. Hence, he (AS) returned my greetings and then added: O Fath, he who pleases the Creator does not consider the displeasure of the creation. And he who displeases the Creator deserves that that displeasure of creation overpowers him. Verily, the Creator can only be described by means of the attributes He has given Himself. And how could He be described when he made the senses incapable of conceiving Him, the concepts incapable of describing Him, and the eyes incapable of perceiving Him? He is far above the attributes of the attributers and the descriptions of the describers. He is distant in His Closeness and close in His Distance. Thus, He is near in His Farness and Far in His Nearness. Since He created conditions, the question how' cannot apply to Him. He ionized space; therefore, the question where' cannot apply to Him. IN doing so He is the Inventor [Mubdi'] of conditions and space. O Fath! Everybody is nourished with food except the Creator, the Sustainer. Verily, He created bodies, yet He has neither body nor image. He does not have parts, not does He have an end. He does not increase or decrease. He is not composed of any substance that would be found in a body. He is the Subtle, the All-Knowing, the All-Listening, and the All-Hearing. He is the One, the Unique, and the Needless. He begets not, nor is He begotten, and there is nothing equal unto Him. He is the Producer of All things. He gave shape to all bodies and made all images. IF it were as the anthropomorphist say, then the Creator could not be distinguished from the created, the Sustainer from the sustained, or the Originator from the originated. However, He is the Producer. He differs from created bodies, images and things in that He resembles nothing. I asked: \"if Allah is One and humankind is one, do they not resemble each other in oneness?\" Hence, he (AS) replied: You have said something impossible. May Allah secure you! Verily, the resemblance is limited to meaning. Names are one, and they indicate what is named. When it is said that the human being is one, it means that he is one as opposed to two. But, in fact, the human being is not truly one because his body parts are different and his colors are different. He is composed of many parts which are not the same. His blood is other than his flesh. His flesh is other than his blood. His nerves are other than his veins. His hair is other than his skin. His darkness is other than his paleness. Likewise is the rest of creation. Thus, the human being in only \"one\" in name but not \"one\" in meaning. Allah, Exalted be His Majesty, is One and there is none other than Him. There is no variation, contrast, increase, or decrease in Him. As for the human being, he is created from different parts and different substances. He is only \"one\" in combination. I enquired: As for your statement regarding \"the Subtle,\" kindly explain it to me, I know, of course, that His Subtlety differs from that of others. However, I would appreciate it if you could explain it to me in greater detail. Therefore, he (AS) answered: O Fath! I said: He is Subtle in subtleness of His Creation and in His Knowledge of microscopic matter. Do you not see His Stamp on the various types of plants, both soft and rough? And do you not contemplate the subtle creation of creatures like the gnat and the mosquito and those insects which are even smaller than these two and are almost invisible to the naked eye? In fact, they are almost invisible due to their tiny size, making it virtually impossible to differentiate the male from the female, and the young from the old. Thus, when we see the smallness of creatures in their refinement, their instinct to reproduce, and their fear of death; when we see the creatures that exist in the depths of the oceans, and in the branches of trees; when we see what exists in deserts and wastelands, and that each species has a means of communication through which they are understood by their offspring; when we see how creatures feed their offspring, and how creatures are distinguished by color, red with yellow, and white with red; then, and only then do we come to appreciate the subtlety of the Creator. Verily, everything has a precursor. Allah, the Creator, the Subtle, and the Sublime created everything out of nothing. I asked: \"May I be your ransom! Is there a creator other than the Sublime Creator?\" He (AS) replied: Verily, Allah, the Blessed and High says: Blessed be Allah, the best of creators.1 He has certainly acknowledged that there are creators among His Servants, including Jesus, the son of Mary [Isa ibn Maryam] (AS). He created from clay a figure of a bird by the will of Allah. Then he breathed into it, and it became a bird, by the will of Allah. And Samiri made for them the body of a calf that mooed.",
"Hadith": 19
},
{
"Content": "20. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Abu Abd Allah al-Kufi said: Muhammad ibn Ismail al-Barmaki said: al-Husayn ibn al-Hasan said: Bakr ibn Salih said on the authority of al-Husayn ibn Said, on the authority of Ibrahim ibn al-Hakam ibn Zuhayr, on the authority of Abd Allah ibn Jarir al- Abdi that     2  . All praise is for Allah who is neither sense, nor felt, nor touched, and who cannot be perceived with the five senses. He cannot be imagined. He cannot be described by tongues. Everything that can be sensed is created. And Allah is the Most High. Wherever He is searched He is found. All praise is for Allah who was before the ward was' (was created). The word was' was not there to describe Him. In fact, He was the First Being. No creator has made Him. Exalted be His Praise! Rather, He created things before they existed; therefore, they were as He made them. He knows what has existed, and what will exist. He was there when nothing was there, and when nothing could be heard. Thus, He existed when there was no existence.",
"Hadith": 20
},
{
"Content": "1. My father (RA) that Sad ibn Abd Allah said: Ahmad ibn Muhammad ibn Isa, on the authority of Muhammad ibn Isa, on the authority of Yunus ibn Abd al-Rahman, on Muhammad ibn Hukaym reported that I described the statement of Hisham al-Jawaliqi, and what he says about a fortunate young man, and described to him the word of Hisham ibn al-Hakam. He (AS):\" Verily, nothing resembles Allah, the Mighty and High.",
"Hadith": 1
},
{
"Content": "2. ~Ali ibn ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Yaqub said: Ali ibn Muhammad, who eliminated the source of report, on the authority of Muhammad ibn al-Faraj al-Rukhkhaji that I wrote to Abu al-Hasan al-Kazim (AS) asking hm about what Hisham ibn al-Hakam said about the body of Allah, and what Hisham ibn Salim had said about the image of Allah. So he (AS) replied to me: \"Leave the confusion of the baffled, and take refuge in Allah from Satan. Things are not as the two Hishams claim.\"",
"Hadith": 2
},
{
"Content": "3. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan alSaffar, on the authority of Sahl ibn Ziyad, on the authority of Hamzah ibn Muhammad that I wrote to Abu al-Hasan al-Kazim (AS) asking him about the substance and the shape of Allah; therefore, he (AS) wrote to me: \"Glory to the One who has none like Him, ad who is devoid of both body and image.\"",
"Hadith": 3
},
{
"Content": "4. My father (RA) that Ahmad ibn Idris said: Muhammad ibn Abd al-Jabbar, on the authority of Safwan ibn Yahya, on the authority of Ali ibn Abu Hamzah that  U         m    I said to Abu Abd Allah al-Sadiq (AS): I heard Hisham ibn al-Hakam narrating from you that Allah, the Mighty and High, has a Needless body of Light; His Recognition is necessary, and He grants it to whoever He desires from His Creation. He (AS) said: Glory to Him who is known only to Himself! There is none like Him, and He is the All-Hearing and the Al-Seeing. He cannot be confined, sensed, touched, or felt. The senses perceive Him not, and nothing can comprehend Him. He does not have a body or an image, nor lineation or delineation.",
"Hadith": 4
},
{
"Content": "5. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan alSaffar, on the authority of Sahl ibn Ziyad, on the authority of Muhammad ibn Ismail ibn Bazi, on the authority of Muhammad ibn Zayd that I came to (Ali) al-Rida (AS) asking him about Divine Unity, so he (AS) dictated to me: All praise be to Allah, the Originator, Producer, and Innovator [Mubtadi] of all things from the beginning by His Power and Wisdom, not from anything that could invalidate His Invention, nor for nay wrong cause. He created whatever He wanted how He wanted, and He did so independently in order to manifest His Wisdom, and the Reality of His Lordship. Intellects cannot grasp Him. Imagination cannot reach Him. Eyes cannot perceive Him, and scale cannot encompass Him. Speech is incapable without Him. Eyes are expressionless without Him, and rhetoric of description goes astray in Him. He is hidden without a veil and is covered without a covering. He is recognized without seeing. He is described without an image. And He is praised despite the face that He does not possess a body. There is no god but Allah, the great, the Most Exalted.\"",
"Hadith": 5
},
{
"Content": "6. Ali ibn Ahmad ibn Abd Allah ibn Ahmad ibn Abu Abd Allah al-Barqi said, on the authority of his father, on the authority of his grandfather Ahmad ibn Abu Abd Allah, on the authority of Ahmad ibn Muhammad ibn Abu Nasr, on the authority of Muhammad ibn Hukaym that I described the statement of Hisham al-Jawaliqi, and narrated for Musa al-Kazim (AS) the statement of Hisham ibn al-Hakam that He possesses a body. Hence, he (AS) said: \"Verily, nothing resembles Allah. Indecent language is better than words which give the Creator a created body or image composed of parts. Exalted from these, the High, the Great.\"",
"Hadith": 6
},
{
"Content": "7. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (may Allah be pleased with them) said: Muhammad ibn Abu Abd Allah al-Kufi said: Muhammad ibn Ismail al-Barmaki said: on the authority of al-Husan ibn al-Hasan, and al-Husayn ibn Ali, on the authority of Salih ibn Abu Hammad, on the authority of Bakr ibn Salih, on the authority of Muhammad ibn al-Husayn ibn Said, on the authority of Abd Allah in al-Mughayrah, on the authority of Muhammad ibn Ziyad said: I heard Yunus ibn Zabyan say      m   I entered in the presence of Abu Abd Allah al-Sadiq (AS) and told him: Hisham ibn al-Hakam made a long statement. I will simply summarize it: He considers Allah to be a body because things are of two types: bodies or actions of bodies. Hence, if it is not possible for the creator to be an action, it is only possible that He be a Doer. Then Abu Abd Allah (AS) replied: \"Woe to him! Does he not know that a body is extremely limited, and an image is absolutely limited? Hence, if a limit is possible then increase and decrease are possible, and if increase and decrease are possible, then He is created. I asked: \"Then what should I say? He answered: He has neither body nor image for He is the creator of bodies and images. He is devoid of parts and limits. He does not increase, nor does He decrease. If He were as he (Hisham) says then there would be no difference between the Creator and the created, or between the Inventor and the invented. However, He is the Inventor. The Creator of Bodies and Images does not resemble anything nor does anything resemble Him.",
"Hadith": 7
},
{
"Content": "8. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (may Allah be pleased with him) said: Muhammad ibn Abu Abd Allah al-Kufi said: on the authority of Muhammad ibn Ismail alBarmaki, on the authority of al-Hasan ibn Abd al-Rahman al-Hammani that  3 I said to Abu al-Hasan Musa ibn Jafar (AS): Hisham ibn al-Hakam thinks that Allah is a body. There is nothing whatsoever like unto Him, the All-knowing, the All-Hearing, the All-Seeing, the Omnipotent, the Speaker, and the Communicator. Speech, Omnipotence, and Knowledge flow from the One Same Source, None of these things are created. So he (AS) said: May Allah kill him! Does he not know that a body is limited, and that speech is other than the speaker? Allah forbid, I am free from such words. He is devoid of both body and image. He has not limits, and everything other than Him is created. Verily, everything that exists is the result of His Will and Intent which is expressed without words, the use of the tongue, or any reluctance or hesitation.",
"Hadith": 8
},
{
"Content": "9. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (may Allah have mercy on him) said: on the authority of Muhammad ibn Yaqub al-Kulayni, on the authority of Ali ibn Muhammad, on the authority of Sahl ibn Ziyad, on the authority of Ibrahim ibn Muhammad al-Hamdani that I wrote to Abu al-Hasan al-Naqi (AS), informing him that some of his following have differences on the subject of Divine Unity. Some of them say that He has a body, while others say that He has an image. So He (AS) wrote to me the following in his own handwriting: \"Glory be to Him who has no limit and who cannot be described! There is nothing whatsoever like unto Him. And He is the All-Hearing, the All-Knowing.\" He (AS) may have said: \"the All-Seeing.\"",
"Hadith": 9
},
{
"Content": "10. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (may Allah be pleased with him) said: Muhammad ibn Yahya al-Attar said: Muhammad ibn Ahmad said: Muhammad ibn Isa said, on the authority of Hisham ibn Ibrahim who said: al-Abbasi said I said to him (AS), meaning Abu alhasan al-Rida (AS): \"May I be your ransom! One of your followers told me to ask you a question about something.\" He (AS) said: \"And who would that be?\" I said: \"Al-Hasan ibn Sahl.\" He (AS) asked: \"What is the issue about?' I replied: \"It is about Divine Unity.\" He (AS) said: \"What about Divine Unity?\" I said: \"He wants to know whether Allah possesses a body or not?\" He (AS) answered me: There are three positions regarding Divine Unity. The first group attempts to describe Him through anthropomorphism. The second group attempts to describe Him through negation. And the third group attempts to describe Him without falling into anthropomorphism. Describing Him through anthropomorphism is not allowed, and describing Him through negation is not allowed. The correct position is attempting to describe him without falling into anthropomorphism.",
"Hadith": 10
},
{
"Content": "11. Muhammad ibn Ali Majilwayh (may Allah have mercy on him) said: Muhammad ibn Yahya al-Attar said: Muhammad ibn Ahmad said: on the authority of Imran ibn Musa, on the authority of al-Hasan ibn al-Abba ibn Huraysh al-Razi, on the authority of some of our scholars that The purified [Tayyib], Ali ibn Muhammad, and Abu Jafar al-Jawad (AS) both said: \"He who claims that Allah has a body, do not give him the poor-rate, and do not pray behind him.\"",
"Hadith": 11
},
{
"Content": "12. Muhammad ibn Musa ibn al-Mutawakkil (may Allah have mercy on him) said: Muhammad ibn Yahya al-Attar said: on the authority of Sahl ibn Ziyad, on the authority of Muhammad ibn Ali al-Qasani who said I wrote to him (AS) informing him that some of the people here differed on the subject of Divine Unity. He (AS) replied in writing: \"Glory be to Him who has no limit, and who cannot be described! Nothing whatsoever is like unto Him. And he is the All-Hearing, and the All-Seeing.\"",
"Hadith": 12
},
{
"Content": "13. Al-Husayn ibn Ahmad ibn Idris (may Allah have mercy on him) said, on the authority of his father, on the authority of Abu Said al-Adami, on the authority of Bishr ibn Bashshar alNaysaburi that: I wrote to Abu al-Hasan al-Naqi (AS) informing him that the people differed on the subject of Divine Unity. Some of them say \"He has a body\" while others say that \"He has an image.\" So, he (AS) wrote (back): \"Glory be to Him who has no limit, who cannot be described, and with whom nothing resembles! Nothing whatsoever is like unto Him. And He is the All-Hearing and the All-Seeing.\"",
"Hadith": 13
},
{
"Content": "14. Ahmad ibn Muhammad ibn Muhammad ibn Yahya al-Attar (may Allah have mercy on him) said: on the authority of his father, on the authority of Sahl ibn Ziyad that I wrote the following to Abu Muhammad al-Askari (AS) in the year 255 AH: O my Master! Our scholars are divided on the question of Divine Unity. Some of them say that \"He has a body,\" while others say that \"He has an image.\" O my Master! If you deem it appropriates, teach me the correct view since I do not know the answer, and be gracious to your servant. Hence, he (AS) wrote to me the following in his own handwriting: You enquired about Divine Unity. This is far from your honorable reach. Allah, the Exalted, is One, Alone, and Needless. He begets not, nor is He begotten, and none is equal unto Him. He is the Creator, and not the created. He, the Blessed and exalted, creates bodies as He wishes. He creates images as He wishes, but He is not an image. Exalted be His Praise, and Hallowed be His names. He is far above having a resemblance. There is no other than Him. Nothing whatsoever is like unto Him, and He is the All-Hearing and the All-Seeing.",
"Hadith": 14
},
{
"Content": "15. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (may Allah have mercy on him) said: Muhammad ibn al-Hasan al-Saffar said: al-Abbas ibn Maruf said, on the authority of Hammad ibn Uthman, on the authority of Abd al-Rahim al-Qasir that I wrote a letter, and sent it by hand via Abd Al-Malik ibn Ayan to Abu Abd Allah al-Sadiq (AS). In it, I asked about several issues, one of which was: \"Please inform me about Allah, the Mighty and High. Can He be described with image and lineation? If this letter reaches you, may Allah make me your ransom, write back to me with the correct vies about Divine Unity.\" So he (AS) wrote back to me, sending the letter via Abd al-Malik ibn Ayan: May Allah have mercy on you! You have enquired about Divine Unity. Allah is Greater than what your companions have ascribed. He is All-Hearing and All-Seeing, and there is nothing like unto Him. Allah is greater than the descriptions of the describers, those who describe Him inhuman terms, and those who compare Him with His creation, thus slandering Allah. Beware! May Allah have mercy on you! The correct view about Divine Unity is to be found in the attributes that Allah, the Mighty and High, revealed in the Quran. Reject anthropomorphism, and do not apply to Allah what is vain. Allah is Firmly Present. Allah is high above the descriptions of the describers. Do not exceed the Quran, as you will misled after the clear explanation has reached you.",
"Hadith": 15
},
{
"Content": "16. Ahmad ibn Muhammad ibn Yahya al-Attar (may Allah have mercy on him) said, on the authority of his father, on the authority of Sahl ibn Ziyad, on the authority of some of our scholars that I wrote to Abu al-Hasan al-Kazim (AS) asking him about the body and image of Allah, so he replied in writing: \"Glory be to Him who has nothing whatsoever like unto Him, and who is devoid of both body and image.\"",
"Hadith": 16
},
{
"Content": "17. Ahmad ibn Muhammad ibn Yahya al-Attar (may Allah be pleased with him) said, on the authority of his father, on the authority of Sahl ibn Ziyad al-Adami, on the authority of Hamzah ibn Muhammad that I wrote to Abu al-Hasan al-Kazim (AS) asking him whether Allah had a body or an image. Hence he (AS) wrote in reply: \"Glory be to Him who has nothing whatsoever like unto Him,\"",
"Hadith": 17
},
{
"Content": "18. Ali ibn Ahmad ibn Abd Allah ibn Ahmad ibn Abu Abd Allah al-Barqi (may Allah have mercy on him) said, on the authority of his father, on the authority of his grandfather Ahmad ibn Abu Abd Allah, on the authority of his father, on the authority of Abd Allah ibn Bahr, on the authority of Abu Ayyub al-Khazzaz, on the authority of Muhammad ibn Muslim that I asked Abu Jafar al-Baqir (AS) about the claim that Allah, the Mighty and High, created Adam (AS) in His Image; hence, he said: That was a recently created image. Allah favored it, and chose it over all different images. Then He attributed it to Himself like He attributed the Kabah and the Sprit to Himself. Thus, He said: My House.1 And said: And when I breathed into him My Spirit.2",
"Hadith": 18
},
{
"Content": "19. Muhammad ibn Musa ibn al-Mutawakkil (may Allah have mercy on him) said: Abd Allah ibn Jafar al-Himyari said, on the authority of Ahmad ibn Muhammad ibn Isa, on the authority alI Hasan ibn Mahbub, on the authority of Yaqub al-Sarraj that I said to Abu Abd Allah al-Sadiq (AS): \"Some of our scholars think that Allah looks like a human being, while others think that he is beardless and has curly hair.\" Abu Abd Allah (AS) fell down in prostration, then raised his head, and said: Glory be to Allah who has nothing whatsoever like unto Him! Vision cannot perceive Him, and knowledge cannot encompass Him. He begets not, because the son resembles his father, not is He begotten, so that He could resemble the one before Him. And none is like Him. Exalted is He, the High, and Mighty from such attributions!",
"Hadith": 19
},
{
"Content": "20. Muhammad ibn Musa ibn al-Mutawakkil (may Allah have mercy on him) said: Ali ibn Ibrahim ibn Hashim said, on the authority of his father, on the authority of al-Saqr ibn [Abu] Dulaf that I asked Abu al-Hasan Ali ibn Muhammad ibn Ali ibn Musa al-Rida (AS) about Divine Unity: \"Verily, I say what Hisham ibn al-Hasam said.\" So he (AS) became angry and said: What is the matter with you and Hisham? Indeed, he is not from us who thinks that Allah, the Mighty and High, has a body. We are free from such a person in this world, and in the Hereafter. O son of [Abu] Dulaf! Verily, the body is created and Allah is its Creator.",
"Hadith": 20
},
{
"Content": "1. My father (RA) that Sad ibn Abd Allah said: Ahmad ibn Muhammad ibn Khalid, on the authority of Muhammad ibn Isa, on the authority of one he mentioned, said Abu Jafar al-Baqir (AS) was asked: \"Is it permissible to say that Allah, the Might and High, is a Thing?\" He (AS) replied: \"Yes, to the extent that it removes Him from both extremes: annulment [tatil], and anthropomorphism [tashbih].\"",
"Hadith": 1
},
{
"Content": "2. My father (RA) that Ali ibn Ibrahim, on the authority of his father, on the authority of alAbbas ibn Amr, on the authority of Hisham ibn al-Hakam that > An atheist asked Abu Abd Allah al-Sadiq (AS) \"What is He?\" He (AS) replied: He is a Thing unlike other things. If you consider the meaning of the word \"thing.\" He is indeed a Thing by definition [al-shay'iyyah], with the exception that He has neither substance nor shape\"",
"Hadith": 2
},
{
"Content": "3. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan alSaffar, on the authority of Ahmad ibn Muhammad ibn Khalid, on the authority of al-Nadr ibn Suwayd, on the authority of Yahya al-Halabi, on the authority of Ibn Muskan, on the authority of Zurarah that I heard Abu Abd Allah al-Sadiq (RA) say: \"Verily, Allah, the Blessed and Exalted, is free from His Creation, and His Creation is free from Him. Whatever can be defined by the word thing' is a creation other than Almighty Allah. Exalted is He who is beyond compare.\"",
"Hadith": 3
},
{
"Content": "4. Hamzah ibn Muhammad al-Alawi (RA) said: Ali ibn Ibrahim on the authority of his father, on the authority of Ibn Abu Umayr, on the authority of Ali ibn Atiyyah, on the authority of Khaythamah that Abu Jafar al-Basir (AS) said: Verily, Allah, Blessed and Exalted be He, is free from His Creation, and His Creation is free from Him. Whatever can be defined by the word \"thing\" is a creation other than Allah, the Mighty and High. Allah, the Exalted, is the Creator of all things.",
"Hadith": 4
},
{
"Content": "5. Muhammad ibn Ali Majilwayh (RA) said: Ali ibn Ibrahim ibn Hashim, on the authority of Muhammad ibn Isa, on the authority of Yunus ibn Abd al-Rahman, on the authority of Abu alMaghra, who eliminated the source of report from Abu Jafar, and said: Al-Baqir (AS) said: \"Verily, Allah, Blessed and Exalted be He, is free from His Creation, and His Creation is free from Him. Whatever can be defined by the word \"thing\" is a creation other than Allah, the Mighty and High.\"",
"Hadith": 5
},
{
"Content": "6. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid (RA) said: Muhammad ibn al-Hasan alSaffar, on the authority of Muhammad ibn Isa ibn Ubayd, on the authority of Abd al-Rahman ibn Abu Najran that I asked Abu Jafar the Second (AS) about Divine Unity [Tawhid], so I said: \"Is He presumed to be a thing?\" Consequently, he (AS) replied: Yes. However, since He is Incomprehensible, and Unlimited, He is unlike anything you can conceive. Nothing resembles Him. Imagination perceives Him not. And how could imagination perceive Him when He is beyond all imagination? He is an Imagined Thing which is Incomprehensible and Unlimited.",
"Hadith": 6
},
{
"Content": "7. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (RA) said: Muhammad ibn Abu Abd Allah al-Kufi said: Muhammad ibn Ismail al-Barmaki said: on the authority of al-Husayn ibn alHasan, on the authority of Bakr ibn Salih, on the authority of al-Husayn ibn Said that Abu Jafar the Second (Imam Muhammad al-Taqi (AS) was asked: \"Is it permissible to say that Allah is a Thing?\" Hence, he (AS) answered: \"Yes, to the extent that it removes Him from the two extremes: annulment [tatil] and anthropomorphism [tashbih].\"",
"Hadith": 7
},
{
"Content": "8. Jafar ibn Muhammad ibn Masrur (RA) said: Muhammad ibn Jafar ibn Buttah said: some of our scholars, on the authority of Muhammad ibn Isa related to me that Abu al-Hasan al-Rida (AS) said to me: \"What would you say if you were asked: Tell us, is Allah, the Mighty and High, a Thing or is He not a thing?\" He said: I said to him (AS): Allah, the Mighty and High, has acknowledged that He is a Thing when he said: Say: What thing is the weightiest in testimony? Say: Allah is a witness between you and me.1 I would say: He is a Thing unlike other things, as negating that He is a Thing would negate Him and deny Him.",
"Hadith": 8
},
{
"Content": "1. Muhammad ibn Musa ibn al-Mutawakkil (may Allah have mercy on him) said: Ali ibn Ibrahim ibn Hashim said on the authority of his father, on the authority of al-Nawfali, on the authority of al-Sakuni, on the authority of Abu Abd Allah, on the authority of his forefathers (AS) that The Prophet (SA) passed by a man who was supplication with his eyes raised to the sky. The Messenger of Allah (SA) said to him: \"Cast down your eyes for you will certainly not see Him.\" He (SA) also said that: \"The Prophet (SA) passed by a man who was supplicating with his hands raised to the sky. The Messenger of Allah (SA) said to him: Lower your hand for your will surely not reach Him.'",
"Hadith": 1
},
{
"Content": "2. Ali ibn Ahmad ibn Muhammad ibn Imran al-Daqqaq (may Allah have mercy on him) said: Muhammad ibn Abu Abd Allah al-Kufi said on the authority of Ali ibn Abu al-Qasim, on the authority of Yaqub ibn Ishaq that I wrote to Abu Muhammad al-Askari (AS) asking him how a servant could serve a Lord he cannot see? Hence, he (AS) replied in writing: \"O Abu Yusuf! My Master, my Lord, and the Benefactor upon me any my forefathers, is far above being seen.\" He said: \"I also asked whether the Messenger of Allah (SA) saw him Lord?\" He wrote back: \"Verily, Allah, the Blessed and Exalted, manifested to the Messenger what He desired from the Light of His Magnitude.\"",
"Hadith": 2
},
{
"Content": "3. Al-Husayn ibn Ahmad ibn Idris (RA) said on the authority of his father, on the authority of Muhammad ibn Abd al-Jabbar, on the authority of Safwan ibn Yahya, on the authority of Asim ibn Humayd that I consulted Abu Abd Allah al-Sadiq (AS) regarding what is narrated about the vision of Allah. Hence, he (AS) explained: The sun is a seventieth portion of the light of the Throne [al-kursi]. The throne is a seventieth portion of the light of the Empyrean [arsh]. The Empyrean is a seventieth portion of the light of the Veil [hijab]. And the Veil is a seventieth portion of the Veil of Light [sitr]. Hence, if they speak the truth, can their eyes bear the sight of the sun on a cloudless day?",
"Hadith": 3
},
{
"Content": "4. My father (RA) said: Muhammad ibn Yahya al-Attar said on the authority of Ahmad ibn Muhammad ibn Isa that Ibn Abu Nasr said on the authority of Abu al-Hasan (Ali) al-Rida